{
    "appnews": {
        "appid": 381210,
        "newsitems": [
            {
                "gid": "5124585319845306878",
                "title": "Dead by Daylight finally collaborates with Alien after years of fans requesting it",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/VG247/5124585319845306878",
                "is_external_url": true,
                "author": "",
                "contents": "In a collaboration that fans have been desperately praying for, <a href=\"https://www.vg247.com/games/dead-by-daylight\">Dead by Daylight</a> will finally be privy to a crossover with Ridley Scott’s Alien. Honestly, for any Dead by Daylight fan, this is a pretty big deal. Dead by Daylight first launched in 2016 with an array of Killers and Survivors, and has been the host of countless horror collaborations since. Boot up the game and you’ll find Amanda from SAW, Leatherface from The Texas Chainsaw Massacre, Michael Myers from Halloween, and that’s just to name a few. Back in the day, an Alien collaboration with Dead by Daylight seemed completely off the cards. Fans have been asking for it for God knows how long, and after the Fortnite x Alien collaboration in 2021, fans have only been more desperate. Whether licensing or development issues got in the way, we don’t know, but whatever was the case doesn't matter anymore, as the long-awaited Alien crossover is finally happening. <a href=\"https://www.vg247.com/dead-by-daylight-finally-collaborates-with-alien-after-years-of-fans-requesting-it\">Read more</a> ",
                "feedlabel": "VG247",
                "date": 1690975838,
                "feedname": "VG247",
                "feed_type": 0,
                "appid": 381210
            },
            {
                "gid": "5124584686265458856",
                "title": "Dead by Daylight Alien teaser confirms Xenomorph crossover",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/PCGamesN/5124584686265458856",
                "is_external_url": true,
                "author": "editor@pcgamesn.com",
                "contents": "<strong>Dead by Daylight </strong>is the <a href=\"https://www.pcgamesn.com/15-best-horror-games-pc\">horror game</a> gift that keeps on giving, as Behaviour Interactive continues to regularly add spectacularly spooky content. Fans have long been speculating a crossover between <a href=\"https://www.pcgamesn.com/dead-by-daylight\">Dead by Daylight</a> and the iconic Alien series, hoping to see the extraterrestrial Xenomorph as one of the game's terrifying killers or the beloved Ripley as a survivor. It looks like we've now finally received confirmation of such a DBD Alien crossover chapter, as an official teaser for it has just dropped. <a href=\"https://www.pcgamesn.com/dead-by-daylight/alien-teaser\">Read the rest of the story...</a> RELATED LINKS: <a href=\"https://www.pcgamesn.com/15-best-horror-games-pc\">The best horror games on PC 2023</a> <a href=\"https://www.pcgamesn.com/dead-by-daylight/dbd-nicolas-cage-update-sadako\">The real winner of the Dead By Daylight Nic Cage update isn't Nic Cage</a> <a href=\"https://www.pcgamesn.com/dead-by-daylight/scorching-summer-bbq\">DBD Scorching Summer BBQ dates, gameplay, and rewards</a> ",
                "feedlabel": "PCGamesN",
                "date": 1690914822,
                "feedname": "PCGamesN",
                "feed_type": 0,
                "appid": 381210
            },
            {
                "gid": "5124584686264911439",
                "title": "Alien is coming to Dead by Daylight and fans are absolutely screaming in space and everywhere else",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/PC Gamer/5124584686264911439",
                "is_external_url": true,
                "author": "Andy Chalk",
                "contents": "Just a few weeks after adding legendary actor <a href=\"https://www.pcgamer.com/nic-cages-dead-by-daylight-voice-lines-will-haunt-me-for-the-rest-of-my-life/\" target=\"_blank\">Nicolas Cage</a> to its lineup, the multiplayer survival horror game Dead by Daylight has revealed that an even bigger name in horror is on the way: The Alien... <a href=\"https://www.pcgamer.com/alien-is-coming-to-dead-by-daylight-and-fans-are-absolutely-screaming-in-space-and-everywhere-else?utm_source=steam&utm_medium=referral\" target=\"_blank\">Read more.</a>",
                "feedlabel": "PC Gamer",
                "date": 1690909594,
                "feedname": "PC Gamer",
                "feed_type": 0,
                "appid": 381210
            },
            {
                "gid": "5124585319843259504",
                "title": "Steam Global Top Sellers for week of 25 Jul — 1 August 2023",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/SteamDB/5124585319843259504",
                "is_external_url": true,
                "author": "SteamDB",
                "contents": "<a href=\"https://steamdb.info/topsellers/2023W31/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\"> </a> * <a href=\"https://steamdb.info/app/1282100/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">Remnant II</a>; * <a href=\"https://steamdb.info/app/1086940/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">Baldur's Gate 3</a>; * <a href=\"https://steamdb.info/app/1675200/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">Steam Deck</a>; * <a href=\"https://steamdb.info/app/1938090/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">Call of Duty®</a>; * <a href=\"https://steamdb.info/app/381210/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">Dead by Daylight</a>; * <a href=\"https://steamdb.info/app/1895880/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">Ratchet & Clank: Rift Apart</a>; * <a href=\"https://steamdb.info/app/671860/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">BattleBit Remastered</a>; * <a href=\"https://steamdb.info/app/1174180/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">Red Dead Redemption 2</a>; * <a href=\"https://steamdb.info/app/271590/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">Grand Theft Auto V</a>; * <a href=\"https://steamdb.info/app/359550/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">Tom Clancy's Rainbow Six® Siege</a>; <i>* excluding free to play games</i> <a href=\"https://steamdb.info/topsellers/2023W31/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">View top 100 on SteamDB</a>",
                "feedlabel": "SteamDB",
                "date": 1690905600,
                "feedname": "SteamDB",
                "feed_type": 0,
                "appid": 271590
            },
            {
                "gid": "5124584686264493356",
                "title": "7.1.1 | Bugfix Patch",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5124584686264493356",
                "is_external_url": true,
                "author": "Omnia_BHVR",
                "contents": "{STEAM_CLAN_IMAGE}/11814497/1970f2f1ff481d747fd4cfc7ef90891017af464e.png Release Schedule Update Releases: 11AM ET Content Updated the Reactive Healing perk to round up to 100% health when there is only a tiny bit of healing missing (example: instead of healing a Survivor to 96.4%, it would complete the healing at 100%) Bug Fixes Perks The Scene Partner Perk's scream and animation are now played at the same time when curing from The Plague's Vile Purge. Survivors in lockers no longer scream because of Dramaturgy's effect. The Survivor is no longer slowed down temporarily when activating Dramaturgy. The Dramaturgy Perk no longer causes Items to appear during animated interactions. The Spirit no longer causes the Survivors with the Scene Partner Perk to scream when passing in front of them when Phase Walking. Scene Partner no longer activates when the Killer is Undetectable using Beast of Prey The \"Dramaturgy\" Perk no longer spawns event addons. The \"Dramaturgy\" Perk no longer spawns an Ultra Rare item. Survivors with the \"Scene Partner\" Perk now correctly scream when reviving themselves with the \"Plot Twist\" perk in front of the Killer The Plot Twist Perk is no longer briefly displayed as being usable after recovering from the Dying state Characters Fixed an issue that caused the fast Vaults to have the same vaulting distance as the Slow and Medium Vaults. Fixed an issue that caused the Survivors to be unable to be picked up by the Knight when they are downed while being pulled out from locker by the Guardia Compania Fixed an issue that caused cosmetics (Free songbird, Pro-Pain Hammer, Hound Mask and Untamed Donkey Jacket) to be missing from players inventories The Trapper's Add-on \"Wax Brick\" no longer has an incorrect value. Survivors are no longer sometimes rendered unable to move when being healed by others The Nurse's Matchbox addon no longer affects the Killer's carrying speed Hex: Huntress Lullaby activating no longer causes The Doctor and The Pig's skill checks to be silent Survivors escaping through an Exit gate no longer have their running animation stop abruptly before the Tally Screen. The Knight can now properly pick up downed Survivors hit by the basic attack while grabbed from a locker by the Guardia Compania When installing a \"Brand New Part\" on a Generator with a Toolbox and affected by the \"Overcharge\" Perk, Missed and Failed Skill Checks now correctly result in the Generator exploding For The Nurse, holding the Blink input during a Blink now correctly automatically starts the next Blink in a chain. The Onryo Condemned Mori can no longer be executed twice on the same Survivor. Audio Fixed an issue that caused the Singularity's aiming loop SFX to still be playing if it was stunned while shooting a pod or slipstreaming. Fixed an issue that caused Nicolas Cage's voice lines not to be stopped at the start of a Mori. Fixed an issue that caused the \"Lucky Stroll\" and the \"Inspiration Seeker\" outfits to play a collection music in the menu. UI Fixed a potential crash in the Hud when hiding the external Perks. Fixed an inconsistency between Bloodpoints spent and Bloodpoints displayed upon canceling the Prestige Level Up halfway. Maps Fixed an issue with an invisble collisions found in the McMillan's Estate Fixed an issue in Badham Preschool where the characters would clip out of the lockers Fixed an issue where the nurse could get stuck on Toba Landing Fixed an issue in Eirye of Crows map where the projectile detection was not working as intended Fixed an issue with the shrimp boat in the Pale Rose map where traps would clip in the ground Fixed an issue in Fractured Cowshed where the Demogorgon was able to climb over collisions Fixed an issue where BioPods could be placed out reach on Autohaven Wreckers Fixed an issue where a collision is mission next to a window in Ormond Events & Archives Fixed an issue where a Survivor player could gain progress for a Map item related challenges (ie: \"Cartophile\") without having to equip a Map. Fixed an issue where the \"Outplayed\" challenge was calculating the distance from the pallet to the Killer instead of from the pallet to the downed Survivor. Fixed an issue where the \"Outplayed\" challenge was not gaining progress from Survivors downed near The Nightmare's Dream Pallets. Console Fixed an issue that caused no subtitles when playing video on XBX and XB1. Fixed an issue that caused some players to get stuck at IIS on PS4. Fixed an issue that caused trophies are unlocked without real progression on PS5. Misc There is no longer an invisible collision in one of the hallways inside The Preschool ",
                "feedlabel": "Community Announcements",
                "date": 1690900226,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 381210,
                "tags": [
                    "patchnotes"
                ]
            },
            {
                "gid": "5124584686243971442",
                "title": "The real winner of the Dead By Daylight Nic Cage update isn't Nic Cage",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/PCGamesN/5124584686243971442",
                "is_external_url": true,
                "author": "editor@pcgamesn.com",
                "contents": "So why is Nic Cage in <strong>Dead By Daylight</strong>? Honestly, who knows, but it's kind of iconic. As <a href=\"https://www.pcgamesn.com/15-best-horror-games-pc\">horror game</a> enthusiasts from across every region of The Fog finally get their hands on the character and feel the unbearable weight of massive talent for themselves, it seems his <a href=\"https://www.pcgamesn.com/dead-by-daylight\">DBD</a> arrival has been eclipsed by a much older, much creepier foe who has cast the shadows aside after months of relative silence. <a href=\"https://www.pcgamesn.com/dead-by-daylight/dbd-nicolas-cage-update-sadako\">Read the rest of the story...</a> RELATED LINKS: <a href=\"https://www.pcgamesn.com/dead-by-daylight/scorching-summer-bbq\">DBD Scorching Summer BBQ dates, gameplay, and rewards</a> <a href=\"https://www.pcgamesn.com/dead-by-daylight/tome-16-existence\">You can play as Maria from Silent Hill 2 in DBD, kind of</a> <a href=\"https://www.pcgamesn.com/dead-by-daylight/nic-cage-voice-lines\">Nic Cage's DBD voice lines should pave the way for better survivors</a> ",
                "feedlabel": "PCGamesN",
                "date": 1690413541,
                "feedname": "PCGamesN",
                "feed_type": 0,
                "appid": 381210
            },
            {
                "gid": "5124584686243057898",
                "title": "DBD Scorching Summer BBQ dates, gameplay, and rewards",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/PCGamesN/5124584686243057898",
                "is_external_url": true,
                "author": "editor@pcgamesn.com",
                "contents": "<strong>When is the Dead by Daylight Summer BBQ event?</strong> The much-loved summer event is coming back to DBD since its last outing in August 2018. The event consisted of unique challenges where players could collect special tokens and unlock cosmetic rewards. Whether it's BBQ weather where you are or not (Sorry, Southern hemisphere and, well, the UK), the <a href=\"https://www.pcgamesn.com/dead-by-daylight\">Dead by Daylight</a> event is finally back, and Margarita Generators and Grill Hooks should help get you in a sunny mood. Reward include hot outfits and tasty charms, but you must complete special time-limited challenges to get them, so here's all the details on the most <a href=\"https://www.pcgamesn.com/dead-by-daylight/all-dead-by-daylight-killers-perks\">killer</a> event this Summer, the DBD Scorching BBQ. <a href=\"https://www.pcgamesn.com/dead-by-daylight/scorching-summer-bbq\">Read the rest of the story...</a> RELATED LINKS: <a href=\"https://www.pcgamesn.com/dead-by-daylight/dbd-codes\">DBD codes August 2023</a> <a href=\"https://www.pcgamesn.com/dead-by-daylight/alien-teaser\">Dead by Daylight Alien teaser confirms Xenomorph crossover</a> <a href=\"https://www.pcgamesn.com/15-best-horror-games-pc\">The best horror games on PC 2023</a> ",
                "feedlabel": "PCGamesN",
                "date": 1691088176,
                "feedname": "PCGamesN",
                "feed_type": 0,
                "appid": 381210
            },
            {
                "gid": "5124584686243007114",
                "title": "You can play as Maria from Silent Hill 2 in DBD, kind of",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/PCGamesN/5124584686243007114",
                "is_external_url": true,
                "author": "editor@pcgamesn.com",
                "contents": "<strong>Dead By Daylight </strong>Tome 16 Existence is here, bringing with it Nic Cage, improvements to Onyro, a new Silent Hill 2 outfit, and a whole host of changes to the asymmetrical <a href=\"https://www.pcgamesn.com/best-multiplayer-games\">multiplayer game</a>. So if you're excited about Cage's addition strap in, because there's a lot of new stuff in <a href=\"https://www.pcgamesn.com/dead-by-daylight\">Dead By Daylight</a> right now. <a href=\"https://www.pcgamesn.com/dead-by-daylight/tome-16-existence\">Read the rest of the story...</a> RELATED LINKS: <a href=\"https://www.pcgamesn.com/dead-by-daylight/dbd-nicolas-cage-update-sadako\">The real winner of the Dead By Daylight Nic Cage update isn't Nic Cage</a> <a href=\"https://www.pcgamesn.com/dead-by-daylight/scorching-summer-bbq\">DBD Scorching Summer BBQ dates, gameplay, and rewards</a> <a href=\"https://www.pcgamesn.com/dead-by-daylight/nic-cage-voice-lines\">Nic Cage's DBD voice lines should pave the way for better survivors</a> ",
                "feedlabel": "PCGamesN",
                "date": 1690407829,
                "feedname": "PCGamesN",
                "feed_type": 0,
                "appid": 381210
            },
            {
                "gid": "5124584051988872375",
                "title": "Nic Cage's DBD voice lines should pave the way for better survivors",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/PCGamesN/5124584051988872375",
                "is_external_url": true,
                "author": "editor@pcgamesn.com",
                "contents": "Hopefully you've heard by now that Nicolas Cage got lost in the fog and found himself in <strong>Dead by Daylight</strong>. If not, here's the lowdown as I can only imagine the confusion and amazement on your face right now: Nicolas Cage is the newest <a href=\"https://www.pcgamesn.com/dead-by-daylight\">DBD</a> survivor to be added to the asymmetrical <a href=\"https://www.pcgamesn.com/15-best-horror-games-pc\">horror game</a>. Not just as a voice actor - as himself. <a href=\"https://www.pcgamesn.com/dead-by-daylight/nic-cage-voice-lines\">Read the rest of the story...</a> RELATED LINKS: <a href=\"https://www.pcgamesn.com/dead-by-daylight/dbd-nicolas-cage-update-sadako\">The real winner of the Dead By Daylight Nic Cage update isn't Nic Cage</a> <a href=\"https://www.pcgamesn.com/dead-by-daylight/scorching-summer-bbq\">DBD Scorching Summer BBQ dates, gameplay, and rewards</a> <a href=\"https://www.pcgamesn.com/dead-by-daylight/tome-16-existence\">You can play as Maria from Silent Hill 2 in DBD, kind of</a> ",
                "feedlabel": "PCGamesN",
                "date": 1690309384,
                "feedname": "PCGamesN",
                "feed_type": 0,
                "appid": 381210
            },
            {
                "gid": "5124584051988449368",
                "title": "The Nicolas Cage Chapter Pack is now available on Steam!",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5124584051988449368",
                "is_external_url": true,
                "author": "ThomasBHVR",
                "contents": "Dead by Daylight’s Nicolas Cage Chapter Pack features a new Survivor, legendary actor Nicolas Cage in his deadliest role yet. Purchasing this add-on unlocks an exclusive Cosmetic: Teal Jacket as well as the Very Rare Gorgon Drip Outfit for Nicolas Cage. The new Survivor is Nicolas Cage. Countless awards. Over one hundred films. Nicolas Cage had done it all and seen it all...or so he thought. When a mysterious screenplay for “Descend Beyond” landed on his desk, he signed on without hesitation. While filming, Nick performed his dialogue with gravitas, a dark incantation that rolled off his tongue with ease. He dipped his fingers in a cup of red ink and painted symbols on the stone altar. He was so immersed he barely noticed the tendrils of black Fog slowly creeping toward him... The Nicolas Cage Chapter Pack includes: New Survivor: Nicolas Cage An exclusive Cosmetic for Nicolas Cage: Teal Jacket A Very Rare Outfit for Nicolas Cage: Gorgon Drip https://store.steampowered.com/app/2469400/Dead_by_Daylight__Nicolas_Cage_Chapter_Pack/ This is his deadliest role yet. See you in the Fog, The Dead by Daylight team.",
                "feedlabel": "Community Announcements",
                "date": 1690300940,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 381210,
                "tags": [
                    "workshop"
                ]
            }
        ],
        "count": 910
    }
}