{
    "appnews": {
        "appid": 1172470,
        "newsitems": [
            {
                "gid": "5124585319854108932",
                "title": "NEW UPDATES COMING WITH APEX LEGENDS™: RESURRECTION",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5124585319854108932",
                "is_external_url": true,
                "author": "mattrodriguez",
                "contents": "NEW UPDATES COMING WITH APEX LEGENDS™: RESURRECTION Death lurks around every corner in the Apex Games, but now is the time for Resurrection. Revenant has been rejuvenated with a new look, new abilities, and a new level of rage. Not unlocked? No problem. Play as Revenant all season long, and unlock him permanently by completing challenges. There’s something for everyone this season—from Broken Moon in Mixtape, a revamped Charge Rifle, updates to Ranked, new community Stickers from ryonello, and the new Death Dynasty Collection Event—and it all starts August 8, 2023. Stay tuned for our full list of updates in our Resurrection Patch Notes coming this Monday, August 7, 2023. LEGEND UPDATE: REVENANT https://media.contentapi.ea.com/content/dam/apex-legends/common/resurrection-season-game-updates/resurrection-season-game-updates-revenant-heirloom.jpg.adapt.1024w.jpg For years, Revenant has been mired in feelings of rage, self-hatred, and a lack of autonomy. He spent almost 300 years under the Syndicate’s thumb with the help of Hammond, and all he wanted was to escape it. Suddenly, Revenant experiences a change—he starts to glitch. Everything is out of his control. In the middle of a match, he loses his abilities only to discover they've been replaced with new ones. Someone, somewhere, has launched a new protocol. He finds that he’s able to see enemies low on health, unleash a powerful leap forward, and forge a shroud of shadows around him that blocks incoming damage. But he also knows how to hold a grudge. Revenant’s angry, confused, and now he'll find and get revenge on whoever is messing with him. PASSIVE: Assassin’s Instinct Highlight nearby visible enemies who are low on health. You crouch walk faster and have improved wall climbing. TACTICAL: Shadow Pounce Unleash a powerful pounce forwards. Hold to charge for farther distances. ULTIMATE: Forged Shadows Forge a shroud of hardened shadows around you that blocks direct damage and regenerates after breaking. Your shadows and tactical are refreshed on knockdowns. Revenant will be unlocked for all players, all-season long. Players can complete challenges by using Revenant throughout the season in order to unlock him permanently. CHARGE RIFLE UPDATE The Charge Rifle has been re-designed for immediate use in the Apex Games. No longer does the infamous weapon fire a sustained beam. Newly fitted with an Extended Sniper Mag attachment slot and boasting a number of changes to its firing mechanisms, Legends familiar with the anti-Titan model available during the Frontier Wars should feel right at home. Holding the trigger down will increase the weapon’s charge, while releasing the trigger will decrease it. Once fully charged, a powerful energy projectile is released which deals increased damage the further it travels. This projectile can pierce through multiple enemy Legends, so watch out which teammates you cozy up to! MIXTAPE: BROKEN MOON NEW TDM & GUN RUN MAP: THE CORE https://media.contentapi.ea.com/content/dam/apex-legends/common/resurrection-season-game-updates/resurrection-season-game-updates-core.jpg.adapt.1024w.jpg Broken Moon is coming to Mixtape! The Core provides a new and exciting battlefield for Gun Run and TDM. Occupying the central building gives great high ground and wide-open sightlines making it a prime location to fight over. Or take to the outer ring for prime access to Care Packages. The Core is a little bit bigger than what we’ve played previously. Zip rails help players rotate towards the action quickly and open sightlines promote a different style of gameplay and weapon meta than the other more personal, scrappier maps. NEW CONTROL MAP: PRODUCTION YARD https://media.contentapi.ea.com/content/dam/apex-legends/common/resurrection-season-game-updates/resurrection-season-game-updates-production-yard.jpg.adapt.1024w.jpg It’s been a while since our last Control map and Broken Moon brings Production Yard to Control. Contrary to our other Broken Moon map for Mixtape, Production Yard provides an intense, scrappy experience in tight quarters. Lots of boxes and cover to duck around and tight corners to set-up defense or ambushes. Also featuring Broken Moon’s Zip rails, combat pace is really high on this map and allows players to quickly shift from attacking and defending at a moment's notice. We’re hoping players find a lot of different strategies in either bunkering up and covering angles or finding some sneaky back caps using zip rails and corners. RANKED UPDATE We’ve tightened up the matchmaking, tuned LP gains, and made eliminations a steady contributor to your rise through the ranks. Dive into the nitty-gritty of why Resurrection will see some of the sweatiest matches you’ve had this summer (or winter) in our recent Ranked Update blog. RANKED REWARD REWORK In previous seasons, players achieving Diamond+ ranks would get access to an exclusive season-long Dive Trail. We’ve been observing an unintended effect where the presence of a Ranked Dive Trail during the drop would unduly influence where players wanted to land—either strongly avoiding or actively pursuing players with the trail. A reward for being a top player shouldn’t give away valuable information at a critical part of the match, so we’ve made a change to swap the Dive Trail reward with an Epic Banner Frame as the Diamond+ Ranked reward. The Epic Banner Frame lets players flex their hard-earned status at the start of a match and more importantly, every time they take down other players. Badges, Holosprays and Weapon Cosmetics will continue to be rewarded in Ranked as in previous seasons. COMMUNITY STICKER BUNDLE https://media.contentapi.ea.com/content/dam/apex-legends/common/resurrection-season-game-updates/resurrection-season-game-updates-community-sticker-bundle.jpg.adapt.1024w.jpg You love seeing Apex Legends™ fan art and so does the team, so we had to have even more enter the game. From August 8-22, pick up our latest community sticker bundle featuring a plethora of stickers (and some special holographic ones) created by ryonello! “I had a lot of fun with it and got to explore sort of the more cheeky smug mischievous like unhinged side of the characters.” “My message to aspiring artists with the community is keep going, I love you. Draw what you love and other people will love it too. And I would really love to see your work as part of the collaborations one day.” Learn more about how stickers work in our FAQ here. DEATH DYNASTY COLLECTION EVENT https://media.contentapi.ea.com/content/dam/apex-legends/common/resurrection-season-game-updates/resurrection-season-game-updates-collection-event.jpg.adapt.1024w.jpg Death becomes you, Legends. Our first event of Resurrection will be launching with the season, and you’ll be handsomely rewarded with double XP in Battle Royale from August 8-15 and then in Mixtape from August 15-22. COLLECTION EVENT ITEMS Capture 24 limited-time cosmetics before they expire, with Legendary skins for Catalyst, Loba, and more! All 24 items will be available in exchange for Apex Coins or Crafting Metals and in Death Dynasty Event Apex Packs for the entire duration of the event. You’ll automatically receive Revenant’s Death Grip Heirloom set once you’ve secured all 24 items for your eternal collection. REWARD TRACKER Earn up to 1,600 points per day, challenges refresh daily and all challenges will stack with your Battle Pass so you can complete multiple challenges at once. Complete additional goals to unlock three unique event badges and complete all three to earn a final fourth badge. https://media.contentapi.ea.com/content/dam/apex-legends/common/resurrection-season-game-updates/resurrection-season-game-updates-store-tab-tracker.jpg.adapt.1024w.jpg STORE TAB Look for limited-time offers in the Store tab and check out the weekly offers during the Death Dynasty Collection Event. https://media.contentapi.ea.com/content/dam/apex-legends/common/resurrection-season-game-updates/resurrection-season-game-updates-store-tab-1.jpg.adapt.1024w.jpg https://media.contentapi.ea.com/content/dam/apex-legends/common/resurrection-season-game-updates/resurrection-season-game-updates-store-tab-2.jpg.adapt.1024w.jpg",
                "feedlabel": "Community Announcements",
                "date": 1691184822,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 1172470
            },
            {
                "gid": "5124585319850275851",
                "title": "Apex Legends: Resurrection Gameplay Trailer",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5124585319850275851",
                "is_external_url": true,
                "author": "mattrodriguez",
                "contents": "Death is Reborn in Apex Legends: Resurrection. Revenant has been twisted into something even more sinister and his new reign of terror has begun. Experience his killer new look and deadly new abilities as he is unlocked for all players all season long. Complete challenges to unlock him permanently. Drop into the Death Dynasty Collection Event and unlock all 24 limited-time themed cosmetics before the event ends to receive Revenant’s new Scythe Heirloom. In this event, you’ll earn double XP in Battle Royale August 8-15 and in Mixtape August 15-22. Learn More: http://x.ea.com/apxl/resurrection ",
                "feedlabel": "Community Announcements",
                "date": 1691093980,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 1172470
            },
            {
                "gid": "5124584686264761603",
                "title": "Respawn is making Apex Legends' reworked Revenant a freebie",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/The Loadout/5124584686264761603",
                "is_external_url": true,
                "author": "editor@theloadout.com",
                "contents": "If you're looking forward to checking out <a href=\"https://www.theloadout.com/apex-legends\"><strong>Apex Legends</strong></a>' new Revenant rework when the long-awaited <a href=\"https://www.theloadout.com/apex-legends/season-18-release-date\">Apex Legends Season 18 release date</a> rolls around, you're in luck. Respawn Entertainment is going to make sure everyone can give him a go, even if you don't have enough Legend Tokens to unlock him. That's not all, either. Respawn Entertainment is also introducing new <strong>Apex Legends Revenant unlock quests</strong> - giving you the chance to unlock this Synthetic Nightmare permanently, for free. <a href=\"https://www.theloadout.com/apex-legends/revenant-unlock-quests\">Read the rest of the story...</a> RELATED LINKS: <a href=\"https://www.theloadout.com/apex-legends/season-18-release-date\">Apex Legends Season 18 release date, Revenant Reborn, gameplay</a> <a href=\"https://www.theloadout.com/apex-legends/season-18-charge-rifle-rework\">Apex Legends is teasing a Titanfall 2-inspired Charge Rifle change</a> <a href=\"https://www.theloadout.com/apex-legends/revenant-reborn-abilities\">﻿﻿Apex Legends leaks detail new Revenant kit ahead of expected rework</a> ",
                "feedlabel": "The Loadout",
                "date": 1690906359,
                "feedname": "The Loadout",
                "feed_type": 0,
                "appid": 1172470
            },
            {
                "gid": "5124584686261344500",
                "title": "Apex Legends: Resurrection Launch Trailer | Kill Code - Part 2",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5124584686261344500",
                "is_external_url": true,
                "author": "mattrodriguez",
                "contents": "Crypto hacks into a discarded fragment of Revenant to investigate some disturbing changes. Revenant is losing control of himself – but to who? Learn More: http://x.ea.com/apxl/resurrection ",
                "feedlabel": "Community Announcements",
                "date": 1690825584,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 1172470
            },
            {
                "gid": "5124584686261135353",
                "title": "Apex Legends is teasing a Titanfall 2-inspired Charge Rifle change",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/The Loadout/5124584686261135353",
                "is_external_url": true,
                "author": "editor@theloadout.com",
                "contents": "<strong>Apex Legends </strong>developer Respawn Entertainment has been teasing a <strong>Charge Rifle rework</strong> ahead of <a href=\"https://www.theloadout.com/apex-legends/season-18-release-date\">Apex Legends' Season 18 release date</a> and it sounds like it could be quite good news if you're a Titanfall 2 fan. Referred to as \"Project Railgun\" in the teaser Respawn Entertainment shared on X (you know, that social media platform that used to be called Twitter), it looks like <a href=\"https://www.theloadout.com/apex-legends\">Apex Legends</a>' Charge Rifle is joining Revenant and undergoing some changes that should return it back to its roots. <a href=\"https://www.theloadout.com/apex-legends/season-18-charge-rifle-rework\">Read the rest of the story...</a> RELATED LINKS: <a href=\"https://www.theloadout.com/apex-legends/season-18-release-date\">Apex Legends Season 18 release date, Revenant Reborn, gameplay</a> <a href=\"https://www.theloadout.com/apex-legends/revenant-reborn-abilities\">﻿﻿Apex Legends leaks detail new Revenant kit ahead of expected rework</a> <a href=\"https://www.theloadout.com/apex-legends/kill-code-single-player-mission\">Apex Legends' first real single-player mission is available very soon</a> ",
                "feedlabel": "The Loadout",
                "date": 1690820096,
                "feedname": "The Loadout",
                "feed_type": 0,
                "appid": 1172470
            },
            {
                "gid": "5124584686251131679",
                "title": "Let's take a look at the wonderful artworks from all the artists",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5124584686251131679",
                "is_external_url": true,
                "author": "Electronic Arts",
                "contents": "@M1sa__ When Horizon looks at you {STEAM_CLAN_IMAGE}/38098458/49d80056e8d0ef5452743f87b433daee47bf1011.jpg{STEAM_CLAN_IMAGE}/38098458/8a2d6762069b14e8a3a4cafa5514d4fde80a77e6.jpg @-猫哈噗啦咻 APEX family photo {STEAM_CLAN_IMAGE}/38098458/cc47a1e62f9b2eb247cd33bba3e5817a0e0373aa.jpg",
                "feedlabel": "Community Announcements",
                "date": 1690583423,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 1172470
            },
            {
                "gid": "5124584051988800356",
                "title": "﻿﻿Apex Legends leaks detail new Revenant kit ahead of expected rework",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/The Loadout/5124584051988800356",
                "is_external_url": true,
                "author": "editor@theloadout.com",
                "contents": "Respawn Entertainment's <a href=\"https://www.theloadout.com/apex-legends\">Apex Legends</a> is one of the <a href=\"https://www.theloadout.com/best-battle-royale-game\">best battle royale games</a> out there right now, despite what you might think, and a real reason why is the developer's continued attempts at improving the experience through new game modes, features, updates, and alterations. If you're looking forward to the next major update, you'll be pleased to know that new <strong>Apex Legends Revenant rework</strong> leaks are fully detailing his upcoming kit - it sounds like a fantastic change for the character. <a href=\"https://www.theloadout.com/apex-legends/revenant-reborn-abilities\">Read the rest of the story...</a> RELATED LINKS: <a href=\"https://www.theloadout.com/apex-legends/season-18-release-date\">Apex Legends Season 18 release date, Revenant Reborn, gameplay</a> <a href=\"https://www.theloadout.com/apex-legends/season-18-charge-rifle-rework\">Apex Legends is teasing a Titanfall 2-inspired Charge Rifle change</a> <a href=\"https://www.theloadout.com/apex-legends/kill-code-single-player-mission\">Apex Legends' first real single-player mission is available very soon</a> ",
                "feedlabel": "The Loadout",
                "date": 1690579043,
                "feedname": "The Loadout",
                "feed_type": 0,
                "appid": 1172470
            },
            {
                "gid": "5124584051988709817",
                "title": "GLOW FOR SHOW IN THE NEON NETWORK COLLECTION EVENT",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5124584051988709817",
                "is_external_url": true,
                "author": "mattrodriguez",
                "contents": "Prepare to be illuminated, Legends. Delve deeper into the nefarious plot unfolding in the Outlands by jumping into the Neon Network Collection Event. Piece together the story with our latest mode and final collection event of the season running July 25-August 8, 2023. KILL CODE: A THIEF'S BANE After biding her time, Loba’s hunt continues. Become the wolf and enter her story yourself as you breach a facility that may have started the interruption to her childhood. With shady plot abound, you’ll work through an interactive introduction before entering the Battle Royale with a twist from July 21-August 8, 2023. https://media.contentapi.ea.com/content/dam/apex-legends/common/neon-network-event/apex-legends-yos1-screenshot-05-1.png.adapt.1920w.png NODE TRACKER: BATTLE ROYALE TAKEOVER Use a Node Tracker in non-ranked Battle Royale matches to detect, locate the optimal location to connect, and hack into leads across the map to receive loot and Compute Nodes. Be quick—the battle won’t pause for you to complete the hack. Compute Nodes will be awarded post match for you to use in the new event shop. https://media.contentapi.ea.com/content/dam/apex-legends/common/neon-network-event/r5-s17-e03-actionnodefight-b-v01.png.adapt.1920w.png COMPUTE NODES & REWARD SHOP Our new event currency, Compute Nodes, puts the power in your hands. Choose what to unlock and when as you progress through the event. Bonus? Once all of the event skins have been unlocked, you can use your remaining Nodes to earn additional BP Stars to continue your seasonal progress. Challenges refresh daily and you can earn a limited amount of Compute Nodes per day. https://media.contentapi.ea.com/content/dam/apex-legends/common/neon-network-event/event-store-v1.jpg.adapt.1920w.jpg NEON NETWORK COLLECTION EVENT ITEMS Collect all 24 rave worthy limited-time cosmetics, with Legendary skins for Ash, Ballistic, Caustic, and more! All 24 items will be available in exchange for Apex Coins or Crafting Metals and in Neon Network Event Apex Packs for the entire duration of the event. Unlock all Neon Network items before the event ends to automatically receive Valkyrie’s Prestige skin: Apex Interceptor. STORE TAB Explore limited-time offers in the Store tab including Vantage’s Night Cat bundle and check out the weekly offers like Deep Sixed Bonus Bundle available July 28-August 1, 2023, or Lone Wolf Bonus Bundle available August 4-8, 2023. https://media.contentapi.ea.com/content/dam/apex-legends/common/neon-network-event/neon-network-week-1-v1.jpg.adapt.1920w.jpg https://media.contentapi.ea.com/content/dam/apex-legends/common/neon-network-event/neon-network-week-2-v1.jpg.adapt.1920w.jpg KILL CODE: PART 1 Catch up before you enter the Battle Royale with chapter one of Kill Code. ",
                "feedlabel": "Community Announcements",
                "date": 1690307110,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 1172470
            },
            {
                "gid": "5124584051973924810",
                "title": "Apex Legends devs say players are hiding from each other too much, as Season 18 promises to target ratting",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/Rock, Paper, Shotgun/5124584051973924810",
                "is_external_url": true,
                "author": "",
                "contents": "<a href=\"/apex-legends-best-guns-tier-list-weapon-stats\">Apex Legends</a> players are deliberately avoiding each other to last longer in the team <a href=\"https://www.rockpapershotgun.com/the-best-battle-royale-games\">battle-royale</a> shooter’s ranked mode, according to devs Respawn. That’s a bit of a problem when it’s a multiplayer game about, y’know, shooting - so the studio plans to target what it says is a rising trend of &ldquo;ratting&rdquo; in the upcoming Season 18. <a href=\"https://www.rockpapershotgun.com/apex-legends-devs-say-players-are-hiding-from-each-other-too-much-as-season-18-promises-to-target-ratting\">Read more</a> ",
                "feedlabel": "Rock, Paper, Shotgun",
                "date": 1689956053,
                "feedname": "Rock, Paper, Shotgun",
                "feed_type": 0,
                "appid": 1172470
            },
            {
                "gid": "5124584051971317063",
                "title": "Apex Legends™ Neon Network Collection Event Trailer",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5124584051971317063",
                "is_external_url": true,
                "author": "mattrodriguez",
                "contents": "Join the Neon Network Collection Event and uncover a shady plot in the Node Tracker battle royale takeover. You'll earn nodes you can use to unlock cosmetics in the new Reward Shop. Valkyrie's Prestige “Apex Interceptor” skin will be yours if you unlock all 24 limited-time themed cosmetics before the event ends. Sometimes an assassin needs to blend in, but now is the time for you to stand out. Learn More: http://x.ea.com/76923 ",
                "feedlabel": "Community Announcements",
                "date": 1689894820,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 1172470
            }
        ],
        "count": 901
    }
}