{
    "appnews": {
        "appid": 1086940,
        "newsitems": [
            {
                "gid": "5288974951207766887",
                "title": "Baldur's Gate 3's new patch made its thirstiest companion slower to warm up to you, with dire consequences for its beloved Sex% speedrun category",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/PC Gamer/5288974951207766887",
                "is_external_url": true,
                "author": "Ted Litchfield",
                "contents": "\"For Lae&apos;zel to decide to romance you, you no longer only need to gain high enough approval from her,\" reads one entry for <a href=\"https://www.pcgamer.com/baldurs-gate-3s-latest-patch-has-over-1000-fixesbut-most-importantly-it-lets-you-buy-a-butt-naked-statue-of-yourself/\" target=\"_blank\">Baldur&apos;s Gate 3&apos;s fourth major patch</a>. \"You must also have proven yourself worthy through your actions.\" Sounds reasonable enough, but there&apos;s a catch: an entire speedrun category has been irrevocably altered. RIP Sex%... <a href=\"https://www.pcgamer.com/baldurs-gate-3s-new-patch-made-its-thirstiest-companion-slower-to-warm-up-to-you-with-dire-consequences-for-its-beloved-sex-speedrun-category?utm_source=steam&utm_medium=referral\" target=\"_blank\">Read more.</a>",
                "feedlabel": "PC Gamer",
                "date": 1698959975,
                "feedname": "PC Gamer",
                "feed_type": 0,
                "appid": 1086940
            },
            {
                "gid": "5288974951207036175",
                "title": "After Astarion, another bugged Baldur's Gate 3 NPC shows too much",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/PCGamesN/5288974951207036175",
                "is_external_url": true,
                "author": "editor@pcgamesn.com",
                "contents": "<strong>Baldur's Gate 3</strong> is a pretty complex game so it's not surprising that bugs have cropped up. And Larian has been on the ball squashing most of them. But there's one glitch which, like Astarion's X-rated bug before it, has left an NPC with a little too much on display. Be warned, you might need the goggles for this one. <a href=\"https://www.pcgamesn.com/baldurs-gate-3/no-clothes-withers\">Read the rest of the story...</a> RELATED LINKS: <a href=\"https://www.pcgamesn.com/new-pc-games\">The best new PC games 2023</a> <a href=\"https://www.pcgamesn.com/baldurs-gate-3/patch-4-notes\">Baldur's Gate 3 patch 4 is here, and it's got over 1,000 changes</a> <a href=\"https://www.pcgamesn.com/baldurs-gate-3/barbarian-build\">Best Baldur's Gate 3 Barbarian build</a> ",
                "feedlabel": "PCGamesN",
                "date": 1698942509,
                "feedname": "PCGamesN",
                "feed_type": 0,
                "appid": 1086940
            },
            {
                "gid": "5288974951206861433",
                "title": "Unable to stop licking dead spiders? Baldur's Gate 3's latest patch might make you regret doing so",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/VG247/5288974951206861433",
                "is_external_url": true,
                "author": "",
                "contents": "You. Yes, you. <a href=\"/baldurs-gate-3-walkthrough\">Baldur's Gate 3</a>’s developers know you lick that spider carcass in the Gauntlet of Shar during every playthrough, and the game’s latest patch will ensure you might regret it next time you do. This regret, which comes in the form of the potential to lose your lunch after giving the charmed arachnid’s corpse a good long run along your tongue, in what I assume will likely be a new penalty for failing the constitution check this activates. To lull would-be spider-lickers into a false sense of security, Larian has tactfully hidden this addition among the over 1000 fixes, tweaks and changes it’s packed into the game’s fourth patch. As detailed in the <a href=\"https://store.steampowered.com/news/app/1086940/view/3729602945703684315\">patch’s notes</a>, the most notable new features it boasts include the ability to dismiss dead avatars to Withers' Wardrobe and have the skeleton explain how it works, as well as the ability to customise the appearances of hirelings when you’re recruiting them. <a href=\"https://www.vg247.com/baldurs-gate-3-patch-four-spider-licking-regret\">Read more</a> ",
                "feedlabel": "VG247",
                "date": 1698938574,
                "feedname": "VG247",
                "feed_type": 0,
                "appid": 1086940
            },
            {
                "gid": "5288974951206802942",
                "title": "Yaaas, AMD's FSR 2.2 has finally been patched into Baldur's Gate 3",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/PC Gamer/5288974951206802942",
                "is_external_url": true,
                "author": "Dave James",
                "contents": "I&apos;ve personally been waiting for this moment since the full release of <a href=\"https://www.pcgamer.com/baldurs-gate-3-guide/\" target=\"_blank\">Baldur&apos;s Gate 3</a>&#x2014;FSR 2.2 is now sitting pretty in the graphics options, ready to give you higher frame rates and a way better visual experience than the sparkling aliased nightmare of the first gen FSR it launched with... <a href=\"https://www.pcgamer.com/baldurs-gate-3-fsr-2-2-now-available?utm_source=steam&utm_medium=referral\" target=\"_blank\">Read more.</a>",
                "feedlabel": "PC Gamer",
                "date": 1698936775,
                "feedname": "PC Gamer",
                "feed_type": 0,
                "appid": 1086940
            },
            {
                "gid": "5288974951206422698",
                "title": "Baldur's Gate 3's latest patch has over 1,000 fixes—but most importantly, it lets you buy a butt-naked statue of yourself",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/PC Gamer/5288974951206422698",
                "is_external_url": true,
                "author": "Harvey Randall",
                "contents": "<a href=\"https://www.pcgamer.com/baldurs-gate-3-guide/\"><strong>Baldur&apos;s Gate 3</strong></a><strong> </strong>just received its fourth <a href=\"https://baldursgate3.game/news/patch-4-now-live_96\" target=\"_blank\">major patch</a>. Once more, the thing&apos;s big enough to break the Steam notes. While there aren&apos;t any new major features&#x2014;like the third patch&apos;s <a href=\"https://www.pcgamer.com/baldurs-gate-3s-third-patch-just-dropped-and-its-over-20000-words-bigfixing-small-holes-your-lovers-going-cold-after-prison-thieving-skeletons-and-counterspelling-a-nuke/\">appearance-changing mirror</a> or, equally as important, letting <a href=\"https://www.pcgamer.com/the-first-major-baldurs-gate-3-patch-is-absolutely-massive-making-it-easier-to-friendzone-gale-and-letting-short-kings-smooch-karlachplus-over-1000-fixes-to-bugs-animations-and-story-weirdness/\">small characters</a> kiss Karlach&#x2014;it&apos;s still packed with changes... <a href=\"https://www.pcgamer.com/baldurs-gate-3s-latest-patch-has-over-1000-fixesbut-most-importantly-it-lets-you-buy-a-butt-naked-statue-of-yourself?utm_source=steam&utm_medium=referral\" target=\"_blank\">Read more.</a>",
                "feedlabel": "PC Gamer",
                "date": 1698927942,
                "feedname": "PC Gamer",
                "feed_type": 0,
                "appid": 1086940
            },
            {
                "gid": "5288974951206223130",
                "title": "Baldur's Gate 3 patch 4 is here, and it's got over 1,000 changes",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/PCGamesN/5288974951206223130",
                "is_external_url": true,
                "author": "editor@pcgamesn.com",
                "contents": "<strong>Baldur's Gate 3</strong> patch 4 has arrived, as developer Larian Studios continues to polish one of 2023's best games to a fine sheen. With over 1,000 changes in this latest BG3 update on Steam, it's clear that the team is still hard at work on making your in-game experience even better, and as someone who is still far from done with my multiple playthroughs including a full four-player run I'm certainly happy about that. <a href=\"https://www.pcgamesn.com/baldurs-gate-3/patch-4-notes\">Read the rest of the story...</a> RELATED LINKS: <a href=\"https://www.pcgamesn.com/baldurs-gate-3/no-clothes-withers\">After Astarion, another bugged Baldur's Gate 3 NPC shows too much</a> <a href=\"https://www.pcgamesn.com/new-pc-games\">The best new PC games 2023</a> <a href=\"https://www.pcgamesn.com/baldurs-gate-3/barbarian-build\">Best Baldur's Gate 3 Barbarian build</a> ",
                "feedlabel": "PCGamesN",
                "date": 1698942661,
                "feedname": "PCGamesN",
                "feed_type": 0,
                "appid": 1086940
            },
            {
                "gid": "5288974951206193232",
                "title": "Latest Baldur's Gate 3 update adds colour-blind settings, hireling customisation and best of all, sponge baths",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/Rock, Paper, Shotgun/5288974951206193232",
                "is_external_url": true,
                "author": "",
                "contents": "Larian have released a new <a href=\"/baldurs-gate-3-class-list\">Baldur's Gate 3</a> update, Patch 4, which applies 1000 fixes and changes to the indecently expansive fantasy <a href=\"https://www.rockpapershotgun.com/best-rpgs\">RPG</a> - far too many to list on Steam. The most significant additions are accessibility settings for colour-blind people, the ability to visually customise hirelings upon recruitment, and the ability to clean up party members using sponges and soap, rather than lobbing bottles of water at them. No more rocking up to cutscenes looking like Sweeney Todd on his lunchbreak! Well, unless that's your vibe. <a href=\"https://www.rockpapershotgun.com/latest-baldurs-gate-3-update-adds-colour-blind-settings-hireling-customisation-and-best-of-all-sponge-baths\">Read more</a> ",
                "feedlabel": "Rock, Paper, Shotgun",
                "date": 1698922635,
                "feedname": "Rock, Paper, Shotgun",
                "feed_type": 0,
                "appid": 1086940
            },
            {
                "gid": "5288974951206071308",
                "title": "Patch #4 Now Live!",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5288974951206071308",
                "is_external_url": true,
                "author": "SaloAtLarian",
                "contents": "Hello everyone, Patch 4 is now live for Baldur’s Gate 3. Today’s update clocks in at over 1000 fixes, tweaks and changes, once again flying past the Steam character limit. This patch introduces a setting for colour-blind people, and allows for visual customisation of hirelings upon recruitment! No more Extreme Makeover: Faerûn Edition. In this update, we’ve added a setting in the Accessibility tab that will allow you to choose between protanopia, deuteranopia, or tritanopia, which will apply to character outlines and circles, character map markers, frame portraits in turn order, and party portraits. We hope that including these settings will allow you to more easily differentiate between friends, foes, and help with navigating combat! {STEAM_CLAN_IMAGE}/35190511/f73a15321e78814be7cf73cca58e5afe13fff5f9.gif As these patch notes are once again beefy, head to the following link to digest them in their full glory. If you’re here for the highlights, read on! We continue to work on further fixes, features, and updates. If you have any issues, please reach out to our support team. Thank you for playing Baldur’s Gate 3. HIGHLIGHTS You can now dismiss dead avatars to Withers' Wardrobe. Withers will now also explain how the wardrobe works. You can now customise hirelings' appearance when recruiting them. Colour-blind mode: We've added a setting to the Accessibility tab that will allow you to choose protanopia, deuteranopia, or tritanopia. This affects the colours used to distinguish factions and relations: map and minimap icons, portrait frames, and character outlines and circles. Gameplay Refined Scratch's fetch behaviour. He will now fetch... pretty much everything. Archfey warlocks now get a choice of cantrip at Level 4 as intended. Updated the mechanics of Speak with Dead so that you can cast it again if you didn't ask any questions the first time. (For example, if you're told the corpse doesn't want to speak to its killer, and then you cast the spell again in Wild Shape.) At Level 6, Knowledge Domain clerics will now correctly gain 'Channel Divinity: Read Thoughts', Nature Domain clerics will now correctly gain 'Dampen Elements', and Trickery Domain clerics will now correctly gain 'Channel Divinity: Cloak of Shadows'. When you purchase a statue from Boney in the circus, you can now choose to make it look like you in full equipment, in camp clothes, or naked. Scratch's ball will now be harder to lose. If you lost his ball, go see him at camp and he might give it back. (Ball warranty voided for chasm-related accidents.) Added a controller option so that, if you want, you can have the End Turn button require a hold instead of a tap. Fixed the Enemy of Justice condition sometimes applying when it shouldn't. Fixed an issue where assaulting someone while Invisible would still cause a guard to spot you and start a dialogue with you if there was a civilian nearby. Halsin will no longer spontaneously decide it'd be fun to turn into a bear before he talks to you in Act I. Added more autosaves in the Shadow-Cursed Lands and to several Wyrm's Crossing and Lower City locations, including the Steel Watch Foundry, Iron Throne, and Rivington. Licking the hunk of spider meat in the Gauntlet of Shar might make you sick. You should have listened to Gale. You can now read the recipe for the Emperor's favourite soup. You can now use sponges and soaps to clean up your party members, removing grime, blood, and bad odours! Combat Cazador suddenly remembered he can turn into mist and fly, so he'll no longer give up the ghost if he falls into a chasm. Fixed an inconsistent issue where enemies wouldn't do anything during combat except Dash and move. Fixed some NPCs being able to shoot through floors and ceilings. They've said they'll play fair. Flow We've told Mol to be more polite and thank you if you saved Mirkon from the harpies. This will close up the quest correctly. Added better multiplayer support for the post-celebration night in Act I. Now all avatars can choose which companion they want to get jiggy with. Lae'zel was having trouble getting over Act I and Act II. She'll no longer make certain comments in Act III as though you're still in the earlier stages of your adventure. Blocked some quest updates for Jaheira's quest when you skip certain parts of it to avoid spoiling big reveals. The Gur will now support you in the endgame if their questline was peacefully resolved in Cazador's lair. If Avatar Gale or a Tav with Gale as a recruited companion is nearby to witness the elder brain in the Colony, they will be preferred as the active speaker in the dialogue for Gale's origin moment. Added new dialogue options for Minsc when he learns about the connection between the Dark Urge and Gortash. Now Connor will disappear if Mayrina decides to destroy the hag wand in Act III. You can also talk to him if you resurrect him with the wand. Yenna now correctly returns to camp after a companion is abducted. Gale should no longer complain about you making a deal with Raphael if you haven't. Art Tweaked the colour of the Potion of Mind Reading to distinguish it from Potions of Healing. Animation Added some new idle animations and behaviours for Minthara, Halsin, Shadowheart, and Lae'zel at camp. Karlach will now feel more alive while idle in camp rather than just standing there doing nothing. UI You can now customise which solution is selected in the second slot of the Alchemy panel. Added map markers for when characters want to talk to you. Added unique map icons for the Magic Mirror and Withers' Wardrobe. Improved the Skills section of the Character Sheet: Added icons for the individual skills, added stars to indicate Proficiency and Expertise in certain skills, and improved the skill tooltips. Combat rounds are now displayed under separate headings in the Combat Log so it's easier to distinguish when things happened. Read the full Patch Notes here ",
                "feedlabel": "Community Announcements",
                "date": 1698920049,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 1086940,
                "tags": [
                    "mod_reviewed",
                    "ModAct_1294976491_1698922230_0",
                    "mod_require_rereview"
                ]
            },
            {
                "gid": "5288974951203532075",
                "title": "Powered by spite, Baldur's Gate 3 speedrunner cleaves 12 minutes off the world record with dozens of glitches—like trapping a villain in a child's body and knocking them out",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/PC Gamer/5288974951203532075",
                "is_external_url": true,
                "author": "Harvey Randall",
                "contents": "If there&apos;s one thing I&apos;ve learned from my time on the internet, it&apos;s that you never, ever challenge a speedrunner. They <em>live </em>for challenges. <a href=\"https://www.pcgamer.com/baldurs-gate-3-guide/\"><strong>Baldur&apos;s Gate 3</strong></a> is so open-ended it nudges into immersive sim territory&#x2014;which means that its speedrun tactics have been suitably hare-brained, and runner Mae has been at the centre of them time and time again. <strong>Heads up, I&apos;ll be getting into some spoiler territory here.</strong>.. <a href=\"https://www.pcgamer.com/powered-by-spite-baldurs-gate-3-maverick-cleaves-12-minutes-off-the-world-record-with-dozens-of-glitcheslike-trapping-a-villain-in-a-childs-body-and-knocking-them-out?utm_source=steam&utm_medium=referral\" target=\"_blank\">Read more.</a>",
                "feedlabel": "PC Gamer",
                "date": 1698859544,
                "feedname": "PC Gamer",
                "feed_type": 0,
                "appid": 1086940
            },
            {
                "gid": "5288974951202518506",
                "title": "Baldur's Gate 3's Astarion wants Shadowheart Stardew Valley DLC",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/PCGamesN/5288974951202518506",
                "is_external_url": true,
                "author": "editor@pcgamesn.com",
                "contents": "Everyone loves Bing Bong, the adorable imp that was introduced during the <strong>Baldur's Gate 3</strong> live-action DnD session. It's not just the fans who want him in the Larian game though, as the core cast is also calling for him to be DLC, and Astarion actor Neil Newbon has it all figured out. <a href=\"https://www.pcgamesn.com/baldurs-gate-3/bing-bong-dlc\">Read the rest of the story...</a> RELATED LINKS: <a href=\"https://www.pcgamesn.com/baldurs-gate-3/concert\">Hear Baldur's Gate 3's epic fantasy soundtrack performed live</a> <a href=\"https://www.pcgamesn.com/baldurs-gate-3/mod-better-context-menu\">Baldur's Gate 3's most essential tool gets a much-needed upgrade</a> <a href=\"https://www.pcgamesn.com/baldurs-gate-3/south-park-joke\">Baldur's Gate 3 South Park joke gets swift correction from Larian</a> ",
                "feedlabel": "PCGamesN",
                "date": 1698835092,
                "feedname": "PCGamesN",
                "feed_type": 0,
                "appid": 1086940
            }
        ],
        "count": 942
    }
}