{
    "appnews": {
        "appid": 1172470,
        "newsitems": [
            {
                "gid": "5480373588801846825",
                "title": "EXTERMINATE THE ENEMY IN THE HARBINGERS COLLECTION EVENT",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5480373588801846825",
                "is_external_url": true,
                "author": "mattrodriguez",
                "contents": "Take heed, Legends, night has fallen and with it has come the messengers of Death. No need to lose your head. Take up a Rev Shell and set sights on your target for a limited-time in Living Shell Trios. And with the night still young yet, enter World’s Edge After Dark, a hellish variant live with the Harbingers Collection Event from September 19 to October 3, 2023. Unlock all 24 limited-time cosmetics before the event ends to earn our latest heirloom, Fuse's Razor's Edge. NEW LIMITED-TIME: LIVING SHELL TRIOS https://media.contentapi.ea.com/content/dam/apex-legends/common/harbinger-event/copy-of-apex-s18-e02-harbinger-action-fsrv-skull-r1-a.png.adapt.1920w.png A new ordnance is upon us—the Rev Shell. For a limited-time, take out your enemies with a target-seeking grenade that looks almost as scary as the damage it does. Grab a shell, toss it in the air, and it will take care of the rest—looking for valid targets before dealing significant damage. But beware, your opponents can take aim and shoot it down to cause an early detonation. Living Shell Trios is available for the full length of the Harbingers Collection Event, September 19 to October 3, 2023. MAP: WORLD’S EDGE AFTER DARK https://media.contentapi.ea.com/content/dam/apex-legends/common/harbinger-event/copy-of-apex-s18-e02-harbinger-map-we-ad-v01.png.adapt.1920w.png Shrouded in Darkness, World’s Edge becomes a bewitched battleground featuring updates to once familiar POIs. Enter the Pain Yard at your own risk to fight around a train going nowhere, or keep warm by The Tree in its flaming glory. But watch out for lava—it’s a MRVN’s worst nightmare and may be yours too. COLLECTION EVENT ITEMS Unlock 24 death-defying limited-time cosmetics, with Legendary skins for Fuse, Bloodhound, and more! All 24 items will be available in exchange for Apex Coins or Crafting Metals and in Harbingers Event Apex Packs† for the entire duration of the event. No need to ease off the caffeine. Pick up every limited-time item before the event ends to automatically unlock Walter “Fuse” Fitzroy Jr’s heirloom: the Razor’s Edge. REWARD TRACKER You can earn up to 1,400 points per day, challenges refresh daily, and all challenges stack with your Battle Pass so you can complete multiple challenges at once. Take on additional skill-based goals to unlock three unique variants of the Harbingers badge, and collect all three to unlock a grand final badge for completing everything. https://media.contentapi.ea.com/content/dam/apex-legends/common/harbinger-event/harbingers-ce-prize-track-v1.jpg.adapt.1920w.jpg Full Blog here: https://www.ea.com/games/apex-legends/news/harbingers-event ",
                "feedlabel": "Community Announcements",
                "date": 1695153623,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 1172470
            },
            {
                "gid": "5480373588797774668",
                "title": "Titanfall 2’s matchmaking gets quietly fixed, reigniting hopes of Titanfall 3 amid cryptic Apex Legends teaser",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/Rock, Paper, Shotgun/5480373588797774668",
                "is_external_url": true,
                "author": "",
                "contents": "Could Titanfall 3 finally be on the way? It’s a hope that fans of Respawn’s beloved <a href=\"https://www.rockpapershotgun.com/best-fps-games\">shooter</a> have been holding onto for the best part of a decade now, but recent evidence in the form of quiet updates to <a href=\"https://www.rockpapershotgun.com/games/titanfall-2\">Titanfall 2</a> and a cryptic teaser for its spiritual successor <a href=\"https://www.rockpapershotgun.com/game/apex-legends/\">Apex Legends</a> has given them renewed hope that something new might be on the way. <a href=\"https://www.rockpapershotgun.com/titanfall-2s-matchmaking-gets-quietly-fixed-reigniting-hopes-of-titanfall-3-amid-cryptic-apex-legends-teaser\">Read more</a> ",
                "feedlabel": "Rock, Paper, Shotgun",
                "date": 1695056920,
                "feedname": "Rock, Paper, Shotgun",
                "feed_type": 0,
                "appid": 1172470
            },
            {
                "gid": "5480373588793326847",
                "title": "Titanfall 2 is back online, and fans think recent Apex Legends patch notes are teasing more",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/VG247/5480373588793326847",
                "is_external_url": true,
                "author": "",
                "contents": "After years of being unplayable online, <strong>Titanfall 2</strong> has recently received an update that finally allows for multiplayer once again. For a long while now, the much loved but not massively successful first person shooter Titanfall 2 has been essentially impossible to play online. But, as shared in the <a href=\"https://www.reddit.com/r/titanfall/comments/16fcaxp/vanilla_titanfall2_is_confirmed_playable_also/\">Titanfall subreddit</a>, the game has had an update that appears to have fixed the game's multiplayer servers. Up until recently, matchmaking was basically impossible, and server stability was often shaky at best. This recent update has fixed those issues though, alongside adding in new and old game modes, which have been rotated in and out since the update went live. A number of other issues have been changed too, like glitches, out-of-bounds exploits, as well as some changes to the map's geometry. Most notably, though, a number of Nessie plushies, Apex Legend's mascot, that are holding hammers have been spotted across the various parts of the maps that have been tweaked, as spotted by <a href=\"https://www.reddit.com/r/Games/comments/16jf0bo/there_is_something_going_on_with_titanfall_2/\">another user on Reddit</a>. <a href=\"https://www.vg247.com/titanfall-2-online-multiplayer-update\">Read more</a> ",
                "feedlabel": "VG247",
                "date": 1694951268,
                "feedname": "VG247",
                "feed_type": 0,
                "appid": 1172470
            },
            {
                "gid": "5480373588790000473",
                "title": "Respawn is seemingly teasing an Apex Legends x Titanfall crossover",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/The Loadout/5480373588790000473",
                "is_external_url": true,
                "author": "editor@theloadout.com",
                "contents": "Often hailed as one of the <a href=\"https://www.theloadout.com/best-fps-games\">best FPS games</a> ever made, <strong>Titanfall 2</strong> remains a crowning achievement for Respawn Entertainment. While the beloved shooter retains a loyal fandom, the game itself has long been abandoned by the <a href=\"https://www.theloadout.com/apex-legends\"><strong>Apex Legends</strong></a> developer - until now. A surprise update is available to download, alongside some new teases in the latest Apex Legends patch notes. <a href=\"https://www.theloadout.com/apex-legends/titanfall-2-tease-patch-notes\">Read the rest of the story...</a> RELATED LINKS: <a href=\"https://www.theloadout.com/apex-legends/ranks\">Apex Legends ranks, Season 18, RP changes, more</a> <a href=\"https://www.theloadout.com/apex-legends/tier-list\">Apex Legends tier list - the top picks for Season 18</a> <a href=\"https://www.theloadout.com/apex-legends/free-characters-revenant-future\">Apex Legends isn't ruling out making more legends free after Revenant</a> ",
                "feedlabel": "The Loadout",
                "date": 1694871708,
                "feedname": "The Loadout",
                "feed_type": 0,
                "appid": 1172470
            },
            {
                "gid": "5480373588783184594",
                "title": "Apex Legends: Harbingers Collection Event Trailer",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5480373588783184594",
                "is_external_url": true,
                "author": "mattrodriguez",
                "contents": "The Messengers of Death have arrived, turning Battle Royale into “Living Shell Trios” during the Harbingers Collection Event. Unleash the new “Rev Shell”, a target-seeking grenade that chases its victims before detonating on impact. Drop into World’s Edge After Dark, a hellish version of Talos’ battleground, complete with the resurrected Train. But that’s not all, as darkness summons all-new items to earn on the Rewards Track, plus a Collection of 24 limited-time cosmetics like Gibraltar’s “Grave Protector” skin and matching “Eclipse Bringer” Charge Rifle skin, perfect for ushering foes to the underworld. Unlock all 24 limited-time items before the event ends and receive Fuse’s Heirloom “Razor’s Edge” – an electric guitar, tuned to shred any squad. This event truly signals the end of the world as we know it. What a time to be alive, or dead. Learn More: http://x.ea.com/apxl/harbingers-event",
                "feedlabel": "Community Announcements",
                "date": 1694711228,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 1172470
            },
            {
                "gid": "5141476355680615951",
                "title": "Revenant unlocked all season long",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5141476355680615951",
                "is_external_url": true,
                "author": "mattrodriguez",
                "contents": "{STEAM_CLAN_IMAGE}/38098458/5530ddcd7729f124909eda6ed58cd1a0a2841c64.jpg For years, Revenant has been mired in feelings of rage, self-hatred, and a lack of autonomy. He spent almost 300 years under the Syndicate’s thumb with the help of Hammond, and all he wanted was to escape it. Suddenly, Revenant experiences a change—he starts to glitch. Everything is out of his control. In the middle of a match, he loses his abilities only to discover they've been replaced with new ones. Someone, somewhere, has launched a new protocol. He finds that he’s able to see enemies low on health, unleash a powerful leap forward, and forge a shroud of shadows around him that blocks incoming damage. But he also knows how to hold a grudge. Revenant’s angry, confused, and now he'll find and get revenge on whoever is messing with him. PASSIVE: Assassin’s Instinct Highlight nearby visible enemies who are low on health. You crouch walk faster and have improved wall climbing. TACTICAL: Shadow Pounce Unleash a powerful pounce forwards. Hold to charge for farther distances. ULTIMATE: Forged Shadows Forge a shroud of hardened shadows around you that blocks direct damage and regenerates after breaking. Your shadows and tactical are refreshed on knockdowns. Revenant will be unlocked for all players, all-season long. Players can complete challenges by using Revenant throughout the season in order to unlock him permanently. ",
                "feedlabel": "Community Announcements",
                "date": 1694032897,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 1172470
            },
            {
                "gid": "5141476355676794622",
                "title": "BLOOD MOON SALE",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5141476355676794622",
                "is_external_url": true,
                "author": "mattrodriguez",
                "contents": "{STEAM_CLAN_IMAGE}/38098458/86ea72d94b9d1aff0f1713938c2ec3194138ed51.png Shop for Legendary Skins, Bundles, Apex Packs*, and More in the Apex Legends™ Blood Moon Store. From September 5 - September 19 enjoy limited-time discounts on bundles and more! Check out the new Legendary skins for Loba - “Lycan Hunter” and Horizon - “Spectral Slayer” and returning Legendary Skins for Wraith “Rift Stalker” and the R-99 “Gilded Fang”. Drop in to Apex Legends™ and check out the Store tab today! *Not available in all regions For more details on Apex Packs including probability rates and items available, please visit our FAQ.",
                "feedlabel": "Community Announcements",
                "date": 1693942340,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 1172470
            },
            {
                "gid": "5141476355662047565",
                "title": "Apex Legends™ EA Play* Juiced Up Weapon Charm",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5141476355662047565",
                "is_external_url": true,
                "author": "yellowcup",
                "contents": "Join EA Play to make your games more rewarding with access to great player benefits and a library of top titles. Members get more from your game including monthly member-only rewards like Weapon Charms in Apex Legends. And when it’s time to find your next favorite game, we’ve got you covered with an ever-expanding library of our fan-favorite series and premium games. You can even try out select new release games for up to 10 hours of playtime with no commitment. If you decide to buy, your saved progress will carry over, so you can continue where you left off. Our members also save on purchases of EA digital content, with a 10% member discount. Letting you save on full games, points packs, and DLC. Find out more about upcoming EA Play benefits at https://store.steampowered.com/subscriptions/ea or follow us on Twitter and Instagram @eaplay! *CONDITIONS, LIMITATIONS AND EXCLUSIONS APPLY. SEE https://tos.ea.com/legalapp/eaplay/US/en/PC/ FOR DETAILS. ",
                "feedlabel": "Community Announcements",
                "date": 1693592772,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 1172470
            },
            {
                "gid": "5141475722341704238",
                "title": "Respawn begin unbanning various Apex Legends Linux and Steam Deck players",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/GamingOnLinux/5141475722341704238",
                "is_external_url": true,
                "author": "",
                "contents": "It's been a bit of a saga for Apex Legends players using the Proton compatibility tool to play it on Steam Deck and Linux desktop but it seems Respawn continue their ban investigation. Read the full article here: https://www.gamingonlinux.com/2023/08/respawn-begin-unbanning-various-apex-legends-linux-and-steam-deck-players ",
                "feedlabel": "GamingOnLinux",
                "date": 1693228638,
                "feedname": "GamingOnLinux",
                "feed_type": 0,
                "appid": 1172470
            },
            {
                "gid": "5141475722326474956",
                "title": "Respawn now properly looking into Apex Legends bans on Linux & Steam Deck",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/GamingOnLinux/5141475722326474956",
                "is_external_url": true,
                "author": "",
                "contents": "Around five days ago I reported on Apex Legends doing a ban wave which for the second time hit a bunch of players on Linux and Steam Deck playing it with Proton. Now at least the developer Respawn is looking into it. Read the full article here: https://www.gamingonlinux.com/2023/08/respawn-now-properly-looking-into-apex-legends-bans-on-linux-steam-deck ",
                "feedlabel": "GamingOnLinux",
                "date": 1692867315,
                "feedname": "GamingOnLinux",
                "feed_type": 0,
                "appid": 1172470
            }
        ],
        "count": 924
    }
}