{
    "appnews": {
        "appid": 440,
        "newsitems": [
            {
                "gid": "5218041989047908203",
                "title": "Seasonalander Fall 2023",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5218041989047908203",
                "is_external_url": true,
                "author": "EricS",
                "contents": "{STEAM_CLAN_IMAGE}/554111/8be58624e9d3302a05566172e8e1224906bf9251.png (Image credit: SFM Render - Bishop, Compositing/Overlays - Father Hoovy Is Moist, Organization - IanTheAwsm) Seasonalander has arrived for the Fall of 2023! This season will be raising funds for the British Red Cross, a global humanitarian organization whose work includes helping people in the UK and overseas when emergencies happen, preventing or easing human suffering around the world, supporting victims of modern slavery and trafficking, and protecting people in armed conflict. Seasonalander has set an initial goal of £1,000 with funds going directly towards immediate relief like food, support, equipment and shelter. More information on the British Red Cross can be found here! Seasonalander is a Highlander-based 9v9 tournament that uses community-created maps based on the current season of the year, which is currently Fall/Autumn! This season will feature over 72 talented creators from across the Team Fortress 2 community in both North America and Europe in hopes of bringing the Team Fortress 2 community together for several various causes! Come see your favorites entertain by throwing hands and raising funds for those in need! Help get the word out and be sure to tune in on the 21st and 22nd of October! European games will start at 3pm GMT / 10am EDT on both Saturday & Sunday. North American games will start at roughly 8pm GMT / 3pm EDT on both Saturday & Sunday. Important Links: Donation Link (Tiltify) Twitch YouTube Twitter Steam Group ",
                "feedlabel": "Community Announcements",
                "date": 1697838593,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 440
            },
            {
                "gid": "5218041989047919896",
                "title": "Seasonalander Fall 2023",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/tf2_blog/5218041989047919896",
                "is_external_url": true,
                "author": "",
                "contents": "<a href=\"https://www.twitch.tv/seasonalander\" target=\"_blank\"> </a> (Image credit: SFM Render - <a href=\"https://steamcommunity.com/id/BishopSFM/\" target=\"_blank\">Bishop</a>, Compositing/Overlays - <a href=\"https://steamcommunity.com/id/MoistHoovy\" target=\"_blank\">Father Hoovy Is Moist</a>, Organization - <a href=\"https://steamcommunity.com/id/IanTheAwsm/\" target=\"_blank\">IanTheAwsm</a>) Seasonalander has arrived for the Fall of 2023! This season will be raising funds for the <a href=\"https://donate.redcross.org.uk/appeal/emergencies-fund\" target=\"_blank\">British Red Cross</a>, a global humanitarian organization whose work includes helping people in the UK and overseas when emergencies happen, preventing or easing human suffering around the world, supporting victims of modern slavery and trafficking, and protecting people in armed conflict. Seasonalander has set an initial goal of £1,000 with funds going directly towards immediate relief like food, support, equipment and shelter. More information on the British Red Cross can be found <a href=\"https://www.redcross.org.uk\" target=\"_blank\">here</a>! Seasonalander is a Highlander-based 9v9 tournament that uses community-created maps based on the current season of the year, which is currently Fall/Autumn! This season will feature over 72 talented creators from across the Team Fortress 2 community in both North America and Europe in hopes of bringing the Team Fortress 2 community together for several various causes! Come see your favorites entertain by throwing hands and raising funds for those in need! Help get the word out and be sure to <a href=\"https://www.twitch.tv/seasonalander\" target=\"_blank\">tune in</a> on the 21st and 22nd of October! European games will start at 3pm GMT / 10am EDT on both Saturday & Sunday. North American games will start at roughly 8pm GMT / 3pm EDT on both Saturday & Sunday. Important Links: * <a href=\" https://tiltify.com/@seasonalander/seasonalander-fall-2023-benefitting-the-british-red-cross\" target=\"_blank\">Donation Link (Tiltify)</a> ;* <a href=\"https://www.twitch.tv/seasonalander\" target=\"_blank\">Twitch</a> ;* <a href=\"https://www.youtube.com/@seasonalander\" target=\"_blank\">YouTube</a> ;* <a href=\"https://twitter.com/seasonalander?lang=en\" target=\"_blank\">Twitter</a> ;* <a href=\"https://steamcommunity.com/groups/SeasonalanderTF2\" target=\"_blank\">Steam Group</a> ",
                "feedlabel": "TF2 Blog",
                "date": 1697838540,
                "feedname": "tf2_blog",
                "feed_type": 0,
                "appid": 440
            },
            {
                "gid": "5218041989046779855",
                "title": "Team Fortress 2 update from Valve polishes up the new TF2 mode",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/PCGamesN/5218041989046779855",
                "is_external_url": true,
                "author": "editor@pcgamesn.com",
                "contents": "Another new <strong>Team Fortress 2</strong> update from Valve has rolled out to improve the newest mode in its squad shooter. As Counter-Strike 2 lights up Steam, TF2 stays strong alongside it in part thanks to the introduction of a mode based on a classic Half-Life 2 mod to the official rotation. Previously only available as a custom game variant, TF2 Zombie Infection is part of the ongoing Scream Fortress 2 Halloween event, and Valve continues to update it with balance changes and bug fixes. <a href=\"https://www.pcgamesn.com/team-fortress-2/update-zombie-infection\">Read the rest of the story...</a> RELATED LINKS: <a href=\"https://www.pcgamesn.com/team-fortress-2/zombie-infection-patch-notes\">Team Fortress 2's new mode gets a big update from Valve</a> <a href=\"https://www.pcgamesn.com/team-fortress-2/new-mode\">Team Fortress 2 just got a new game mode, 16 years after launch</a> <a href=\"https://www.pcgamesn.com/team-fortress-2/battle-royale\">Valve just turned Team Fortress 2 into a battle royale</a> ",
                "feedlabel": "PCGamesN",
                "date": 1697804057,
                "feedname": "PCGamesN",
                "feed_type": 0,
                "appid": 440
            },
            {
                "gid": "5218041989044677692",
                "title": "Team Fortress 2 Update Released",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5218041989044677692",
                "is_external_url": true,
                "author": "erics",
                "contents": "An update to Team Fortress 2 has been released. The update will be applied automatically when you restart Team Fortress 2. The major changes include: Fixed floating 'Bonus' label in the middle of the screen while working on certain contracts Updated the Clown's Cover-Up to fix some clipping issues, fix the LODs, and update the equip_region Updated the Celestial Summit Unusual effect to reduce the particle count Updated the Potion Explosion Unusual taunt effect to remove the delay when starting the effect Updated glowing eye materials on Voodoo-Cursed Souls and Übercharged players with community fixes from Liam Stone (boba) Updated the Carry-Van Fixed the rigging on the straps to avoid clipping when running Fixed misplaced ambient occlusion on the material Fixed rim mask being black in places it wasn't supposed to Fixed a hole in-between the window and top of the van Fixed LODs to represent above changes Updated the Dead Man's Party Unusual taunt effect Added fades to hand sprites Improved effect composition on fast-moving taunts Fixed some particle sorting issues Updated cp_lavapit_final Fixed a skybox exploit in the underworld Updated pl_spineyard Fixed an exploit that allowed players to get outside of the map Fixed missing cubemaps Updated pl_corruption Replaced some of the materials and models Adjusted collisions near some wooden beams by point A Adjusted prop fades Fixed some minor texture issues Fixed teleport trigger in one of the spawn rooms being too late to activate Minor adjustments to improve your sanity Updated cp_degrootkeep_rats Fixed players getting stuck in the door when entering the Rabbit Hole at the same time as an enemy player Fixed a hidden perch in the balcony overlooking C Updated arena_perks Replaced the Cloaking perk with the Patience perk (gain up to 7 health/sec) Fixed missing barricades in the voting area Fixed certain items having missing textures on the map Removed crumpkins (with help from LizardOfOz) Fixed stalemates causing extra rounds where no perks would appear Added a new HUD, with an alive player counter Updated zi_murky, zi_atoll, zi_devastation_final1, zi_woods, and zi_sanitarium If a game is in progress and there are no players on BLU team or RED team the game will now end Fixed a bug that allowed Dead Ringer spies to die without triggering a round loss Fixed a bug that caused Zombies to not see combat text correctly Fixed a bug that caused Rocket Launchers and Sticky Bomb Launchers to start with a low ammo Fixed a bug that caused changing player loadout to kill human players (particularly on Murky) Fixed an issue with missing particle effects for Medic's Heal ability Adjusted the number of Zombies selected at round start for low player counts Corrected unintended changes in the last update Changed the damage dealt by Zombie Soldier's Stomp In the previous update, Soldier would instantly kill his stomp target. This was not intended. The new damage calculation is (10 + fall damage x 3). This is the same as the Mantreads. Changed the Sentry Gun to deal 40% damage to Zombies In the previous update, this was 35%. This was not intended. Added a sound effect to Pyro's explosion of flames on death Removed some debug print statements Reworked Demoman's Blast Charge to fix several exploits and bugs These changes should also make Blast Charge more reliable and less frustrating to use Blast Charge is now triggered based on the player's velocity When player's speed drops below a threshold while charging, they explode Additionally, anything that would usually interrupt a shield charge will now trigger the explosion Fixed a bug that caused ÜberCharge applied by Blast Charge to persist longer than intended Fixed a bug that caused Blast Charge to fail to kill the player in situations where the player should be killed Fixed a bug that caused Blast Charge to briefly display the player's first person view before detonation Fixed a bug that caused the player to be unable to attack, jump or duck after surviving Blast Charge Fixed many bugs that caused Blast Charge to fail to detonate Fixed many bugs related to Blast Charge being cast at the same time as being converted to Zombie Updated zi_atoll (additional changes) Fixed the missing texture on the turbine building's roof Added areaportals and occluders in and around buildings Added extra nodraw brushes under the level and buildings to improve vis calculations Added prop fades on bushes and rocks Adjusted push triggers on trees Minor clipping adjustments Changed func_brush on roofs to func_movelinear so that corpses don't fall through Added soul gargoyle spawns Added a santa hat that spawns on the anchor when smissmas holiday is enabled Fixed cubemap reflection issues Fixed the seam between the 3D skybox and the playable level Aar fed the spinning cat Updated zi_devastation_final1 (additional changes) Replaced sewer exit to the 2nd floor with a ladder Changed sewer exits to no longer require crouching/prop jumps Fixed missing respawn trigger in the sewers Adjusted spawn positions of Zombies and Survivors Fire now ignites players Adjusted lighting in sewers to be slightly brighter Reduced round timer to 3 minutes Lit up 2nd floor car corner ",
                "feedlabel": "Community Announcements",
                "date": 1697762027,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 440,
                "tags": [
                    "patchnotes"
                ]
            },
            {
                "gid": "5218041989044676932",
                "title": "Team Fortress 2 Update Released",
                "url": "https://store.steampowered.com/news/211041/",
                "is_external_url": false,
                "author": "Valve",
                "contents": "An update to Team Fortress 2 has been released. The update will be applied automatically when you restart Team Fortress 2. The major changes include: * Fixed floating 'Bonus' label in the middle of the screen while working on certain contracts; * Updated the Clown's Cover-Up to fix some clipping issues, fix the LODs, and update the equip_region; * Updated the Celestial Summit Unusual effect to reduce the particle count; * Updated the Potion Explosion Unusual taunt effect to remove the delay when starting the effect; * Updated glowing eye materials on Voodoo-Cursed Souls and Übercharged players with community fixes from Liam Stone (boba); * Updated the Carry-Van; * Fixed the rigging on the straps to avoid clipping when running; * Fixed misplaced ambient occlusion on the material; * Fixed rim mask being black in places it wasn't supposed to; * Fixed a hole in-between the window and top of the van; * Fixed LODs to represent above changes; * Updated the Dead Man's Party Unusual taunt effect; * Added fades to hand sprites; * Improved effect composition on fast-moving taunts ;* Fixed some particle sorting issues; * Updated cp_lavapit_final; * Fixed a skybox exploit in the underworld; * Updated pl_spineyard; * Fixed an exploit that allowed players to get outside of the map; * Fixed missing cubemaps; * Updated pl_corruption; * Replaced some of the materials and models; * Adjusted collisions near some wooden beams by point A; * Adjusted prop fades; * Fixed some minor texture issues; * Fixed teleport trigger in one of the spawn rooms being too late to activate; * Minor adjustments to improve your sanity; * Updated cp_degrootkeep_rats; * Fixed players getting stuck in the door when entering the Rabbit Hole at the same time as an enemy player; * Fixed a hidden perch in the balcony overlooking C; * Updated arena_perks; * Replaced the Cloaking perk with the Patience perk (gain up to 7 health/sec); * Fixed missing barricades in the voting area; * Fixed certain items having missing textures on the map; * Removed crumpkins (with help from LizardOfOz); * Fixed stalemates causing extra rounds where no perks would appear; * Added a new HUD, with an alive player counter; * Updated zi_murky, zi_atoll, zi_devastation_final1, zi_woods, and zi_sanitarium; * If a game is in progress and there are no players on BLU team or RED team the game will now end; * Fixed a bug that allowed Dead Ringer spies to die without triggering a round loss; * Fixed a bug that caused Zombies to not see combat text correctly; * Fixed a bug that caused Rocket Launchers and Sticky Bomb Launchers to start with a low ammo; * Fixed a bug that caused changing player loadout to kill human players (particularly on Murky); * Fixed an issue with missing particle effects for Medic's Heal ability; * Adjusted the number of Zombies selected at round start for low player counts; * Corrected unintended changes in the last update; * Changed the damage dealt by Zombie Soldier's Stomp; * In the previous update, Soldier would instantly kill his stomp target. This was not intended. * The new damage calculation is (10 + fall damage x 3). This is the same as the Mantreads. * Changed the Sentry Gun to deal 40% damage to Zombies; * In the previous update, this was 35%. This was not intended. * Added a sound effect to Pyro's explosion of flames on death ;* Removed some debug print statements; * Reworked Demoman's Blast Charge to fix several exploits and bugs; * These changes should also make Blast Charge more reliable and less frustrating to use; * Blast Charge is now triggered based on the player's velocity; * When player's speed drops below a threshold while charging, they explode ;* Additionally, anything that would usually interrupt a shield charge will now trigger the explosion; * Fixed a bug that caused ÜberCharge applied by Blast Charge to persist longer than intended ;* Fixed a bug that caused Blast Charge to fail to kill the player in situations where the player should be killed ;* Fixed a bug that caused Blast Charge to briefly display the player's first person view before detonation ;* Fixed a bug that caused the player to be unable to attack, jump or duck after surviving Blast Charge; * Fixed many bugs that caused Blast Charge to fail to detonate; * Fixed many bugs related to Blast Charge being cast at the same time as being converted to Zombie; * Updated zi_atoll (additional changes); * Fixed the missing texture on the turbine building's roof; * Added areaportals and occluders in and around buildings; * Added extra nodraw brushes under the level and buildings to improve vis calculations; * Added prop fades on bushes and rocks; * Adjusted push triggers on trees; * Minor clipping adjustments; * Changed func_brush on roofs to func_movelinear so that corpses don't fall through; * Added soul gargoyle spawns; * Added a santa hat that spawns on the anchor when smissmas holiday is enabled; * Fixed cubemap reflection issues; * Fixed the seam between the 3D skybox and the playable level; * Aar fed the spinning cat; * Updated zi_devastation_final1 (additional changes); * Replaced sewer exit to the 2nd floor with a ladder; * Changed sewer exits to no longer require crouching/prop jumps; * Fixed missing respawn trigger in the sewers; * Adjusted spawn positions of Zombies and Survivors; * Fire now ignites players; * Adjusted lighting in sewers to be slightly brighter; * Reduced round timer to 3 minutes; * Lit up 2nd floor car corner; ",
                "feedlabel": "Product Update",
                "date": 1697761860,
                "feedname": "steam_updates",
                "feed_type": 0,
                "appid": 440
            },
            {
                "gid": "5218041989044697715",
                "title": "Team Fortress 2 Update Released",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/tf2_blog/5218041989044697715",
                "is_external_url": true,
                "author": "",
                "contents": "An update to Team Fortress 2 has been released. The update will be applied automatically when you restart Team Fortress 2. The major changes include: * Fixed floating 'Bonus' label in the middle of the screen while working on certain contracts ;* Updated the Clown's Cover-Up to fix some clipping issues, fix the LODs, and update the equip_region ;* Updated the Celestial Summit Unusual effect to reduce the particle count ;* Updated the Potion Explosion Unusual taunt effect to remove the delay when starting the effect ;* Updated glowing eye materials on Voodoo-Cursed Souls and Übercharged players with community fixes from Liam Stone (boba) ;* Updated the Carry-Van; * Fixed the rigging on the straps to avoid clipping when running ;* Fixed misplaced ambient occlusion on the material ;* Fixed rim mask being black in places it wasn't supposed to ;* Fixed a hole in-between the window and top of the van ;* Fixed LODs to represent above changes; * Updated the Dead Man's Party Unusual taunt effect; * Added fades to hand sprites ;* Improved effect composition on fast-moving taunts ;* Fixed some particle sorting issues; * Updated cp_lavapit_final; * Fixed a skybox exploit in the underworld; * Updated pl_spineyard; * Fixed an exploit that allowed players to get outside of the map ;* Fixed missing cubemaps; * Updated pl_corruption; * Replaced some of the materials and models ;* Adjusted collisions near some wooden beams by point A ;* Adjusted prop fades ;* Fixed some minor texture issues ;* Fixed teleport trigger in one of the spawn rooms being too late to activate ;* Minor adjustments to improve your sanity; * Updated cp_degrootkeep_rats; * Fixed players getting stuck in the door when entering the Rabbit Hole at the same time as an enemy player ;* Fixed a hidden perch in the balcony overlooking C; * Updated arena_perks; * Replaced the Cloaking perk with the Patience perk (gain up to 7 health/sec) ;* Fixed missing barricades in the voting area ;* Fixed certain items having missing textures on the map ;* Removed crumpkins (with help from LizardOfOz) ;* Fixed stalemates causing extra rounds where no perks would appear ;* Added a new HUD, with an alive player counter; * Updated zi_murky, zi_atoll, zi_devastation_final1, zi_woods, and zi_sanitarium; * If a game is in progress and there are no players on BLU team or RED team the game will now end ;* Fixed a bug that allowed Dead Ringer spies to die without triggering a round loss ;* Fixed a bug that caused Zombies to not see combat text correctly ;* Fixed a bug that caused Rocket Launchers and Sticky Bomb Launchers to start with a low ammo ;* Fixed a bug that caused changing player loadout to kill human players (particularly on Murky) ;* Fixed an issue with missing particle effects for Medic's Heal ability ;* Adjusted the number of Zombies selected at round start for low player counts ;* Corrected unintended changes in the last update; * Changed the damage dealt by Zombie Soldier's Stomp; * In the previous update, Soldier would instantly kill his stomp target. This was not intended. ;* The new damage calculation is (10 + fall damage x 3). This is the same as the Mantreads. * Changed the Sentry Gun to deal 40% damage to Zombies; * In the previous update, this was 35%. This was not intended. * Added a sound effect to Pyro's explosion of flames on death ;* Removed some debug print statements; * Reworked Demoman's Blast Charge to fix several exploits and bugs; * These changes should also make Blast Charge more reliable and less frustrating to use; * Blast Charge is now triggered based on the player's velocity; * When player's speed drops below a threshold while charging, they explode ;* Additionally, anything that would usually interrupt a shield charge will now trigger the explosion; * Fixed a bug that caused ÜberCharge applied by Blast Charge to persist longer than intended ;* Fixed a bug that caused Blast Charge to fail to kill the player in situations where the player should be killed ;* Fixed a bug that caused Blast Charge to briefly display the player's first person view before detonation ;* Fixed a bug that caused the player to be unable to attack, jump or duck after surviving Blast Charge ;* Fixed many bugs that caused Blast Charge to fail to detonate ;* Fixed many bugs related to Blast Charge being cast at the same time as being converted to Zombie; * Updated zi_atoll (additional changes); * Fixed the missing texture on the turbine building's roof ;* Added areaportals and occluders in and around buildings ;* Added extra nodraw brushes under the level and buildings to improve vis calculations ;* Added prop fades on bushes and rocks ;* Adjusted push triggers on trees ;* Minor clipping adjustments ;* Changed func_brush on roofs to func_movelinear so that corpses don't fall through ;* Added soul gargoyle spawns ;* Added a santa hat that spawns on the anchor when smissmas holiday is enabled ;* Fixed cubemap reflection issues ;* Fixed the seam between the 3D skybox and the playable level ;* Aar fed the spinning cat; * Updated zi_devastation_final1 (additional changes); * Replaced sewer exit to the 2nd floor with a ladder ;* Changed sewer exits to no longer require crouching/prop jumps ;* Fixed missing respawn trigger in the sewers ;* Adjusted spawn positions of Zombies and Survivors ;* Fire now ignites players ;* Adjusted lighting in sewers to be slightly brighter ;* Reduced round timer to 3 minutes ;* Lit up 2nd floor car corner; ",
                "feedlabel": "TF2 Blog",
                "date": 1697761860,
                "feedname": "tf2_blog",
                "feed_type": 0,
                "appid": 440
            },
            {
                "gid": "6438516944127990645",
                "title": "Team Fortress 2's new mode gets a big update from Valve",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/PCGamesN/6438516944127990645",
                "is_external_url": true,
                "author": "editor@pcgamesn.com",
                "contents": "<strong>Team Fortress 2</strong> is celebrating Halloween season, and the beloved class-based FPS game's own 16th anniversary, with the launch of a new official mode based on a popular custom game variant and an old Half-Life 2 mod. Just a few days after its introduction, alongside its work on the newly launched Counter-Strike 2, Valve is already busy with balance changes, releasing the first TF2 Zombie Infection patch notes with big buffs to almost every zombie class and nerfs to the human Engineer and Demoman. <a href=\"https://www.pcgamesn.com/team-fortress-2/zombie-infection-patch-notes\">Read the rest of the story...</a> RELATED LINKS: <a href=\"https://www.pcgamesn.com/team-fortress-2/new-mode\">Team Fortress 2 just got a new game mode, 16 years after launch</a> <a href=\"https://www.pcgamesn.com/team-fortress-2/battle-royale\">Valve just turned Team Fortress 2 into a battle royale</a> <a href=\"https://www.pcgamesn.com/team-fortress-2/twitch\">Team Fortress 2's new update sees it beat out Overwatch 2 on Twitch</a> ",
                "feedlabel": "PCGamesN",
                "date": 1697287004,
                "feedname": "PCGamesN",
                "feed_type": 0,
                "appid": 440
            },
            {
                "gid": "6438516944125665676",
                "title": "Team Fortress 2 Update Released",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/6438516944125665676",
                "is_external_url": true,
                "author": "erics",
                "contents": "An update to Team Fortress 2 has been released. The update will be applied automatically when you restart Team Fortress 2. The major changes include: Fixed the Clown's Cover-Up always showing the Red team skin Fixed hiding the Pyro's head when using the Friendly style for the Fiercesome Fluorescence Fixed the Grounded style of the Power Spike using an incorrect LOD model Fixed Celestial Summit and Stellar Ascent Unusual effects not following moving players Fixed missing prefix when the Strange Filter: Sandcastle (Community) item is applied to a weapon Fixed missing prefix when the Strange Filter: Lava Pit (Community) item is applied to a weapon Updated The Masked Fiend to fix a problem with the materials Updated the Dell Dynamic to fix issues with the materials, rigging, and LODs Updated the Sapped Unusual effect to fix visibility issues in bright environments Updated Blastphomet cosmetic to fix some a problem with the materials and some minor clipping Updated the Taunt: Borrowed Bones to add missing sounds Updated Taunt: Neck Snap animations to fix the MVM canteen flipping while taunting Updated the Nightmarish Storm, Acidic Climate, and Otherworldly Weather Unusual effects to fix a problem with the lock rotation Updated the Eldritch Horror and Deep-sea Devourer Unusual taunt effects to fix a problem with flickering Updated pd_farmageddon Updated .res file to work with custom huds (Thanks Aar) Updated cp_lavapit_final Updated the Underworld Spells now spawn one per point, in a random location Removed some exploits Updated pl_spineyard Replaced some of the materials and models Fixed a missing material Significantly improved skeleton navigation Reduced the health of skeletons to 130 HP Increased the weapon spread of skeletons to reduce their long range damage Increased the number of pumpkin bomb spawns Improved sound effects Various detail fixes Fixed being able to build in the first Blue spawn Updated pd_mannsylvania Added new custom voice lines of Merasmus Gargoyle Notifications Better player clip and fixed players stuck in some areas Placed more bat's models on entire map and randomised their animations Improved 3d skybox Disabled trigger_hurt in ending sequence after 15 second when game ends Minor cosmetic fixes Updated zi_murky, zi_atoll, zi_devastation_final1, zi_woods, and zi_sanitarium These changes are aimed to make playing as a Zombie more engaging, and to weaken the Human meta of bunkering without hurting their ability to roam and fight Zombie Spy is now passively cloaked, only losing his cloak for 3 seconds when attacking or using his \"Reveal\" ability This change will allow Zombie Spy to circumvent sentry guns that are watching large areas, and allow him to sneak into or around strongholds Zombie Soldier's \"Pounce\" ability is now significantly higher, and has a 5 second cooldown (from 8) These changes will bolster Zombie Soldier's role as a recon pick and a roof buster, capable of launching through sentry fire Zombie Sniper's \"Spit\" ability now damages buildables Zombie Sniper now drops a puddle of spit on death Both of these changes will make you feel like you're contributing more with your spit, and if that's not enough, you at least get to drop one on death to cause a small area of denial Zombie Pyro no longer drops small health kits Zombie Pyro's \"Hellspawn\" passive now releases a flaming explosion on death on top of the existing gas passer cloud These changes should strengthen their afterburn capability, and make them a scarier threat if you let them too close Zombie Heavy's \"Tank\" ability now adds the Battalion's Backup buff (immunity to critical hits, 35% resistance to regular damage, and a 50% resistance to Sentry Gun damage) Zombie Heavy deals 20% increased melee damage Sentry and crit resistance will bring Zombie Heavy's effective hp up much higher, buffing his role as a tank that you really oughta stay away from. His slower speed is unchanged, so you're still able to run. The changes will just make bunkering much more difficult with him around. Zombie Engineer's EMP no longer rolls on shallow surfaces, and now does 110 damage instead of fractional damage This change will turn EMP grenades into a much more immediate threat, instantly breaking mini sentries, crippling level 1 sentries, and wounding other buildings Zombie Scout's \"Speed Demon\" passive now comes and additional 25% jump height boost Zombie Scout already has a triple jump, but increasing jump height will make him even more of a pest buzzing around your head, and better at climbing onto roofs once a hold is destroyed 1/5 of the server will be converted to zombies at the end of setup (from 1/6), and will also round up It's become clear that there simply aren't enough zombies selected at the start of the round. Initial pushes should be easier to perform with a couple more units. Sentry Guns deal 40% damage to zombies (from 60%) Engineers are simply way too oppressive. The dispenser is invaluable for the sake of ammo, and the sentry still has use as a knockback tool, but now should be significantly less frustrating to play against. Demoman shield items no longer halve the damage taken by zombies He was just too strong and incredibly unfun to duel. The extended reach of swords is already amazing against melee-only characters. His strong maneuverability is unchanged. Zombie Medic Heal cooldown reduced to 7 seconds (previously 11) All Zombies except for scout, heavy, and spy, now have +25 HP (from +10) Fixed a bug where Zombie Demo could detonate himself before the charge had started Fixed a bug where Bonk! Atomic Punch could persist through Zombie conversion Fixed various issues caused by Zombie Demo surviving his own charge Fixed issues with the Zombie HUD not correctly displaying certain strings Fixed exploit related to adding additional time Added additional HIDEHUD bits to remove irrelevant HUD elements when playing Zombie Added an instructional video (Thanks Funicular!) Updated zi_murky (additional changes) All of the roofs have been covered in clutter such as vines and tires, and are no longer buildable Added more trees for cover Added small fence to RED spawn to make it easier for zombies to approach up the wooden stairs Added a ramp leading to the yellow shack's roof Added occluders to central shack Improved fog Improved skybox Improved readability of chicken wire fences, and added more around the docks Adjusted prop fades Tweaked detailing Fixed erroneous clip brushes Fixed several stuck spots Fixed missing television model Updated zi_atoll (additional changes) Added an extension to the roof of the turbine building Added nobuild entities to debris that could potentially hide sneaky sentries Added a broken window on the turbine building Clipped the spiral stairs behind the lighthouse (thanks Aar!) Reduced performance impact of water Increased size of trigger_push entities on the tree tops Improved collision on the displacement on the beach near the fishing house The spinning cat has been fed Updated zi_devastation_final1 (additional changes) Added new route from second level zombie spawn to the top floor Adjusted some zombie spawns Made some zombie spawn exits easier to leave Clipped off bottom floor stairs Increased Round Timer to 3 minutes and 30 Seconds Increased Reports of Gators Updated zi_sanitarium (additional changes) Replaced some of the materials and models Fixed a missing material on a prop Fixed a pixel walk in the skybox ",
                "feedlabel": "Community Announcements",
                "date": 1697238538,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 440,
                "tags": [
                    "patchnotes",
                    "mod_reviewed",
                    "ModAct_1426387032_1697239638_0",
                    "ModAct_487997664_1697485737_4",
                    "mod_require_rereview"
                ]
            },
            {
                "gid": "6438516944125664178",
                "title": "Team Fortress 2 Update Released",
                "url": "https://store.steampowered.com/news/210711/",
                "is_external_url": false,
                "author": "Valve",
                "contents": "An update to Team Fortress 2 has been released. The update will be applied automatically when you restart Team Fortress 2. The major changes include: * Fixed the Clown's Cover-Up always showing the Red team skin; * Fixed hiding the Pyro's head when using the Friendly style for the Fiercesome Fluorescence; * Fixed the Grounded style of the Power Spike using an incorrect LOD model; * Fixed Celestial Summit and Stellar Ascent Unusual effects not following moving players; * Fixed missing prefix when the Strange Filter: Sandcastle (Community) item is applied to a weapon; * Fixed missing prefix when the Strange Filter: Lava Pit (Community) item is applied to a weapon; * Updated The Masked Fiend to fix a problem with the materials; * Updated the Dell Dynamic to fix issues with the materials, rigging, and LODs; * Updated the Sapped Unusual effect to fix visibility issues in bright environments; * Updated Blastphomet cosmetic to fix some a problem with the materials and some minor clipping; * Updated the Taunt: Borrowed Bones to add missing sounds; * Updated Taunt: Neck Snap animations to fix the MVM canteen flipping while taunting; * Updated the Nightmarish Storm, Acidic Climate, and Otherworldly Weather Unusual effects to fix a problem with the lock rotation; * Updated the Eldritch Horror and Deep-sea Devourer Unusual taunt effects to fix a problem with flickering; * Updated pd_farmageddon; * Updated .res file to work with custom huds (Thanks Aar); * Updated cp_lavapit_final; * Updated the Underworld; * Spells now spawn one per point, in a random location; * Removed some exploits; * Updated pl_spineyard; * Replaced some of the materials and models; * Fixed a missing material; * Significantly improved skeleton navigation; * Reduced the health of skeletons to 130 HP; * Increased the weapon spread of skeletons to reduce their long range damage; * Increased the number of pumpkin bomb spawns; * Improved sound effects; * Various detail fixes; * Fixed being able to build in the first Blue spawn; * Updated pd_mannsylvania; * Added new custom voice lines of Merasmus Gargoyle Notifications; * Better player clip and fixed players stuck in some areas; * Placed more bat's models on entire map and randomised their animations; * Improved 3d skybox; * Disabled trigger_hurt in ending sequence after 15 second when game ends; * Minor cosmetic fixes; * Updated zi_murky, zi_atoll, zi_devastation_final1, zi_woods, and zi_sanitarium; * These changes are aimed to make playing as a Zombie more engaging, and to weaken the Human meta of bunkering without hurting their ability to roam and fight; * Zombie Spy is now passively cloaked, only losing his cloak for 3 seconds when attacking or using his \"Reveal\" ability; * This change will allow Zombie Spy to circumvent sentry guns that are watching large areas, and allow him to sneak into or around strongholds; * Zombie Soldier's \"Pounce\" ability is now significantly higher, and has a 5 second cooldown (from 8); * These changes will bolster Zombie Soldier's role as a recon pick and a roof buster, capable of launching through sentry fire; * Zombie Sniper's \"Spit\" ability now damages buildables; * Zombie Sniper now drops a puddle of spit on death; * Both of these changes will make you feel like you're contributing more with your spit, and if that's not enough, you at least get to drop one on death to cause a small area of denial; * Zombie Pyro no longer drops small health kits; * Zombie Pyro's \"Hellspawn\" passive now releases a flaming explosion on death on top of the existing gas passer cloud; * These changes should strengthen their afterburn capability, and make them a scarier threat if you let them too close; * Zombie Heavy's \"Tank\" ability now adds the Battalion's Backup buff (immunity to critical hits, 35% resistance to regular damage, and a 50% resistance to Sentry Gun damage); * Zombie Heavy deals 20% increased melee damage; * Sentry and crit resistance will bring Zombie Heavy's effective hp up much higher, buffing his role as a tank that you really oughta stay away from. His slower speed is unchanged, so you're still able to run. The changes will just make bunkering much more difficult with him around. * Zombie Engineer's EMP no longer rolls on shallow surfaces, and now does 110 damage instead of fractional damage; * This change will turn EMP grenades into a much more immediate threat, instantly breaking mini sentries, crippling level 1 sentries, and wounding other buildings; * Zombie Scout's \"Speed Demon\" passive now comes and additional 25% jump height boost; * Zombie Scout already has a triple jump, but increasing jump height will make him even more of a pest buzzing around your head, and better at climbing onto roofs once a hold is destroyed; * 1/5 of the server will be converted to zombies at the end of setup (from 1/6), and will also round up; * It's become clear that there simply aren't enough zombies selected at the start of the round. Initial pushes should be easier to perform with a couple more units. * Sentry Guns deal 40% damage to zombies (from 60%); * Engineers are simply way too oppressive. The dispenser is invaluable for the sake of ammo, and the sentry still has use as a knockback tool, but now should be significantly less frustrating to play against. * Demoman shield items no longer halve the damage taken by zombies; * He was just too strong and incredibly unfun to duel. The extended reach of swords is already amazing against melee-only characters. His strong maneuverability is unchanged. * Zombie Medic Heal cooldown reduced to 7 seconds (previously 11); * All Zombies except for scout, heavy, and spy, now have +25 HP (from +10); * Fixed a bug where Zombie Demo could detonate himself before the charge had started; * Fixed a bug where Bonk! Atomic Punch could persist through Zombie conversion; * Fixed various issues caused by Zombie Demo surviving his own charge; * Fixed issues with the Zombie HUD not correctly displaying certain strings; * Fixed exploit related to adding additional time; * Added additional HIDEHUD bits to remove irrelevant HUD elements when playing Zombie; * Added an instructional video (Thanks Funicular!); * Updated zi_murky (additional changes); * All of the roofs have been covered in clutter such as vines and tires, and are no longer buildable; * Added more trees for cover; * Added small fence to RED spawn to make it easier for zombies to approach up the wooden stairs; * Added a ramp leading to the yellow shack's roof; * Added occluders to central shack; * Improved fog; * Improved skybox; * Improved readability of chicken wire fences, and added more around the docks; * Adjusted prop fades; * Tweaked detailing; * Fixed erroneous clip brushes; * Fixed several stuck spots; * Fixed missing television model; * Updated zi_atoll (additional changes); * Added an extension to the roof of the turbine building; * Added nobuild entities to debris that could potentially hide sneaky sentries; * Added a broken window on the turbine building; * Clipped the spiral stairs behind the lighthouse (thanks Aar!); * Reduced performance impact of water; * Increased size of trigger_push entities on the tree tops; * Improved collision on the displacement on the beach near the fishing house; * The spinning cat has been fed; * Updated zi_devastation_final1 (additional changes); * Added new route from second level zombie spawn to the top floor; * Adjusted some zombie spawns; * Made some zombie spawn exits easier to leave; * Clipped off bottom floor stairs; * Increased Round Timer to 3 minutes and 30 Seconds; * Increased Reports of Gators; * Updated zi_sanitarium (additional changes); * Replaced some of the materials and models; * Fixed a missing material on a prop; * Fixed a pixel walk in the skybox; ",
                "feedlabel": "Product Update",
                "date": 1697238420,
                "feedname": "steam_updates",
                "feed_type": 0,
                "appid": 440
            },
            {
                "gid": "6438516944125695978",
                "title": "Team Fortress 2 Update Released",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/tf2_blog/6438516944125695978",
                "is_external_url": true,
                "author": "",
                "contents": "An update to Team Fortress 2 has been released. The update will be applied automatically when you restart Team Fortress 2. The major changes include: * Fixed the Clown's Cover-Up always showing the Red team skin ;* Fixed hiding the Pyro's head when using the Friendly style for the Fiercesome Fluorescence ;* Fixed the Grounded style of the Power Spike using an incorrect LOD model ;* Fixed Celestial Summit and Stellar Ascent Unusual effects not following moving players ;* Fixed missing prefix when the Strange Filter: Sandcastle (Community) item is applied to a weapon ;* Fixed missing prefix when the Strange Filter: Lava Pit (Community) item is applied to a weapon ;* Updated The Masked Fiend to fix a problem with the materials ;* Updated the Dell Dynamic to fix issues with the materials, rigging, and LODs ;* Updated the Sapped Unusual effect to fix visibility issues in bright environments ;* Updated Blastphomet cosmetic to fix some a problem with the materials and some minor clipping ;* Updated the Taunt: Borrowed Bones to add missing sounds ;* Updated Taunt: Neck Snap animations to fix the MVM canteen flipping while taunting ;* Updated the Nightmarish Storm, Acidic Climate, and Otherworldly Weather Unusual effects to fix a problem with the lock rotation ;* Updated the Eldritch Horror and Deep-sea Devourer Unusual taunt effects to fix a problem with flickering ;* Updated pd_farmageddon; * Updated .res file to work with custom huds (Thanks Aar); * Updated cp_lavapit_final; * Updated the Underworld ;* Spells now spawn one per point, in a random location ;* Removed some exploits; * Updated pl_spineyard; * Replaced some of the materials and models ;* Fixed a missing material ;* Significantly improved skeleton navigation ;* Reduced the health of skeletons to 130 HP ;* Increased the weapon spread of skeletons to reduce their long range damage ;* Increased the number of pumpkin bomb spawns ;* Improved sound effects ;* Various detail fixes ;* Fixed being able to build in the first Blue spawn; * Updated pd_mannsylvania; * Added new custom voice lines of Merasmus Gargoyle Notifications ;* Better player clip and fixed players stuck in some areas ;* Placed more bat's models on entire map and randomised their animations ;* Improved 3d skybox ;* Disabled trigger_hurt in ending sequence after 15 second when game ends ;* Minor cosmetic fixes; * Updated zi_murky, zi_atoll, zi_devastation_final1, zi_woods, and zi_sanitarium; * These changes are aimed to make playing as a Zombie more engaging, and to weaken the Human meta of bunkering without hurting their ability to roam and fight; * Zombie Spy is now passively cloaked, only losing his cloak for 3 seconds when attacking or using his \"Reveal\" ability; * This change will allow Zombie Spy to circumvent sentry guns that are watching large areas, and allow him to sneak into or around strongholds; * Zombie Soldier's \"Pounce\" ability is now significantly higher, and has a 5 second cooldown (from 8); * These changes will bolster Zombie Soldier's role as a recon pick and a roof buster, capable of launching through sentry fire; * Zombie Sniper's \"Spit\" ability now damages buildables ;* Zombie Sniper now drops a puddle of spit on death; * Both of these changes will make you feel like you're contributing more with your spit, and if that's not enough, you at least get to drop one on death to cause a small area of denial; * Zombie Pyro no longer drops small health kits ;* Zombie Pyro's \"Hellspawn\" passive now releases a flaming explosion on death on top of the existing gas passer cloud; * These changes should strengthen their afterburn capability, and make them a scarier threat if you let them too close; * Zombie Heavy's \"Tank\" ability now adds the Battalion's Backup buff (immunity to critical hits, 35% resistance to regular damage, and a 50% resistance to Sentry Gun damage) ;* Zombie Heavy deals 20% increased melee damage; * Sentry and crit resistance will bring Zombie Heavy's effective hp up much higher, buffing his role as a tank that you really oughta stay away from. His slower speed is unchanged, so you're still able to run. The changes will just make bunkering much more difficult with him around. * Zombie Engineer's EMP no longer rolls on shallow surfaces, and now does 110 damage instead of fractional damage; * This change will turn EMP grenades into a much more immediate threat, instantly breaking mini sentries, crippling level 1 sentries, and wounding other buildings; * Zombie Scout's \"Speed Demon\" passive now comes and additional 25% jump height boost; * Zombie Scout already has a triple jump, but increasing jump height will make him even more of a pest buzzing around your head, and better at climbing onto roofs once a hold is destroyed; * 1/5 of the server will be converted to zombies at the end of setup (from 1/6), and will also round up; * It's become clear that there simply aren't enough zombies selected at the start of the round. Initial pushes should be easier to perform with a couple more units. * Sentry Guns deal 40% damage to zombies (from 60%); * Engineers are simply way too oppressive. The dispenser is invaluable for the sake of ammo, and the sentry still has use as a knockback tool, but now should be significantly less frustrating to play against. * Demoman shield items no longer halve the damage taken by zombies; * He was just too strong and incredibly unfun to duel. The extended reach of swords is already amazing against melee-only characters. His strong maneuverability is unchanged. * Zombie Medic Heal cooldown reduced to 7 seconds (previously 11) ;* All Zombies except for scout, heavy, and spy, now have +25 HP (from +10); * Fixed a bug where Zombie Demo could detonate himself before the charge had started ;* Fixed a bug where Bonk! Atomic Punch could persist through Zombie conversion ;* Fixed various issues caused by Zombie Demo surviving his own charge ;* Fixed issues with the Zombie HUD not correctly displaying certain strings ;* Fixed exploit related to adding additional time ;* Added additional HIDEHUD bits to remove irrelevant HUD elements when playing Zombie ;* Added an instructional video (Thanks Funicular!); * Updated zi_murky (additional changes); * All of the roofs have been covered in clutter such as vines and tires, and are no longer buildable ;* Added more trees for cover ;* Added small fence to RED spawn to make it easier for zombies to approach up the wooden stairs ;* Added a ramp leading to the yellow shack's roof ;* Added occluders to central shack ;* Improved fog ;* Improved skybox ;* Improved readability of chicken wire fences, and added more around the docks ;* Adjusted prop fades ;* Tweaked detailing ;* Fixed erroneous clip brushes ;* Fixed several stuck spots ;* Fixed missing television model; * Updated zi_atoll (additional changes); * Added an extension to the roof of the turbine building ;* Added nobuild entities to debris that could potentially hide sneaky sentries ;* Added a broken window on the turbine building ;* Clipped the spiral stairs behind the lighthouse (thanks Aar!) ;* Reduced performance impact of water ;* Increased size of trigger_push entities on the tree tops ;* Improved collision on the displacement on the beach near the fishing house ;* The spinning cat has been fed; * Updated zi_devastation_final1 (additional changes); * Added new route from second level zombie spawn to the top floor ;* Adjusted some zombie spawns ;* Made some zombie spawn exits easier to leave ;* Clipped off bottom floor stairs ;* Increased Round Timer to 3 minutes and 30 Seconds ;* Increased Reports of Gators; * Updated zi_sanitarium (additional changes); * Replaced some of the materials and models ;* Fixed a missing material on a prop ;* Fixed a pixel walk in the skybox; ",
                "feedlabel": "TF2 Blog",
                "date": 1697238420,
                "feedname": "tf2_blog",
                "feed_type": 0,
                "appid": 440
            }
        ],
        "count": 3454
    }
}