{
    "appnews": {
        "appid": 1599340,
        "newsitems": [
            {
                "gid": "5480373588801335947",
                "title": "Mokoko Kindergarten Ark Pass",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5480373588801335947",
                "is_external_url": true,
                "author": "HardcoreHenry",
                "contents": "Heroes of Arkesia, The newest Ark Pass arrives on September 20 and adds new ways for players to earn impactful rewards just by playing Lost Ark. Players can complete missions to progress through 30 Ark Pass levels, and with each level reached, new rewards will be unlocked and earned. The regular Ark Pass is completely free and grants a variety of helpful rewards, such as Pheons, honing material selection chests, pirate coins, and even a Legendary Card Pack! Ark Pass progress is earned across your entire roster, and the rewards are roster bound. While all players will have access to the free Ark Pass, those interested in more rewards and cosmetics can exchange Royal Crystals for two premium reward tracks (Premium & Super Premium) which each layer in additional rewards to the leveling track. The Premium Ark Pass adds rewards at all 30 levels earned alongside the free rewards. Examples include more honing material selection chests, battle items, rapport chests, and more! On top of the Regular & Premium rewards, the Super Premium Ark Pass weaves the Mokoko Kindergarten cosmetic collection, Pheons, and a Legendary Card Pack through the Ark Pass. ",
                "feedlabel": "Community Announcements",
                "date": 1695141514,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 1599340
            },
            {
                "gid": "5211283418278159537",
                "title": "Jump-Start Log-in Rewards",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5211283418278159537",
                "is_external_url": true,
                "author": "HardcoreHenry",
                "contents": "https://images.ctfassets.net/umhrp0op95v1/S6BJEfpViKePsxPCYvBfz/b657ea9d2d2d83ca08152c16185c3a45/LA_JumpStart_Gift_1920x1080_CT-002631.jpg Heroes of Arkesia, In addition to the many events and methods for supporting new and returning players in the Jump-Start Servers, we’re excited to announce that players on Jump-Start servers will receive a special log-in gift! Jump-Start Welcome Package I 2023 Summertime Mokoko Skin Chest x1 Bunny Skin Selection Chest x1 Mokoko Pet Selection Chest x1 Mokoko Hammer Selection Chest x1 Mount: Mokoboard Selection Chest x1 Jump-Start Welcome Package II Pheons x100 Legendary - Epic Card Pack II x10 Phoenix Plumes x100 Collective Battle Item Chest x10 Regulus’ Light Chest x10 Reskin Ticket x1 Reminder - Jump-Start Founder Packs Players who purchased the Founder's Pack originally at launch will find a Jump-Start version in their Product Inventory. Players will be able to see the Jump-Start Founder's Pack in their Product Inventory in all regions but each pack is only claimable once. If a player has characters on multiple regions, whatever region they first claim the Jump-Start Founders Pack in will be bound to the region/roster it is claimed in. After that, they will no longer see the Jump-Start Founder's Pack in their Product Inventory if they log into characters on other regions. All original purchasers will see this pack in their Product Inventory, but they can only be claimed on Jump-Start Servers. The Jump-Start Founder's Packs will be the same as the original Founder's Packs, with two exceptions; 1) they will not include Royal Crystals, 2) the packs and the items within the packs will be roster-bound. Special Arktoberfest Hot Time Event https://images.ctfassets.net/umhrp0op95v1/3dRKlqgd80s0jS8hxbkFoY/9fb6f70536154c998105f80370393d7b/Mokoko_desktop_1080.jpg Players on Jump-Start servers will have access to both the standard Arktoberfest Daily Hot-time rewards on 9/16, 9/17, 9/23, and 9/24, and a special cumulative log-in Hot-time event running from 9/13 - 9/19 and again from 9/20 - 9/26. This event will reward players for logging in once, twice, or three times during those event periods, giving a variety of valuable items, including special festival food, honing materials, and more! The two special festival foods give powerful combat bonuses: Festival Sausage - Strength, Dexterity, Intelligence +3000, Combat Resource Natural Recovery + 24%, Atk Speed + 2% Festival Pretzel - Strength, Dexterity, Intelligence +6000, Crit Rate + 1% Log-in Rewards Along with the standard log-in reward track, there’s a Jump-Start exclusive log-in reward track packed with honing materials, battle items, amulets, and more! With many of the rewards containing selection chests, players will be able to pick the rewards best suited for them. For the full list of events, checkout the Jump-Start Server Details Article, or hop in-game to experience them live. We’ll see you in Arkesia! ",
                "feedlabel": "Community Announcements",
                "date": 1694622233,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 1599340
            },
            {
                "gid": "5211283418278132963",
                "title": "SEPTEMBER TWITCH ROUNDUP",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5211283418278132963",
                "is_external_url": true,
                "author": "HardcoreHenry",
                "contents": "https://images.ctfassets.net/umhrp0op95v1/5Adj1XnWNiSjBbKEJ4CrtX/09370ca9b281440c93c6add2e84f748d/LA_JumpstartServerDrop_TwitchDrop_1920x1080_CT-002562.jpg Heroes of Arkesia, With Jump-Start Servers built to launch players right into Lost Ark’s endgame, we have some exciting plans for Twitch. New and returning Lost Ark content creators from around the globe like Zackrawrr, Towelliee, Wudijo, Dhalucard, Tonton and more will join current experts to teach you how to jump right into the best Lost Ark has to offer. Make sure to head over to Twitch and checkout the action, all while earning a special rewards in a new Twitch Drop. A tiered Twitch Drop with valuable items and a cute pet accompanies the September “Jump to the Endgame” Update, available for members of the Lost Ark Creator Program to enable on their channel. The first tier contains a 2023 Arktoberfest Beer Headwear Selection Chest at two hours of watch time. The second tier contains a Petit Saydon Pet Chest and 1,000x Amethyst Shards at four hours of watch time! Make sure to head over to Twitch and watch your favorite Lost Ark content creators to earn the drops before they end on October 10. Full instructions on account linking and claiming can be found on our Twitch Drops page.",
                "feedlabel": "Community Announcements",
                "date": 1694621599,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 1599340
            },
            {
                "gid": "5211283418277743259",
                "title": "Lost Ark patch notes add dinosaur battle royale and skin rerolling",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/PCGamesN/5211283418277743259",
                "is_external_url": true,
                "author": "editor@pcgamesn.com",
                "contents": "The <strong>Lost Ark</strong> September Update is here, and it's time to 'Jump to the Endgame.' The latest <a href=\"https://www.pcgamesn.com/lost-ark-online\">Lost Ark</a> patch notes for the Amazon Games and Smilegate action <a href=\"https://www.pcgamesn.com/10-best-pc-mmos\">MMORPG</a> add some pretty interesting details, including a new dino-themed battle royale mode, a way to reroll your unwanted cosmetic skins, new jump-start servers, and events including the seasonal Arktoberfest for the <a href=\"https://www.pcgamesn.com/100-best-free-pc-games\">free game</a>. <a href=\"https://www.pcgamesn.com/lost-ark-online/patch-notes-september-update\">Read the rest of the story...</a> RELATED LINKS: <a href=\"https://www.pcgamesn.com/lost-ark/jump-start-servers\">Lost Ark introduces new \"independent\" servers for returning players</a> <a href=\"https://www.pcgamesn.com/10-best-pc-mmos\">The best MMO and MMORPGs to play in 2023</a> <a href=\"https://www.pcgamesn.com/lost-ark/patch-notes-august-update\">Lost Ark patch notes - August update introduces Aeromancer class</a> ",
                "feedlabel": "PCGamesN",
                "date": 1694611852,
                "feedname": "PCGamesN",
                "feed_type": 0,
                "appid": 1599340
            },
            {
                "gid": "5159491482927651919",
                "title": "September \"Jump to the Endgame\" Release Notes",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5159491482927651919",
                "is_external_url": true,
                "author": "HardcoreHenry",
                "contents": "Heroes of Arkesia, The September “Jump to the Endgame” Update arrives in Arkesia tomorrow. Downtime will begin on September 13 at 12AM PDT (8 AM UTC) and is expected to last 8 hours. September brings Jump-Start Servers, Primal Island Battle Royale, Yoz’s Jar, adjustments to endgame content, and much more! Henry’s back with Episode 2 of “Patchnotes with Henry” for any players looking for an express video explanation and visual showcase. Want all the details? Find the full list of content, events, skins, and other updates on PlayLostArk.com!",
                "feedlabel": "Community Announcements",
                "date": 1694536279,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 1599340
            },
            {
                "gid": "5159491482924187742",
                "title": "Jump-Start Server Update",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5159491482924187742",
                "is_external_url": true,
                "author": "HardcoreHenry",
                "contents": "Heroes of Arkesia, We’re excited to announce that Jump-Start servers, a system we hope will provide a fresh beginning for new or returning players who are interested in giving Lost Ark another try, will release on September 13 in our September update. We’re excited to welcome new and returning players to the shores of Arkesia and help them experience the many unique raids, dungeons, and character systems that make Lost Ark special. We recognize that the game encountered many challenges at launch, with a steep progression curve, bots, and stability issues. We’ve made serious strides in addressing these and feel confident that we’re in a good place to bring players back. https://images.ctfassets.net/umhrp0op95v1/dyyy8GIXpOe12o1YTXdG9/3f8ff4374bb945ae034dcc318d3ee7e4/lost_ark_screeenshot_002_1920x1080.jpg Players on Jump-Start servers will receive materials that provide faster vertical and horizontal progression, including honing materials, card packs, and more! Find details on some of the ways we plan to help players level up in the Events & Rewards section. Players will get a South Vern pass to “Jump-Start” a character immediately to Item Level 1415. There will be a server available in each region: West - North America - Lauriel East - North America - Azakiel Europe Central - Kayangel South America - Elgacia Jump-Start servers will be isolated from other servers, with independent PvE matchmaking, Party Finder, Marketplace, and Auction House (PvP matchmaking and rank will be shared with the rest of the region). This allows restarting players to have an independent experience that’s unaffected by existing servers/regions. We will be closely monitoring the progression and populations of Jump-Start servers, and plan on reconnecting Jump-Start Servers with their respective regions within the next six months. https://images.ctfassets.net/umhrp0op95v1/SAk3jrbkQPvY10WjgdUXk/013ea62a36c9e601489815cabc1be17e/LA_Elgacia2-1920.jpg Special Events & Rewards Jump-Start Servers will include a medley of special events to help players progress quickly and jump into the endgame. In addition to all the specific events listed below, Jump-Start Servers will also have unique Hot-time and Log-in events! South Vern Powerpass, Story Express, & Jump-Start Mokoko Express Event A Story Express event is available for Jump-Start players to quickly experience Lost Ark’s story on their main or on an alternate character. Story missions will take the player from Item Level 1 to 1415. Select a Story Express Character through the ‘Event Quest’ window and clear story missions for valuable progression materials. The event will last until December 13, 2023. Any character that has not yet completed the ‘On the Border’ quest from Rethramis can become a designated Story Express character. An Event South Vern Powerpass will be available for players to use on Jump-Start Servers until December 13, 2023. Pairing well with the South Vern Powerpass, players will be able to designate one character between Item Level 1415 and 1540 on their account to participate in the Jump-Start Mokoko Express Event, where they’ll have discounted honing rates and earn honing materials to quickly level up to Item Level 1540 and beyond. There’s also Combat Style Setting Support options for players to easily set skills and Engravings through presets, and get item support for accessories and Ability Stones. The designated character will earn valuable rewards as they level up, including Silver, Honing Materials, Gems, Engraving Recipes, and more! The Jump-Start Mokoko Express Event also includes an Engraving Support system that lets players choose 5 Engravings to be in effect at level 3 during the event. https://images.ctfassets.net/umhrp0op95v1/6tkCkXBYYxoqn893aueo1w/bb86677ea6e65e69549f6c4916791af8/Candaria_Territory_04_1920x1080.jpg Welcome Giveaway (First Log-in Gift) A special gift will be awaiting players who log into Jump-Start Servers! XP Boost Characters on Jump-Start Servers will have increased XP gains (200%) Roster Level XP up to Lv. 100 Character Level XP up to Lv. 60 Stronghold Level XP up to Lv. 60 Trade Skill Level XP up to Lv. 60 Exclusive Mokoko’s Shining Harvest Event In this special event rewards are granted to help players rapidly progress. Clearing (and reclearing) Legion Raids, Challenge Abyssal Dungeons, Chaos Dungeons, and Challenge Guardian Raids grant extra (and valuable) rewards. The items include Relic Accessory Chests & Ability Stones, Soaring Card Packs (containing only the cards from entry card sets Deep Dive / You Have A Plan), Gold, and more! This will help players kickstart their accessory and card collections, while also helping populate the Auction House for the player-driven economy to thrive on the new servers. https://images.ctfassets.net/umhrp0op95v1/7M0iRwY82TxmQrvYcFY4XP/81a1218e908b0d1854b45863aa5c99f6/LA_Mokoko_Bloom_7_1080.jpeg Arktoberfest Exchange Shop The Event Shop on Jump-Start Servers will be different than the Event Shop on regular servers, with the goal of helping Jump-Start players progress vertically and horizontally. Jump-Start Servers will have a variety of items for players to earn by exchanging event tokens, which will help them progress their Stepping-stone Card sets, level-up their ship, Rapport, Skill Tree, and Honing. Event tokens can be gained by completing Chaos Dungeons, Guardian Raids, and by participating in the Blooming Mokoko event. Special Store Packages & Cosmetics For players looking to further enhance their characters, the Jump-Start in-game store will have special packages and items. With heavily discounted material packages to boost vertical and horizontal progression (such as Card Packs, Pheons, Silver, and Honing Materials), we want to ensure players on Jump-Start Servers looking to dive into the end-game have options that give them value. And for those looking to vanquish the demonic hordes in style, a variety of cosmetics will be returning from the vault, available exclusively on Jump-Start Servers. Jump-Start players will have plenty of cosmetic customization options available. Looking Ahead We’re excited for new and returning players to experience the many unique raids, dungeons, and character systems that make Lost Ark special. Current players will have plenty to look forward to in September with Primal Island, Yoz’s Jar, new Rapport Affection Ranks, a new Ark Pass, and more! We have a few more surprises and updates planned— so make sure to checkout the September Release Notes. We can’t wait to hop in the Jump-Start servers with everyone on September 13. Until then, we’ll see you in Arkesia. ",
                "feedlabel": "Community Announcements",
                "date": 1694454177,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 1599340
            },
            {
                "gid": "5159491482915648760",
                "title": "Lost Ark introduces new \"independent\" servers for returning players",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/PCGamesN/5159491482915648760",
                "is_external_url": true,
                "author": "editor@pcgamesn.com",
                "contents": "<strong>Lost Ark</strong> is an aesthetically pleasing <a href=\"https://www.pcgamesn.com/10-best-pc-mmos\">MMORPG</a> with plenty of fast-paced fun to go around. Smilegate regularly updates its online experience, adding everything from classes to servers. In the developer's latest news post, Smilegate describes how a new server system is coming to <a href=\"https://www.pcgamesn.com/lost-ark-online\">Lost Ark</a>. Dubbed 'Jump-Start' servers, the new hosts are set to make returning players' lives easier by providing them an independent space in which they learn the game's ropes. <a href=\"https://www.pcgamesn.com/lost-ark/jump-start-servers\">Read the rest of the story...</a> RELATED LINKS: <a href=\"https://www.pcgamesn.com/10-best-pc-mmos\">The best MMO and MMORPGs to play in 2023</a> <a href=\"https://www.pcgamesn.com/lost-ark/patch-notes-august-update\">Lost Ark patch notes - August update introduces Aeromancer class</a> <a href=\"https://www.pcgamesn.com/lost-ark/patch-notes-july-update\">Lost Ark patch notes - July update brings you boosts, but not balance</a> ",
                "feedlabel": "PCGamesN",
                "date": 1694214231,
                "feedname": "PCGamesN",
                "feed_type": 0,
                "appid": 1599340
            },
            {
                "gid": "5141475722323969116",
                "title": "Debate Club Live Finale",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5141475722323969116",
                "is_external_url": true,
                "author": "HardcoreHenry",
                "contents": "Heroes of Arkesia, Join us for the live finale of the Lost Ark Academy Debate Club, a series that has pitted Lost Ark creators (Stoopzz, DatModz, Grenton, Bobajenny) against each other with dozens of debates about popular Lost Ark topics, play styles, and more. In our live finale, the four contestants will compete against each one one last time before a live Twitch audience, who will vote and determine, once and for all, who is - and who is not - a Mokoko. Emceed by KanonXO, hosted by Community Manager Roxx, with guest appearances and Twitch Drops— there are plenty of reasons you won’t want to miss the spectacle. Tune in on August 24, 10am PT, on the official PlayLostArk Twitch Channel. We’ll see you there! ",
                "feedlabel": "Community Announcements",
                "date": 1692808407,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 1599340
            },
            {
                "gid": "5127964289192421476",
                "title": "Region Merge Policy",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5127964289192421476",
                "is_external_url": true,
                "author": "HardcoreHenry",
                "contents": "https://images.ctfassets.net/umhrp0op95v1/7zcOxjyT464azRCDVpQZCJ/ec15010734031691837760200a3e3e4d/Yorn-Notes-Header-1080.jpg On August 30, we will conduct a region merge to fold Europe West into Europe Central. The Europe West world names (Nia & Ealyn) will remain the same and will be integrated into Europe Central. No servers (and therefore rosters) are being merged into each other. Policies that merge or sum item counts will only apply to players with an account in both server regions, and players within those regions can find the specifics below. Market, Auction House, and Currency Exchange Active Market & Auction House product registrations will be cancelled ahead of the merge, along with listings on the Currency Exchange. All Action House and Market transaction history, recent transactions, and interested lists will be deleted after merge. Guild & Character Names Overlapped character names from accounts on Europe West will be reset. When logging in for the first time after the merge, players will be prompted to change their name. Overlapped Guild names from Guilds on Europe West will have a “#” added before their name. A Guild name change will be automatically available to the Guild Master by navigating to Guild > Management > Guild Name Change. Social Open pending requests will not be cancelled, but they will reflect the name changes due to the merge. The character names in the friend and blocked list will also reflect the changes. Recent list will not be cleared, but it will not reflect any name changes due to the merge. We will retain the global chat in Europe Central but Europe west global chats and chat history will be deleted. This means anyone who has a chat setup in Europe West will need to remake it once they are merged into Europe Central. Progression Events Super Mokoko Express & Story Express Events An event status with the higher progression between two regions will remain. In case that the progression is equal, the event info of the character with a higher Item Level will remain. Event rewards from completed missions will be added. Any unclaimed event mission rewards from the event status to be deleted, will be delivered to the Universal Inventory. Event Powerpass The lower count of Event Powerpasses will be retained. Tickets & Tokens Powerpasses, Character Slot Extension Tickets, Reskin Tickets, Name Change Tickets, and Guild Name Change Tickets will all follow the same policy: Purchased Tickets/Tokens will be added together. Free Tickets/Tokens will be added together. The excess above the cap will be discarded. Stronghold The ‘Send Stronghold Gift’ function will be blocked prior to Merge. Sent products will be returned In-game Shop Products in Product Inventory will be integrated. Product purchase limit will be integrated. PvP MMR info of previous seasons was reset when Proving Grounds Season 3 ended on August 16. The Previous season's Ranking info will be reset with the merge. Unclaimed season rewards will be sent to Universal Storage on August 23 in preparation of the region merge. After the August region merge, we will begin identifying servers in need of a merge. Stay tuned for information on region and server merges here, on playlostark.com. In the meantime, we’ll see you in Arkesia. ",
                "feedlabel": "Community Announcements",
                "date": 1692740497,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 1599340
            },
            {
                "gid": "5127964289173524212",
                "title": "Debate Club Episode 12",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5127964289173524212",
                "is_external_url": true,
                "author": "HardcoreHenry",
                "contents": "Heroes of Arkesia, We’re back with your host Roxx and debaters Grenton, Bobajenny, Stoopzz, and DatModz. This episode’s warmup debate topic is:What is the hardest Guardian Raid to complete on item level? For our 1v1 debate, Grenton and Stoopzz have the topic of: What is the most epic boss fight in Lost Ark? Head over to YouTube and let us know who you think is not a Mokoko in the comments. We’ll see you next week for the live finale! ",
                "feedlabel": "Community Announcements",
                "date": 1692292518,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 1599340
            }
        ],
        "count": 250
    }
}