{
    "appnews": {
        "appid": 1172470,
        "newsitems": [
            {
                "gid": "5229301621580342138",
                "title": "Exclusive PS5 content to be exempt from Apex Legends' crossprogression",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/The Loadout/5229301621580342138",
                "is_external_url": true,
                "author": "editor@theloadout.com",
                "contents": "In Season 19, Respawn Entertainment is introducing crossprogression features to its battle royale <strong>Apex Legends</strong>. It's been a long time coming, so to say we're thrilled would be an understatement - and we're not alone in that sentiment, either. However, one thing <strong>PS5</strong> players - and those of you playing on Xbox consoles - should know is that there will be <strong>Apex Legends crossprogression restrictions</strong> in place when it arrives. That means, some of the content you have won't be available everywhere. <a href=\"https://www.theloadout.com/apex-legends/crossprogression-restrictions-ps5\">Read the rest of the story...</a> RELATED LINKS: <a href=\"https://www.theloadout.com/apex-legends/season-19-release-date\">Apex Legends Season 19 release date, Conduit, and latest news</a> <a href=\"https://www.theloadout.com/apex-legends/conduit-abilities\">﻿Apex Legends' new gameplay trailer arrives detailing Conduit's kit</a> <a href=\"https://www.theloadout.com/apex-legends/ranks\">Apex Legends ranks, rewards, LP changes, and more in Season 18</a> ",
                "feedlabel": "The Loadout",
                "date": 1698426274,
                "feedname": "The Loadout",
                "feed_type": 0,
                "appid": 1172470
            },
            {
                "gid": "5229301621576795846",
                "title": "Apex Legends: Ignite Gameplay Trailer",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5229301621576795846",
                "is_external_url": true,
                "author": "mattrodriguez",
                "contents": "It’s your Time to Shine in Apex Legends: Ignite. Light the way with Conduit, the new support Legend whose abilities can spark victory for your squad. Battle through a faster, deadlier Storm Point, overhauled with a reduced map size, devastated locations and POI updates to amp up the intensity. Explore what dangers await at new Points of Interest like Watton’s Pylon, ZEUS Station, and more. Unify your accounts with Cross Progression, proving yourself among the pantheon of Legends and ascend the Ignite Battle Pass to earn cosmetics worthy of a champion. Time To Shine with Conduit when Apex Legends: Ignite drops Oct 31st! Learn More: http://x.ea.com/apxl/ignite",
                "feedlabel": "Community Announcements",
                "date": 1698342609,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 1172470
            },
            {
                "gid": "5229301621578895369",
                "title": "﻿Apex Legends' new gameplay trailer arrives detailing Conduit's kit",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/The Loadout/5229301621578895369",
                "is_external_url": true,
                "author": "editor@theloadout.com",
                "contents": "The next major <strong>Apex Legends</strong> update is almost upon us and Respawn Entertainment is showing off the Apex Games' newest contestant, Conduit, with a brand new Ignite gameplay trailer you won't want to miss out on. If you want to know exactly what <strong>Apex Legends' Conduit abilities</strong> are ahead of Season 19, this really is our best look at them yet - and they look like a lot of fun to use. <a href=\"https://www.theloadout.com/apex-legends/conduit-abilities\">Read the rest of the story...</a> RELATED LINKS: <a href=\"https://www.theloadout.com/apex-legends/crossprogression-restrictions-ps5\">Exclusive PS5 content to be exempt from Apex Legends' crossprogression</a> <a href=\"https://www.theloadout.com/apex-legends/season-19-release-date\">Apex Legends Season 19 release date, Conduit, and latest news</a> <a href=\"https://www.theloadout.com/apex-legends/ranks\">Apex Legends ranks, rewards, LP changes, and more in Season 18</a> ",
                "feedlabel": "The Loadout",
                "date": 1698341633,
                "feedname": "The Loadout",
                "feed_type": 0,
                "appid": 1172470
            },
            {
                "gid": "5229301621576418233",
                "title": "Apex Legends season 19 finally adds the one feature players have been begging for",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/VG247/5229301621576418233",
                "is_external_url": true,
                "author": "",
                "contents": "<a href=\"https://www.vg247.com/games/apex-legends\">Apex Legends</a> season 19 is almost here. With it, the game is getting the usual spread of map reworks, a new Legend for players to mess around with, a battle pass with new cosmetics, etc. But it's also getting something special - a feature fans have been asking about for years now. Apex Legends is getting cross progression. As soon as the season starts, Apex Legends players with multiple accounts spread across PC and consoles will have their accounts merged into one master account. Your highest rank across your accounts will carry over, as will all your cosmetics which will be compiled into one neat collection. We're not quite sure yet how duplicate cosmetics will work, but fingers crossed that you get a nice amount of in-game currency. This is obviously great news for longtime players, especially those who may have a stray legendary skin lost on an old console (<a href=\"https://www.vg247.com/apex-legends-switch-trailer.\">or even the dreaded Apex Legends Switch version</a>) that they've been leaving to gather dust for a while now. Cross progression is one of those features that have been demanded by a subset of the community for a while now - almost as much as the push to make <a href=\"https://www.vg247.com/apex-legends-everything-on-control\">certain limited time modes permanent</a>. As long as this doesn't lead to significant bugs or lost progress, this should go down a treat. <a href=\"https://www.vg247.com/apex-legends-season-19-cross-progression\">Read more</a> ",
                "feedlabel": "VG247",
                "date": 1698333105,
                "feedname": "VG247",
                "feed_type": 0,
                "appid": 1172470
            },
            {
                "gid": "5218041989058667115",
                "title": "Apex Legends: Ignite Launch Trailer",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5218041989058667115",
                "is_external_url": true,
                "author": "mattrodriguez",
                "contents": "Conduit pitches fellow Legends Mirage and Gibraltar on her ideas for the perfect intro trailer. It's a huge dilemma, but luckily she's got support from her family, her squad, and her fully kitted Triple Take. Time To Shine with Conduit when Apex Legends: Ignite drops Oct 31st! Learn More: http://x.ea.com/apxl/ignite",
                "feedlabel": "Community Announcements",
                "date": 1698093681,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 1172470
            },
            {
                "gid": "5218041989060588729",
                "title": "Apex Legends' epic new Ignite trailer shows off Conduit's abilities",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/The Loadout/5218041989060588729",
                "is_external_url": true,
                "author": "editor@theloadout.com",
                "contents": "If you're looking forward to Respawn Entertainment's next <strong>Apex Legends</strong> update, then you're going to need to check out the brand new <strong>Apex Legends Ignite trailer</strong>. Not only is this another fantastic cinematic from EA (and production company Dark Burn Creative), it also shows of <strong>Apex Legends' Conduit abilities</strong> - oh, and Revenant sings a bit of a rock ballad. Heartwarming messages aside, that alone makes it well worth a watch. <a href=\"https://www.theloadout.com/apex-legends/ignite-trailer-conduit-abilities\">Read the rest of the story...</a> RELATED LINKS: <a href=\"https://www.theloadout.com/apex-legends/conduit-abilities\">﻿Apex Legends' new gameplay trailer arrives detailing Conduit's kit</a> <a href=\"https://www.theloadout.com/apex-legends/ranks\">Apex Legends ranks, rewards, LP changes, and more in Season 18</a> <a href=\"https://www.theloadout.com/apex-legends/season-19-release-date\">Apex Legends Season 19 release date, new Legend, and latest news</a> ",
                "feedlabel": "The Loadout",
                "date": 1698084395,
                "feedname": "The Loadout",
                "feed_type": 0,
                "appid": 1172470
            },
            {
                "gid": "5218041989056867462",
                "title": "Fan Art",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5218041989056867462",
                "is_external_url": true,
                "author": "Electronic Arts",
                "contents": "小黑盒@鱼刺宝宝 New skins: Wattson - Static Spike Cruel Medicine, Catalyst - Gorgon’s Glare, Lifeline - Cruel Medicine {STEAM_CLAN_IMAGE}/38098458/2dea23fb78e0c1ed8c4de599ee62d1283e4c64bd.png {STEAM_CLAN_IMAGE}/38098458/c50c0c698adf93512e54660a3de63fe844015d2d.png {STEAM_CLAN_IMAGE}/38098458/37a18ec1026de6cf4c7566e14c0655cdbf51e993.png {STEAM_CLAN_IMAGE}/38098458/2a5a21777d19a4334f78759689e0622a28c3af85.png 小黑盒@放羊的ULU Octane fright fest’s skin - Jump Scare {STEAM_CLAN_IMAGE}/38098458/2446e4fc9d09ab0b698d4aa2618529fe59915dab.png {STEAM_CLAN_IMAGE}/38098458/b8bba367590339efffb487a4245ab79e3ab2ae72.png {STEAM_CLAN_IMAGE}/38098458/a694c551af9533c488aae3e3e748b6d0632174c8.png {STEAM_CLAN_IMAGE}/38098458/13d8a58262cb732e0abe2972e12174314b84da66.png ",
                "feedlabel": "Community Announcements",
                "date": 1698051036,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 1172470
            },
            {
                "gid": "5218041989050441331",
                "title": "Вышла кулинарная книга по Apex Legends",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/Gamemag.ru/5218041989050441331",
                "is_external_url": true,
                "author": "Rakot",
                "contents": "В продаже появилась книга кулинарных рецептов от авторов <strong>Apex Legends</strong>. Согласно описанию, поклонников ждут около 170 страниц и более 65 легендарных блюд «от соблазнительных закусок до сытных спредов, которыми можно накормить всю команду, позволяя отпраздновать как чемпион». ",
                "feedlabel": "Gamemag.ru",
                "date": 1697898600,
                "feedname": "Gamemag.ru",
                "feed_type": 0,
                "appid": 1172470
            },
            {
                "gid": "5218041989047204950",
                "title": "Apex Legends' Conduit is here and everyone's saying the same thing",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/The Loadout/5218041989047204950",
                "is_external_url": true,
                "author": "editor@theloadout.com",
                "contents": "It feels like a long time since we've seen everyone in the <strong>Apex Legends</strong> community on the same page, but Respawn Entertainment seems to have managed to bring everyone together with Conduit: the Outlands' newest Apex Games competitor. Joining the battle royale in Season 19, <strong>Apex Legends' Conduit</strong> is already proving popular among fans - and we've only seen her Stories From The Outlands lore trailer, so far. <a href=\"https://www.theloadout.com/apex-legends/conduit-reaction\">Read the rest of the story...</a> RELATED LINKS: <a href=\"https://www.theloadout.com/apex-legends/ignite-trailer-conduit-abilities\">Apex Legends' epic new Ignite trailer shows off Conduit's abilities</a> <a href=\"https://www.theloadout.com/apex-legends/season-19-release-date\">Apex Legends Season 19 release date, new Legend, and latest news</a> <a href=\"https://www.theloadout.com/apex-legends/ranks\">Apex Legends ranks, rewards, LP changes, and more in Season 18</a> ",
                "feedlabel": "The Loadout",
                "date": 1697821698,
                "feedname": "The Loadout",
                "feed_type": 0,
                "appid": 1172470
            },
            {
                "gid": "5218041989045992201",
                "title": "Apex Legends' newest character reveal will put those Titanfall 3 rumours to bed",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/VG247/5218041989045992201",
                "is_external_url": true,
                "author": "",
                "contents": "<strong>Respawn Entertainment</strong> has revealed its next character coming to <strong>Apex Legends</strong>, and their reveal trailer certainly downplays recent Titanfall 3 speculation. Yesterday, Respawn released a new episode of its Stories from the Outlands series titled \"For Us, Utang na Loob,\" which is all about the origin of Apex Legends' newest character Conduit, who also happens to be the game's first Filipino legend. As always, it's a nice little animated trailer giving us some insight into how Conduit found her way to the Apex Games. The trailer kicks off with quite a bleak look at Conduit's childhood, showing us that her hometown was under attack from a group of enemy titans. Thankfully, a Monarch titan comes to the rescue, letting her and her family live quite an idyllic life, and of course Conduit is quite the fan of the Apex Games. Unfortunately, her mother still seems to have a difficult workload, eventually netting herself a serious injury which leads them to some financial trouble. Lucky for Conduit, that same Monarch titan stayed in her town, though it has been cordoned off due to it leaking radiated energy. Obviously that doesn't stop her, and she goes to find the titan where she gets… some kind of power, it hasn't actually been revealed yet. In turn, she'll clearly be joining the Apex Games soon as part of the game's next season, <a href=\"https://www.ea.com/en-gb/games/apex-legends/ignite\">Ignite</a>. <a href=\"https://www.vg247.com/apex-legends-newest-character-reveal-will-put-those-titanfall-3-rumours-to-bed\">Read more</a> ",
                "feedlabel": "VG247",
                "date": 1697793183,
                "feedname": "VG247",
                "feed_type": 0,
                "appid": 1172470
            }
        ],
        "count": 941
    }
}