{
    "appnews": {
        "appid": 1086940,
        "newsitems": [
            {
                "gid": "5219165352634844843",
                "title": "Baldur's Gate 3's Astarion says there's a tough to find two hour section no one has played yet",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/VG247/5219165352634844843",
                "is_external_url": true,
                "author": "",
                "contents": "According to the voice of Astarion himself, there's a whole two hour section of <a href=\"/baldurs-gate-3-walkthrough\">Baldur's Gate 3</a> no one has played yet. Baldur's Gate 3 is a mammoth sized game, with a ridiculous number of routes and storylines you can experience. It's fitting considering the nature of its Dungeons and Dragons origins, but it also means that most players probably aren't going to experience it all. But it seems even the completionists out there haven't quite seen everything yet, as Neil Newborn, fan favourite Astarion's voice actor, has said there's a two hour long section nobody has managed to find so far (thanks, <a href=\"https://www.gamespot.com/articles/baldurs-gate-3-voice-actor-claims-theres-a-two-hour-section-of-the-game-no-one-has-found-yet/1100-6517908/?ftag=CAD-01-10abi2f\">GameSpot</a>). \"There's even something I know about that you can't get to unless you do something that I don't think anyone's going to work out,\" Newborn said in the livestream, which you can see him talk about in a clip above. \"I was told this in confidence and I think I'm one of the few people who knows about it as well.\" In the stream Newborn was even asked if he could tell the person he was talking to what it is, but noted \"it's one of those few things I cannot friend-DA.\" Just to clarify, Newborn will have signed an NDA to work on this project, unsurprisingly, but people are people and they do tell their friends things, but this seems like something so secretive he can't even do that. <a href=\"https://www.vg247.com/baldurs-gate-3-hidden-two-hour-section\">Read more</a> ",
                "feedlabel": "VG247",
                "date": 1695565125,
                "feedname": "VG247",
                "feed_type": 0,
                "appid": 1086940
            },
            {
                "gid": "5219165352634332869",
                "title": "Baldur's Gate 3 получила третий патч — теперь можно изменить внешность персонажу",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/Gamemag.ru/5219165352634332869",
                "is_external_url": true,
                "author": "Илья Корпылёв",
                "contents": "<strong>Larian Studios </strong>сообщила о выпуске третьего патча для ролевой <strong>Baldur's Gate 3</strong>. Размер файла на <strong>ПК </strong>составил <strong>4,9 ГБ</strong>. ",
                "feedlabel": "Gamemag.ru",
                "date": 1695522000,
                "feedname": "Gamemag.ru",
                "feed_type": 0,
                "appid": 1086940
            },
            {
                "gid": "5219165352631232825",
                "title": "Watch your favorite Baldur's Gate 3 companions play a hectic DnD game",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/PCGamesN/5219165352631232825",
                "is_external_url": true,
                "author": "editor@pcgamesn.com",
                "contents": "If you've finished <strong>Baldur's Gate 3</strong> and want to see even more of Astarion, Lae'zel, Karlach, Gale, Wyll, and Shadowheart interacting with each other while abiding by the laws of Dungeons and Dragons (who doesn't?) then do we have a treat for you. The Baldur's Gate 3 companion cast of Origin has just started their own game of DnD, and it's as heartwarming and frantic as you'd expect. <a href=\"https://www.pcgamesn.com/baldurs-gate-3/cast-play-dnd\">Read the rest of the story...</a> RELATED LINKS: <a href=\"https://www.pcgamesn.com/baldurs-gate-3/transmog-mod\">Baldur's Gate 3 gets a fully fledged cosmetic armor system</a> <a href=\"https://www.pcgamesn.com/baldurs-gate-3/patch-3-notes\">Baldur's Gate 3 patch notes are here for its third major update</a> <a href=\"https://www.pcgamesn.com/baldurs-gate-3/romance\">Baldur's Gate 3 romance and sex explained</a> ",
                "feedlabel": "PCGamesN",
                "date": 1695476862,
                "feedname": "PCGamesN",
                "feed_type": 0,
                "appid": 1086940
            },
            {
                "gid": "5219165352628189963",
                "title": "Baldur's Gate 3 patch notes are here for its third major update",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/PCGamesN/5219165352628189963",
                "is_external_url": true,
                "author": "editor@pcgamesn.com",
                "contents": "<strong>Baldur's Gate 3 patch notes</strong> are here at last for the mammoth Baldur's Gate 3 patch 3, after the update was pushed back a day by developer Larian Studios to ensure full testing. The massive update includes the previously announced Magic Mirror, which will allow you to change the appearance of your characters, as well as Mac support, improved dyes, and improved performance in the game's third act. <a href=\"https://www.pcgamesn.com/baldurs-gate-3/patch-3-notes\">Read the rest of the story...</a> RELATED LINKS: <a href=\"https://www.pcgamesn.com/baldurs-gate-3/transmog-mod\">Baldur's Gate 3 gets a fully fledged cosmetic armor system</a> <a href=\"https://www.pcgamesn.com/baldurs-gate-3/cast-play-dnd\">Watch your favorite Baldur's Gate 3 companions play a hectic DnD game</a> <a href=\"https://www.pcgamesn.com/baldurs-gate-3/romance\">Baldur's Gate 3 romance and sex explained</a> ",
                "feedlabel": "PCGamesN",
                "date": 1695404265,
                "feedname": "PCGamesN",
                "feed_type": 0,
                "appid": 1086940
            },
            {
                "gid": "5219165352627994783",
                "title": "New Baldur's Gate 3 patch lets you be the Tav you want to be",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/VG247/5219165352627994783",
                "is_external_url": true,
                "author": "",
                "contents": "Larian Studios has released patch 3 for <a href=\"/baldurs-gate-3-walkthrough\">Baldur's Gate 3</a> and it's a doozy. Patch 3 not only fixes several things, it also brings the full release to Mac and allows you to change your character's appearance in-game via the Magic Mirror. For Mac users, as with the PC release in August, saves made in previous versions are not compatible with the full release. To prepare for the full version of the game and minimize potential compatibility issues, Mac users should fully uninstall the game and remove any mods before installing the latest version. <a href=\"https://www.vg247.com/baldurs-gate-3-patch-3-released\">Read more</a> ",
                "feedlabel": "VG247",
                "date": 1695401554,
                "feedname": "VG247",
                "feed_type": 0,
                "appid": 1086940
            },
            {
                "gid": "5219165352627880665",
                "title": "Baldur's Gate 3's third patch just dropped and it's over 20,000 words big—fixing small holes, thieving skeletons, and counterspelling a nuke",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/PC Gamer/5219165352627880665",
                "is_external_url": true,
                "author": "Harvey Randall",
                "contents": "<a href=\"https://www.pcgamer.com/baldurs-gate-3-guide/\"><strong>Baldur&apos;s Gate 3</strong></a>&apos;s latest patch&#x2014;the third in two months&#x2014;is out right now, and it&apos;s a doozy... <a href=\"https://www.pcgamer.com/baldurs-gate-3s-third-patch-just-dropped-and-its-over-20000-words-bigfixing-small-holes-your-lovers-going-cold-after-prison-thieving-skeletons-and-counterspelling-a-nuke?utm_source=steam&utm_medium=referral\" target=\"_blank\">Read more.</a>",
                "feedlabel": "PC Gamer",
                "date": 1695399712,
                "feedname": "PC Gamer",
                "feed_type": 0,
                "appid": 1086940
            },
            {
                "gid": "5219165352627633716",
                "title": "Patch #3: Mac Support, Magic Mirror & More!",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5219165352627633716",
                "is_external_url": true,
                "author": "Molly @ Larian",
                "contents": "Hello everyone, Patch 3 is now live for Baldur’s Gate 3. Mac users and chronic character re-creators rejoice! Friday’s update will bring the full release of Baldur’s Gate 3 to Mac, and allow you to change your character’s appearance in-game via the Magic Mirror. These patch notes are hefty, and once again exceed Steam’s character limit for patch notes! If you want to skip the highlights and check out the full notes, head to this link. Mac Support With Patch 3, Baldur’s Gate 3 is now fully supported on Mac! As with the PC release in August, saves made in previous versions of BG3 on Mac will not be compatible with the full release. To prepare your Mac for the full version of Baldur’s Gate 3 and minimise potential compatibility issues, we recommend you fully uninstall the game and remove any mods before installing the latest version. The minimum and recommended specs for Mac users have also been updated: we recommend an M1 Pro processor and FSR enabled to run the game at high or ultra settings on a Retina display. Check the Steam store page for more details. Mac players, thank you for your patience – now, gather your party and venture forth. Magic Mirror Tucked away in your camp, exuding a certain ‘we found this at a vintage fair and it’s too fancy for our current home’ energy, is an item called the Magic Mirror. Tales have been told of its legendary ability to permanently alter the appearance of one who gazes into it. The Magic Mirror allows you to change up your appearance whenever you’d like, however many times you’d like. There are some restrictions: your appearance, voice, pronouns and nether regions can be changed, but your race/subrace and body type cannot. Origin characters, hirelings and full illithids cannot use the Magic Mirror. Cosmetic modifications that are a consequence of your gameplay choices will persist – hag got your eye? Swallow any interesting tadpoles lately? There’s no Magic Mirroring those big life decisions away. Personally, we’ll be applying incrementally heavier eyeliner whenever we have a Dark Urge moment in our playthrough to really emphasise our descent. {STEAM_CLAN_IMAGE}/35190511/47da4e70e7c5e8e6bcba978b0fa4e46a26b967df.gif Ooh, the mysteries of the void – time to change that ill-advised hair colour. Once again, our patch notes have been defeated by the Steam character limit. Read the full notes here, but beware of spoilers! Check out some of the notes for Patch 3 below. We’re still working on further updates with additional features and epilogue scenes, and your continued feedback is helping to shape and impact the future of Baldur’s Gate 3. Until next time, thank you for playing! HIGHLIGHTS Baldur’s Gate 3 is now fully supported on Mac! A Magic Mirror that lets you change your appearance is now available at camp! Combat Cazador now cannot turn into or remain in his Mist Form if in magical sunlight, such as that created by the Daylight spell. Fixed Ansur's Stormheart Nova blasting right through the ice shields you can hide behind. Grym suddenly got eerily smart and was avoiding the Crucible in the Adamantine Forge. With a nervous laugh, we dumbed him back down a little. Fixed Level 4 or higher Divine Smite allowing you to add Divine Smite as a reaction, allowing for two Divine Smites in 1 attack. Fixed the Divine Smite damage increasing over the cap of 5d8. Made several improvements to the Poltergeist enemy: they are now revealed on being attacked or hit with Radiant Spirit Guardians; they will not turn Invisible again if they are still in a character's See Invisibility aura; in Balanced and Explorer Mode, they have disadvantage on Dexterity Saving Throws when Invisible; the range of their attacks has been reduced; and they won't try to keep distance from the player in combat so that they are easier to find. Fixed the Sneak Attack damage bonus not increasing to 6d6 at Level 11. Fixed a case where multiple Smokepowder Arrows could be used for free while the Extra Attack feature was active. PS5 The colours on the PS5 controller will now match elemental damage types more closely. Performance Improved performance in the Lower City. More to come! Art Made dye colours more intense and more visible on some armours. This will only affect newly dyed items. Dragonborn characters can now select any of the barbarian piercings. Fixed Shadowheart going blonde when equipping a hat. Improved the reflection in the Spectator's eye in the Underdark. Fixed face tattoos disappearing when zooming out. Flow and Scripting Fixed a bug where companions temporarily leaving the party (e.g. being sent to prison) would forget their partnership history and act unusually cold towards you. Fixed a bug letting you trade with Cazador while he begs for mercy. Improved the Astarion romance flow if you agreed to spend a night with him before going to camp by disabling some less important camp moments. Fixed some dialogue options only showing up once when talking to Withers. Fixed a blocker where if you knock Orin's Slayer form into the chasm, you can't get her Netherstone. Fixed an issue causing Dammon to enter combat and die at Last Light, preventing Karlach's story from progressing. Added a journal step for when the tieflings leave the Emerald Grove. The Forging of the Heart quest will also close if Dammon is no longer available in the region. Fixed the game thinking you're dating Gale instead of Karlach in one of the dialogues with Karlach. You now need higher approval for Shadowheart to confess her Shar worship to you. Myshka the cat will now follow you around if told to, even if you don't have Speak with Animals. Halsin, Jaheira, and Minthara will no longer be able to undergo Volo's icepick lobotomy. It's just not their kind of pastime. Fixed not being able to cut Vanra out of the hag by interacting with her Knocked Out body if all of her mushrooms are destroyed. Lae'zel will no longer tag along (whether dead or alive) after you slit her throat when she ambushes you at night. Fixed a bug allowing you to yoink the Orphic Hammer right out of the so-called Impervious Sphere in the House of Hope if someone else in your party is in an interactive dialogue with the sphere. Fixed a flow issue in Shadowheart's endgame romance dialogue to make sure Karlach appears alone in Avernus if Shadowheart says she'll meet her there at a later point in time. Fixed Karlach's journal mistakenly saying you arrived in the Shadow-Cursed Lands when you arrive at the Rosymorn Monastery Trail. Wyll should now acknowledge Karlach approaching him for the first time more consistently. Fixed an issue that caused the Shadowheart swimming scene to not play for some players. The Narrator no longer thinks you're a mind flayer when you're not. Fixed companions talking about killing Gortash after meeting Orin even if the former is already dead. Fixed issues with Astarion discussing topics that are no longer relevant. Reworked the interaction between Nere and Minthara: The 'Travel to Moonrise Towers' quest no longer sends you to Minthara after saving Nere - he has a lyre of his own now. He gifts it to you if you saved him from the cave-in. This lyre can now be used to call for the drider through the Shadow-Cursed Lands, like Minthara's lyre does. Both lyres have new descriptions. Nere no longer mentions Minthara in his Speak with Dead. You can ask Minthara for a safe passage to Moonrise if you'd heard about it. She will ask to raid the Emerald Grove first. If this happens, Nere can be asked about Minthara and then Minthara can be asked about Nere. The journals for 'Travel to Moonrise Towers' and 'Follow the Convoy' were updated accordingly. Saving Nere no longer creates a danger zone if the duergar was killed before clearing the cave-in. During your date with Karlach, Tender Henk will no longer walk away to reveal another Tender Henk standing behind him. Staring. Gameplay The following spells will now correctly break the Sanctuary condition: Call Lightning, Evard's Black Tentacles, Polymorph, Hunger of Hadar, Fear, Ice Storm, Flesh to Stone, Divine Intervention, Hypnotic Pattern, Slow, Stinking Cloud, Banishment, Glyph of Warding. Level Up will now queue all characters who can be levelled up so you don't have to click on them individually. Fixed some corpses never showing the '(empty)' tag after you loot them. Fixed not being able to use some reactions while in disguise. Cazador's staff, Woe, now correctly unlocks the Blight spell when equipped. Fixed several magic items and Volo's Ersatz Eye losing their power after you are killed and revived. Fixed the Spell Sniper feat not working on attack spells. The Spell Sniper feat will now correctly reduce the Critical Hit threshold by 1. Fixed the Idol of Silvanus buff disappearing after Long Rest. NPCs will no longer run away from anything but the Dark Urge Slayer form to improve interactivity and flow. Mummies raised through Create Undead can now Jump to follow you around better. The Everburn Blade now correctly sets explosive surfaces and explosive objects alight when hit. The Misty Escape feat will no longer break concentration. Reading shop signs will no longer be considered a crime. The Cutting Words reaction is now set to Ask by default. Summoned zombies and skeletons will no longer be able to pick up loot and disappear with it when dismissed. The Azer summon's Overheat ability is now available on its hotbar when summoned. The Nimblefinger Gloves now correctly apply their Dexterity bonus to gnomes, halflings, and dwarves. Fixed an Animate Dead exploit allowing you to summon 2 skeletons from the same corpse. Optimised how the game handles object selection on controller. Fixed Sovereign Spaw being able to resurrect hirelings with Animating Spores. We taught him to not use this on player characters anymore. UI Your selected trade mode (trade or barter) is now saved to your player profile. Added an option to the Default Online Settings to let you automatically listen in when another party member enters a dialogue in multiplayer. Clarified whether something is a Resistance, a Vulnerability, or an Immunity in the Examine window. Added a notification for when another player in your party is trading. Fixed spells being interrupted by climbing, allowing you to attack twice after climbing down from a crate. Updated the Character Sheet on controller to place active Conditions above the list of Notable Features. Level Design Fixed some small holes in Act I that weren't letting tiny characters through them. Writing Added a dialogue option to the first in-person dialogue with the Dream Visitor to avoid only having two antagonistic choices. Rewrote some spell and action descriptions that were too vague. Audio Fixed Raphael's boss fight music sometimes being incomplete or missing. Fixed some VO not playing in dialogues on PS5 split-screen. Fixed audio cutting out with 3D Audio enabled on PS5. Optimised audio in merged split-screen cinematics. Cinematics Improved contact when petting Ketheric's good girl, Squire. Added some lovely blood spurts when Volo carries out his expert operation. Fixed Wyll's horns clipping into Karlach's face during an Act II romance scene. Fixed missing music on the Wyll path of Karlach's endgame scene in Avernus. Placed a nice purple picnic blanket in a romantic scene with Gale and fixed a camera spin if you choose to prefer to spend your time with him on a bed. Fixed Shadowheart looking like she's either in pain or about to sneeze in the background of a dialogue with Thulla. Added some missing Boo squeaks. Reworked the intro of the scene when you approach the altar at the Temple of Bhaal and fixed some bugs. Updated cameras, facial expressions and head directions to better suit the tone in dialogue with Shadowheart. Fixed some pops and camera issues when you start dating Lae'zel, including Lae'zel's body flying elsewhere and then back again mid-dialogue. Boo will now be framed in the shot as intended when you talk to Jaheira after recruiting Minsc. Fixed Scratch floating in the air while you pet him by the posthouse in Rivington. Read the full Patch 3 patch notes (Note: Some of the entries might have spoilers!) ",
                "feedlabel": "Community Announcements",
                "date": 1695394165,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 1086940
            },
            {
                "gid": "5219165352624687849",
                "title": "Baldur's Gate 3 patch 3 adds long-awaited option to change appearance",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/PCGamesN/5219165352624687849",
                "is_external_url": true,
                "author": "editor@pcgamesn.com",
                "contents": "The <strong>Baldur's Gate 3 patch notes</strong> for BG3 patch 3 are almost here, and developer Larian Studios is promising \"a big one.\" As part of the next big Baldur's Gate 3 update, the developer of the Dungeons and Dragons RPG taking over Steam (and the world) reveals that you'll now, as previously promised, be able to change appearance and customize your character midway through a campaign, which will undoubtedly be music to the ears of many. <a href=\"https://www.pcgamesn.com/baldurs-gate-3/patch-3-change-appearance\">Read the rest of the story...</a> RELATED LINKS: <a href=\"https://www.pcgamesn.com/baldurs-gate-3/transmog-mod\">Baldur's Gate 3 gets a fully fledged cosmetic armor system</a> <a href=\"https://www.pcgamesn.com/baldurs-gate-3/cast-play-dnd\">Watch your favorite Baldur's Gate 3 companions play a hectic DnD game</a> <a href=\"https://www.pcgamesn.com/baldurs-gate-3/patch-3-notes\">Baldur's Gate 3 patch notes are here for its third major update</a> ",
                "feedlabel": "PCGamesN",
                "date": 1695405502,
                "feedname": "PCGamesN",
                "feed_type": 0,
                "appid": 1086940
            },
            {
                "gid": "5219165352624178132",
                "title": "Baldur's Gate 3 is finally getting an appearance-changing 'magic mirror,' praise Mystra",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/PC Gamer/5219165352624178132",
                "is_external_url": true,
                "author": "Harvey Randall",
                "contents": "It&apos;s about time&#x2014;<a href=\"https://www.pcgamer.com/baldurs-gate-3-guide/\"><strong>Baldur&apos;s Gate 3</strong></a> has a lovely little character creator, giving you a wide range of choices to tickle your Tav&apos;s fancy. But there&apos;s been a lingering curse in the game since launch day: once you leave character creation, you&apos;re stuck that way forever. Well, with the upcoming <a href=\"https://www.pcgamer.com/baldurs-gate-3s-next-big-patch-has-been-slightly-delayed/\">Patch 3</a> arriving September 22, no longer... <a href=\"https://www.pcgamer.com/baldurs-gate-3-is-finally-getting-an-appearance-changing-npc-praise-mystra?utm_source=steam&utm_medium=referral\" target=\"_blank\">Read more.</a>",
                "feedlabel": "PC Gamer",
                "date": 1695312014,
                "feedname": "PC Gamer",
                "feed_type": 0,
                "appid": 1086940
            },
            {
                "gid": "5219165352623721533",
                "title": "Baldur's Gate 3's next 'big' patch has been slightly delayed",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/PC Gamer/5219165352623721533",
                "is_external_url": true,
                "author": "Dave Jones",
                "contents": "The next patch for <a href=\"https://www.pcgamer.com/baldur-s-gate-3/\" target=\"_blank\">Baldur&apos;s Gate 3</a> is going to be \"a big one\" according to a recent <a href=\"https://twitter.com/larianstudios/status/1704630736693998065\" target=\"_blank\">tweet</a> from Larian Studios, but sadly we&apos;ll have to wait one whole day longer than we expected. The release of Patch 3 will be pushed from September 21st to September 22nd giving them time to \"ensure thorough testing\"... <a href=\"https://www.pcgamer.com/baldurs-gate-3s-next-big-patch-has-been-slightly-delayed?utm_source=steam&utm_medium=referral\" target=\"_blank\">Read more.</a>",
                "feedlabel": "PC Gamer",
                "date": 1695301307,
                "feedname": "PC Gamer",
                "feed_type": 0,
                "appid": 1086940
            }
        ],
        "count": 853
    }
}