{
    "appnews": {
        "appid": 381210,
        "newsitems": [
            {
                "gid": "5229301621576292663",
                "title": "Update 7.3.2 | Bugfix Patch",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5229301621576292663",
                "is_external_url": true,
                "author": "dance_BHVR",
                "contents": "{STEAM_CLAN_IMAGE}/11814497/38ef05b3ff2feb4f66d285bb7a68fafba30388cd.jpg Release Schedule Update releases: 11AM ET Content Killer - The Skull Merchant Reworked Low Power Mode Add-on: Now decreases Drone Rotation speed by 100%, effectively stopping rotation. No longer decreases Power cooldown by 25%. Environment/Maps The maximum number of pallets spawned in the Shattered Square Map has been increased to 18 to prevent large areas of the map from spawning with no pallets. The quality of the loops were also updated to reduce their safety. We hope this adds better gameplay for both roles. Note: The map is not guaranteed to generate with this many pallets and will instead prematurely stop spawning pallets if the minimum pallet requirement has been reached and there are no more valid positions far enough from other pallets. Bug Fixes Audio Memory fragment shards that have been collected or have despawned no longer produce SFX. Characters Fixed an issue that caused The Huntress reload animation to cause motion sickness when paired with the Iron Maiden perk. Fixed an issue that caused The Xenomorph pick-up animation from a Locker to jitter in a specific Locker inside the Main Building. Fixed an issue that caused the heads of all female Survivors to clip through the Hook during the struggle phase. Fixed an issue that caused The Legion's upper body to be contorted while the camera snaps back into position after performing Memento Mori. Fixed an issue that allowed The Cannibal's camera to clip through Lockers when performing a basic attack on them. Fixed an issue that caused survivors to experience clipping with the artist when picking up and putting down survivors. The Demogorgon’s Portals’ auras now properly appear after having performed a Mori. Environment/Maps Fixed a potentially broken Killer spawn point on Nostromo Wreckage. Fixed a killer blocking collision on MacMillan Estate Realm. Fixed an issue on Suffocation Pit where the Nightmare could not place his Dream Snares. Fixed a killer blocking collision issue on the Temple of Purgation. Fixed an issue where branches of trees could clip through the main building in Eyrie of Crows. Fixed an issue where the Tonic Fumes of the clown could go through ceiling in buildings of the MacMillan Estate Realm. Fixed an issue on Raccoon City Police Station where The Nemesis' tentacles could go through walls. Fixed an issue in Coldwind Farm where items could be hidden in the ground near the corn rows. Fixed an issue on Disturbed Ward where survivors could heal each other through walls. Updated the layout of the combine harvester where small killers could not interact with survivors that are standing on one side. Fixed an issue where players could land on top of pews in the Father Campbell's Chapel. Fixed an issue in Eyrie of Crows where survivors healing each other can end up stuck in roots. Event - Haunted By Daylight Lighting now properly resets when entering the Void during The Dredge’s Nightfall or while in The Nightmare’s Dreamworld. Killer - The Skull Merchant Claw traps are propertly destroyed when a survivor disconnects without being replaced by a bot in a Custom Game. The Map now properly tracks the Skull Merchant’s’ drones when equipped with Red Twine Add-On. Misc Fixed an issue that could disconnect players mid-trial. ",
                "feedlabel": "Community Announcements",
                "date": 1698330685,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 381210,
                "tags": [
                    "patchnotes",
                    "mod_reviewed",
                    "ModAct_487997664_1698332004_0",
                    "mod_require_rereview"
                ]
            },
            {
                "gid": "5229301621572300606",
                "title": "Halloween PS Store sale is a DLC frenzy for this PS Plus horror game",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/The Loadout/5229301621572300606",
                "is_external_url": true,
                "author": "editor@theloadout.com",
                "contents": "The great thing about <strong>PS Plus</strong> is having the chance to revisit games you dismissed initially, and one such game might be <strong>Dead By Daylight</strong>. While the asymmetrical horror still is going strong, you might feel out of the loop as you look for a terrifying game to play this Halloween. Luckily, this new <strong>Halloween PS Store sale</strong> makes now the perfect time to jump back in on PS4 and PS5. <a href=\"https://www.theloadout.com/ps-plus/dead-by-daylight-dlc-sale\">Read the rest of the story...</a> RELATED LINKS: <a href=\"https://www.theloadout.com/dead-by-daylight/nicolas-cage-reveal-summer-game-fest-2023\">Nicolas Cage wants to \"fuse\" with you in new Dead by Daylight gameplay</a> <a href=\"https://www.theloadout.com/dead-by-daylight/nicolas-cage-dlc-teaser\">National treasure Nicolas Cage is really coming to Dead By Daylight</a> <a href=\"https://www.theloadout.com/dead-by-daylight/want-lady-dimitrescu-killer\">Dead By Daylight devs want Lady Dimitrescu in-game as much as you do</a> ",
                "feedlabel": "The Loadout",
                "date": 1698235597,
                "feedname": "The Loadout",
                "feed_type": 0,
                "appid": 381210
            },
            {
                "gid": "5218041989061720076",
                "title": "Steam Global Top Sellers for week of 17 Oct — 24 October 2023",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/SteamDB/5218041989061720076",
                "is_external_url": true,
                "author": "SteamDB",
                "contents": "<a href=\"https://steamdb.info/topsellers/2023W43/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\"> </a> * <a href=\"https://steamdb.info/app/949230/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">Cities: Skylines II</a>; * <a href=\"https://steamdb.info/app/2195250/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">EA SPORTS FC™ 24</a>; * <a href=\"https://steamdb.info/app/1086940/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">Baldur's Gate 3</a>; * <a href=\"https://steamdb.info/app/1938090/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">Call of Duty®</a>; * <a href=\"https://steamdb.info/app/2344520/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">Diablo® IV</a>; * <a href=\"https://steamdb.info/app/2252570/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">Football Manager 2024</a>; * <a href=\"https://steamdb.info/app/1517290/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">Battlefield™ 2042</a>; * <a href=\"https://steamdb.info/app/227300/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">Euro Truck Simulator 2</a>; * <a href=\"https://steamdb.info/app/1675200/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">Steam Deck</a>; * <a href=\"https://steamdb.info/app/381210/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">Dead by Daylight</a>; <i>* excluding free to play games</i> <a href=\"https://steamdb.info/topsellers/2023W43/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">View top 100 on SteamDB</a>",
                "feedlabel": "SteamDB",
                "date": 1698163200,
                "feedname": "SteamDB",
                "feed_type": 0,
                "appid": 227300
            },
            {
                "gid": "5218041989040587690",
                "title": "Snag some of 2023's new horror games for dirt cheap",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/PCGamesN/5218041989040587690",
                "is_external_url": true,
                "author": "editor@pcgamesn.com",
                "contents": "<strong>Dead Island 2</strong> is making waves among its nostalgic community once more thanks to its upcoming lore-filled expansion, Haus. If you're like me, then you grew up playing the original and immediately jumped into Dambuster Studios' recent sequel. The zombie shooter does sport a hefty price, though, as new horror games generally do. If you've been waiting for a discount to grab it, the Epic Games Store's annual Halloween sale is here with massive deals for games like Dead Island 2 and other banger sequels such as Gunfire Games' own Remnant II. <a href=\"https://www.pcgamesn.com/dead-island-2/epic-halloween-sale\">Read the rest of the story...</a> RELATED LINKS: <a href=\"https://www.pcgamesn.com/dead-by-daylight/dbd-codes\">DBD codes October 2023</a> <a href=\"https://www.pcgamesn.com/dead-by-daylight/dbd-haunted-by-daylight\">DBD Haunted by Daylight 2023 start time, rewards, and details</a> <a href=\"https://www.pcgamesn.com/dead-by-daylight/update-buffs-worst-killer\">Forget face-camping, Dead by Daylight update buffs its worst killer</a> ",
                "feedlabel": "PCGamesN",
                "date": 1697672527,
                "feedname": "PCGamesN",
                "feed_type": 0,
                "appid": 381210
            },
            {
                "gid": "5218041989039507883",
                "title": "Update 7.3.1 | Bugfix Patch",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5218041989039507883",
                "is_external_url": true,
                "author": "dance_BHVR",
                "contents": "{STEAM_CLAN_IMAGE}/11814497/bf5c99fdca9a09acc8c9b91b1306545021cdf200.jpg Release Schedule Update releases: 11AM ET \"Haunted by Daylight\" Halloween event starts: 2PM ET \"Haunted by Daylight\" Halloween tome opens: 2PM ET Content The Trapper The Trapper's Bear Traps now spawn close to each Generator at the beginning of a Trial. The Skull Merchant Added unique prompts to differentiate which direction a Drone will rotate in. Haunted by Daylight \"Haunted by Daylight\" Halloween event (starts October 18th 2PM ET). The Archives \"Haunted by Daylight\" Halloween event tome (opens October 18th 2PM ET). Event Gameplay Details screen The event popup has a new tab where you can view details of the event gameplay. Event Currency Haunted by Daylight introduces a new reward, Dark Trinkets, an exclusive currency for Halloween events. Dark Trinkets are earned by completing challenges and levels within the Haunted by Daylight event tome. Spend Dark Trinkets on cosmetics and charms within the event's Collection screen. Collection Milestone Rewards Milestone Rewards are a set of rewards that you unlock simply by unlocking event collection rewards. Earn all event cosmetics to unlock them all! Bug Fixes Archives Fixed an issue where the \"Falling Darkness\" Master Challenge can be completed after the first activation of the Nightfall. Fixed a visual issue when playing animatics on screen with an aspect ratio other then 16:9. All skill check related Challenges and Master Challenges no longer gain progress while wiggling out of the Killer's grasp. Anti Face-camp The anti face-camp UI is no longer visible when the last Survivor alive is hooked. The anti face-camp meter is now colored when filling up. Hooked Survivors no longer count when calculating the rate at which the anti face-camp meter fills up. The audio cue when the anti face-camp meter is full properly plays for spectators. The Struggle skill checks will now properly show up when the Unhook Self interaction is started during a Struggle skill check and then stopped midway. Fixed an issue that caused the anti face-face camp feature to not fill the meter when the Killer was standing above certain basements. Fixed an issue that caused the anti face-face camp meter to stop filling when the Killer was slightly higher than the hooked Survivor. Audio Fixed an issue that caused the anti face-camp to not have an audio cue when the meter is filled while spectating. Fixed an issue that caused the found match SFX to not being played. Bots Bots now avoid short loops created by a one-way ramp. Characters Fixed an issue that caused a placeholder string to appear when The Skull Merchant targets a Drone to change its rotation direction. Fixed various localization issues in various Skull Merchant Add-ons. Fixed an issue with The Skull Merchant Geographical Readout Add-on to prevent the Add-on stacking with itself and removed the kill switch allowing the Add-on to be selected again. Fixed an issue that prevented Survivors from playing the correct animation when using Blast Mine or Wiretap on a Generator. Fixed an issue that caused the Drone to be missing in The Skull Merchant's hand when using Killer Power. Fixed an issue that caused The Demogorgon's hand to clip into the Killer's camera view while carrying a Survivor and looking down. Survivors can no longer instantly free trapped allies from The Trapper’s Bear Trap when it is placed on a staircase. Skull Merchant Drones recalled when rotating counter-clockwise now rotate clockwise when placed again. EDIT: Fixed an issue that caused The Cenobite to be unable to use his Killer Power after solving the Lament Configuration. Environment/Maps Fixed an issue that caused players to be able to climb a vault, instead of jumping on it, on the Nostromo's wreckage. Perks Fixed an issue that caused the perk Background Player to activate when performing rushed actions without moving. Platforms Friends from other platforms are now correctly visible in the Friends Menu. UI In the Archives, the \"Unlock Tiers\" functionality was still accessible by Gamepad even if the button was not visible. Fixed an issue when collecting a mystery box as the last node didn't reveal the mystery item collected. Fixed a rare issue in the Lobby where the player's wallet could be seen duplicated. Fixed an issue with the Match Found SFX not playing anymore. The day and night cycle is now visible on the Survivor portraits when playing as The Dredge. Misc Fixed an issue that caused missing a Brand New Part skill check to disable Generator passive regression. Fixed older Event Cosmetics (such as Frosty Eyes) missing from players' inventories. Known Issues When The Oni goes through an open Unstable Rift teleporter, parts of its character model will become visible and clip through the camera. When completing a Trial as either Survivor or Killer the tally screen does not show the expected result. ",
                "feedlabel": "Community Announcements",
                "date": 1697639501,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 381210,
                "tags": [
                    "patchnotes",
                    "mod_reviewed",
                    "ModAct_1400956464_1697639710_0",
                    "ModAct_1400956464_1697640848_4",
                    "ModAct_1400956464_1697643447_4",
                    "mod_require_rereview"
                ]
            },
            {
                "gid": "6438516944125246256",
                "title": "Dead by Daylight’s Haunted By Daylight Event Returns!",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/6438516944125246256",
                "is_external_url": true,
                "author": "ThomasBHVR",
                "contents": "It’s time to celebrate Halloween in Dead by Daylight with the spookiest Event of the year. In case you missed our recent Livestream, we’ve got you covered with this complete guide to all things Haunted by Daylight. Atmosphere To Die For From October 18th, 2:00 PM ET – November 6th, 2:00 PM ET, Haunted by Daylight will take over the Entity’s Realm, tainting it with the mysterious presence of the Void Realm. Not only that, but familiar sights like Generators and Hooks will also undergo a spooky transformation. The Bloodweb will also see the return of the Will O' Wisp Flashlight, the All Hallows' Eve Lunchbox Med-Kit, the Blight Serum, and the Arcane Dowsing Rod Bloodpoint Offering. {STEAM_CLAN_IMAGE}/11814497/c69f8abeb1dff6c38d0b34173cb34c6e5daee2a2.jpg The Void Beckons This year marks the arrival of the Void Realm, a terrifying Realm created by The Entity as a wasteland for its discarded...playthings. For the first time, the Void Realm is explorable, and its presence will have an immediate impact on Trials for both Killer and Survivor. So how does it all come together on the gameplay side? {STEAM_CLAN_IMAGE}/11814497/a34b933ef727d9fa06a0976f81d5ee413c1b399c.jpg Collect Void Energy Like last year, players must complete specific objectives to collect Void Energy: Survivor Repairing Halloween Generators Stunning a Killer carrying Void Energy Destroying a Pumpkin Killer Hooking Survivors on Halloween Hooks Downing a Survivor carrying Void Energy Destroying a Pumpkin {STEAM_CLAN_IMAGE}/11814497/301dbac9503aaf480be65ddd1870378166efb290.jpg {STEAM_CLAN_IMAGE}/11814497/74ad337b2b6c514b02da165025985065484db23f.jpg {STEAM_CLAN_IMAGE}/11814497/0619ead5e27b58f038b527e0ad4aa8b0e48552a5.jpg {STEAM_CLAN_IMAGE}/11814497/9598eefafd96d7e560c3e4c3f59de3627d0003c4.jpg They can also collect Void Orbs, which float toward the player when approached. After sufficient Void Energy has been collected, seek out one of four Unstable Rifts to deposit your haul and activate that Rift. Once enough collective Void Energy has been deposited across all Unstable Rifts, all Rifts will become portals to the Void Realm, which you will be free to enter. Entering The Void When you step into the Void Realm, don’t be alarmed. Okay, you can be somewhat alarmed. Killers will be Undetectable while in the Void Realm, but they will not be able to use their Powers. At the same time, Survivors will be Exhausted and Broken (if already injured or injured in The Void Realm). You won’t find any Generators, Pallets, Lockers, Chests, or Totems in the Void Realm. There are Hooks, but when a Survivor is placed on one, they will instantly be transported to a Hook on the Map. There are ghostly figures called Haunts, the spirits of all those drained and discarded by The Entity. Provide them with 12 Void Energy to Capture them and release them from the Void and into the Map. Note that The Void will close a) 2 minutes after spawning, or b) once all available Haunts have been released. {STEAM_CLAN_IMAGE}/11814497/9c09832993e0512432bc1fbee4d5a948834a6121.jpg HAUNT-ed By Daylight Once a Haunt has been released, their Aura is revealed. From there, it can impact players in various ways, acting as either a boon or a trap. For Survivors who complete the Release they will immediately gain a boost for a brief duration, consisting of Haste, Endurance, and 20% faster Action Speed. Their held Item will also be refilled to 50%. For Killers who completed the Release, they will also immediately gain a boost for a brief duration, consisting of Haste, Undetectable, and 20% faster Action and Cooldown speed. If a Survivor approaches a Haunt Released by a Survivor, they will briefly receive the Haste speed boost. If a Killer approaches a Haunt Released by a Survivor, they will briefly become Hindered. If a Killer approaches a Haunt they have Released, they will receive a brief Haste speed boost. If a Survivor approaches a Haunt Released by a Killer, their camera will lock onto the Haunt (similar to a Hag’s Phantasm Trap), and they’ll temporarily become Hindered. Pumpkin Time It wouldn’t be Halloween without a few Pumpkins scattered around the Map. As is tradition, destroying a Pumpkin will lead to one of three outcomes: the Haste Status Effect, the Hindered Status Effect, or nothing at all. Event Tome + Halloween Rewards It wouldn’t be Halloween without treats, and we’ve got you covered with plenty of earnable rewards to unlock . This year, you’ll be able to earn Dark Trinkets by completing challenges in the Haunted by Daylight Event Tome, which can then be used to purchase Haunted by Daylight Cosmetics for both Killer and Survivor: Survivor Skeleton Shirts: Nea Karlsson – Painted Skeleton Shirt Kate Denson – Musical Rib-Cage Shirt Yui Kimura – Bone Handlebar Shirt Mikaela Reid – Celestial Skeleton Shirt Haddie Kaur – Card Reader Shirt Vittorio Toscano – Carved Bones Shirt {STEAM_CLAN_IMAGE}/11814497/d02d8b0e74374b44832f081fdc2225a6692ae405.jpg {STEAM_CLAN_IMAGE}/11814497/e810a19f13c63388c0fb21be05444b1157795c6b.jpg Killer Candy Weapons: The Wraith – Sweet Blade The Huntress – Jaw Slasher The Legion – Syrupy Knife The Deathslinger – Chocolate Spike The Dredge – Chewing Blade The Skull Merchant – Candy Breaker Blade {STEAM_CLAN_IMAGE}/11814497/763fc21da71afb0975408584775995efc66bffe8.jpg {STEAM_CLAN_IMAGE}/11814497/2ef5b1e2afdae742f7d904d2e4d2bffabf5b6297.jpg In addition, Cosmetics and Charms can also be unlocked by completing the Event Tome, including several pieces of a new Outfit for The Knight and Meg Thomas: Outfits The Knight – Jack O'Lantern (BODY + WEAPON) Meg Thomas – Candy Night (TORSO + LEGS) {STEAM_CLAN_IMAGE}/11814497/1ee6bbae0947525fcc859f72cf5cb94aed687506.jpg Charms Void Pumpkin Buried Candy Little Scoundrel Little Sweetie Scarecrow Jake Huntress Werewolf {STEAM_CLAN_IMAGE}/11814497/7cc26c42e914b619110be9903129e065ff25a52e.jpg This Event also features several Milestone Rewards, which can only be earned after unlocking enough Cosmetics. This includes the final pieces of The Knight’s Jack Lantern and Meg Thomas’ Candy Night Outfits . Here are their unlock requirements: Milestone Rewards: Void Pumpkin - Charm – Unlock 6 Cosmetics Meg Thomas – Smoky Eyes (HEAD) – Unlock 12 Cosmetics The Knight – Burning Sight (HEAD) – Unlock 21 Cosmetics It will also be easier to keep track of which Rewards remain, with an easy-to-follow tab in the Store & Collection screen. Don’t worry – any leftover Dark Trinkets will be converted into Bloodpoints when the Event wraps up. Seasonal Collections Halloween is all about choosing the right costume, and we’re bringing out several terrifying Collections for the occasion, including a few returning seasonal favorites. On October 18th, head to the in-game store and check out the Tricks And Treats Collection and The Void Collection, followed by the Hallowed Blight Collection on October 24th. We’re also bringing back all previous Halloween Collections for a limited time, so don’t miss out! Stay tuned for upcoming blogposts detailing all the new Collections when they drop! Please note that the Tricks And Treats Collection and Void Collection will be available for a limited time until November 6th. {STEAM_CLAN_IMAGE}/11814497/033d50805879d84bb1ac067c38eb62379d9c8a2d.jpg {STEAM_CLAN_IMAGE}/11814497/a41e2085c68b80e328973fce304085ce7ba6d71a.jpg {STEAM_CLAN_IMAGE}/11814497/28d58361575d33704e4da1f02a2f1fdc196fdf72.jpg Twitch Drops At long last, Twitch Drops are coming! We’ll be giving away some great stuff, and all you have to do is register your account and watch participating Dead by Daylight streams on Twitch. Stay tuned for more details on how to connect your account and earn your rewards, but in the meantime – here's what you can get between Oct 13th and November 6th. Hatch Micro Playset Charm: Watch 1 hour of a participating live channel Elodie Rakoto – Eyed Ribcage Shirt: Watch 2 hours of a participating live channel The Hag – Sugar Claw: Watch 3 hours of a participating live channel {STEAM_CLAN_IMAGE}/11814497/4fbb283ba92ea2ec8ef5db6da8dca45293de7262.jpg Experience the thrilling terror of Halloween with Dead by Daylight’s Haunted by Daylight Event. We’d like to thank you for spending time with us in The Fog, and be sure to unlock those rewards, Capture as many Haunts as you can, and brave the unknown mysteries of the Void Realm. See you in The Fog, The Dead by Daylight Team",
                "feedlabel": "Community Announcements",
                "date": 1697228591,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 381210,
                "tags": [
                    "workshop",
                    "mod_reviewed",
                    "ModAct_873083815_1697229721_0",
                    "mod_require_rereview"
                ]
            },
            {
                "gid": "5246188851834632526",
                "title": "TOME 17: COMMITMENT of The Archives is now available!",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5246188851834632526",
                "is_external_url": true,
                "author": "ThomasBHVR",
                "contents": "Uncover lost memories for The Oni, Feng Min, and the House of Arkham. Progress through the Rift and beyond, completing brand-new gameplay Challenges and earning toy-themed Cosmetic rewards for The Oni, Feng Min, The Dredge, Adam Francis, and more. It’s all waiting in The Archives. NEW MEMORIES The dark taint of dishonour seeps into the soil. Before he was The Oni, he was Kazan Yamaoka, a fearsome warrior of unmatched brutality. And what happens when the game is over? For Feng Min, caught between competitive e-sports and familial responsibilities, the answer is shrouded in haze. Finally, continue the saga of the House of Arkham, plunging ever deeper into the strange and magnificent horrors of the unknown. NEW OUTFITS Whether Killer or Survivor, all are The Entity’s playthings. Tome 17: COMMITMENT takes a mischievous turn into a truly terrifying toy chest. Open it to find a disturbing Daruma doll, a stylish toy collector, a trusty game shop employee, a competitive e-sports icon, and an unsettling amalgamation of forgotten playthings. Progress through the Premium Rift Track to unlock Outfits for The Oni, Feng Min, Adam Francis, Dwight Fairfield, The Dredge, The Clown, and Dwight Fairfield. Continue into the Deep Rift to unlock Rift-exclusive rewards for all who progress beyond Tier 70. Those who traverse the Free Track will be rewarded with a total of 500K Bloodpoints, which ensures that every Tier will earn players a new reward. In addition, the Free Track also yields unlockable Cosmetics for Claudette Morel, Ace Visconti, Yun-Jin Lee, and The Hillbilly. NEW CHALLENGES Complete Challenges to progress further in the Tome and its associated Rift. Tomes are separated into several Levels, each containing a new layout for the Auris Web with more challenges, lore entries, Bloodpoints, and Rift Fragments. Try your hand at mastering The Oni, Feng Min and their respective Perks with character-specific gameplay Challenges. GAMEPLAY UPDATES An Anti-face-camping system. A Skull Merchant rework. Updates to The Trapper, The Huntress, The Trickster, The Deathslinger, and The Legion. Changes to The Shattered Square and the Macmillan Estate. Perk balance adjustments. For more information on all gameplay related updates, check out our official Patch Notes right here. The stories of The Oni, Feng Min, and more are waiting to be uncovered. We hope you enjoy discovering everything Tome 17: COMMITMENT has to offer. See you in The Fog... The Dead by Daylight team ",
                "feedlabel": "Community Announcements",
                "date": 1697037029,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 381210,
                "tags": [
                    "workshop"
                ]
            },
            {
                "gid": "5220292521199080611",
                "title": "Update 7.3.0 | Mid-Chapter",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5220292521199080611",
                "is_external_url": true,
                "author": "dance_BHVR",
                "contents": "{STEAM_CLAN_IMAGE}/11814497/e48f60ee44428581089243928b58320765a11eae.jpg Release Information Update releases: October 10, 11AM ET Tome 17 opens: October 11, 11AM ET {STEAM_CLAN_IMAGE}/11814497/9c515cdbef74cf17e4f0e9c522be511b880f4735.png Content Killer Perk Updates Furtive Chase You become obsessed with one Survivor. You lurk in the shadows, eliminating your victims one by one. When your Obsession is hooked, gain Undetectable and a 5% Haste status effect for 14/16/18 seconds. (new functionality) Survivor Perk Updates Background Player When the Killer picks-up another Survivor, Background Player activates for 10 seconds. When you start running, break into a sprint at 200% of your normal Running Movement speed for 5 seconds. (was 150% for 4 seconds) This perk cannot be used while suffering from Exhaustion. This perk causes exhaustion for 60/50/40 seconds. Updated Killer: The Skull Merchant Eyes in the Sky The Skull Merchant begins the match with six Drones. Press the Power button to deploy a Drone, which conducts an invisible, continuous sweeping scan. If a Survivor is detected, the Drone becomes active, which makes the Drone’s scan lines visible. Once detected by a scan line, a Survivor gains scan immunity and cannot be detected by other scan lines for 3 seconds. Survivors can attempt to hack Drones. Failure activates the Drone and partially fills their Lock On meter; Success disables the Drone for 45 seconds. Removed the Active Zone (cylinder). Removed remote Activation of Drones. The Killer now starts with 6 drones. The minimum distance between drones is now 16 meters. The Drone radius is now 10 meters. Radar Press the Ability Button to open a Radar to see the locations of Survivors detected by Drones or those with Claw Traps. Each Survivor detected on the Radar increases The Skull Merchant’s movement speed. The Radar can also recall drones or change the direction of their scan rotation. Lock On The Lock On meter fills when scanned by a Drone and when failing to disable a Drone. When the meter is full, the Survivor receives a Claw Trap, becomes Injured, and suffers from the Broken status effect. Additional scans briefly apply the Hindered status effect. A Claw Trap broadcasts the Survivor’s location to the Killer and is only removed when its battery dies. Removed the Exposed status effect from Lock On. Add-Ons Adi Valente #1: Effects last until the Claw Trap is removed. High-Power Floodlight: Blindness status applied when receiving a Claw Trap. Effects last until the Claw Trap is removed. Geographical Readout: Increased action speed bonus while breaking pallets and breakable walls, damaging generators, and vaulting to 20% (up from 15%). The effect is now applied for 8 seconds after deploying a drone. High Current Upgrade: Increases the time Survivors appear on the radar when detected. Adaptive Lighting: Reduced the bonus granted to Undetectable status to 20% (down from 50%). Stereo Remote Mic: Decreases the Disabled State duration of drones. Supercharge: Increased battery life of Claw Traps to 15% (up from 12%). Shotgun Speakers: Survivors with a Claw Trap have no skill check warning. Effects last until the Claw Trap is removed. Low-Power Mode: Decreases Drone Spawn Cooldown. Vital Targeting Processor: Increases Hindered status by 3% when a Survivor is detected by a drone. Brown Noise Generator: Oblivious status applied when receiving a Claw Trap. Effects last until the Claw Trap is removed. Loose Screw: Exhausted status applied when receiving a Claw Trap. Effects last 6 seconds (up from 3 seconds). Randomised Strobes: Increases Hindered status by 1 second when a Survivor is detected by a drone. Advanced Movement Prediction: Reveals Survivor’s aura when they receive a Claw Trap. Ultrasonic Speaker (formerly, “Ultrasonic Trap Speaker”): Decreases scan immunity duration. Expired Batteries: Decreases Claw Trap battery life (50%, instead of 60%). Increases Haste status granted when Survivors are detected on the radar. Prototype Rotor: Increases drone rotation speed. Iridescent Unpublished Manuscript: When a drone is disabled, the drone gains a 32m terror radius for 15 seconds. During this time, The Skull Merchant gains the Undetectable status effect. Other Daily rituals, Achievements, Loading Tips, and Score Events have been updated accordingly. Updated Killer: The Trapper When setting a Bear-Trap, The Trapper gets a Haste effect of 7.5% for 5 seconds (new effect). The Coffee Grounds Addon has been updated to indicate it is an additional Haste effect. When the Trial begins, 8 Bear-Traps spawn on the map (was 6). Other Killer Tweaks Huntress Reloading hatchets takes 3 seconds (was 4 seconds). Deathslinger Reloading takes 2.6 seconds (was 2.75 seconds) Addon: Warden's Keys - Decreases the Speargun's reload time by 0.35 seconds (was 0.5 seconds) Addon: Jaw Smasher - Increases movement speed by 1.5% while aiming down the Speargun's sights (was 1%). Addon: Wanted Poster - Increases movement speed by 3% while aiming down the Speargun's sights (was 2.5%). Legion Addon: BFFs - Earn tokens for hitting Survivors during Feral Frenzy: Second chained hit: 2 tokens. Third chained hit: 3 tokens. Fourth chained hit: 4 tokens. Fifth chained hit: 5 tokens. Once the gates are powered, if more than 15 or more tokens have been collected, gain a 6% movement speed boost when not using Feral Frenzy (was 4%). Trickster Reloading knives takes 3 seconds (was 4 seconds). Anti Face-Camp Feature Survivors on the hook have an internal \"camp meter\" which fills when the Killer is nearby. The meter fills faster the closer the Killer is, but is slower when other Survivors are near (never becomes negative). Once the meter is full, the Survivor gets a prompt allowing them to escape the hook with 100% probability. Survivors who take this action gain Endurance for 15 seconds. This feature shuts off entirely once the Exit Gates are powered. As part of this system, the Cannibal can no longer hit a Survivor who has Endurance twice in the same 0.5 second timespan. Map Updates Shattered Square Map Update The Shattered Square Map received a lot of comments at release. Some issues were related to the objects being low to the ground and hard to see, especially when it came to Killers that are navigating with a first person camera. We did a clean up and made sure that the loops feel smoother. There were also inconsistencies with our visual and navigation language. Objects were placed in a way that it felt possible to simply climb, because of similar angles to stairs or slopes found in other maps. This was resolved by taking away some of the objects or placing assets that match the collisions. The line of sight was very low and gave the ability for players to see across the map. A clear line of sight can be detrimental for both roles depending of the play style. We have changed the positioning of tiles with higher line of sight blockers to be more predominent. The size of the Map was large and we decided to reduce the size to encourage encounters, make it more dynamic and reduce the time to find interactables (generators, hooks, totems, chest, etc.) MacMillan Estate Realm Update The Maps of the MacMillan Estate Realm have been in the game for about 7 years. The layouts and other information have been available within the community for a while, but The Entity reminded us to give players a chaotic experience. Therefore, we are adding new variations of the MacMillan Estate Realm maps to the existing pool. Features Bots Improvements Reworked the Bots Skill Check system: Success rates now correlate with Skill Check size. Skill Check debuffs, such as The Doctor's Madness or Hex: Huntress Lullaby, reduce the odds of hitting the Skill Check. Bug Fixes Archives Fixed an issue that prevented several challenges that have to be completed in the Basement from gaining progress. Fixed an issue that allowed the Deadly Senses and You Can’t Hide Challenges to gain progress when hitting a survivor with a Killer’s Special Attack. Fixed an issue where the \"Destructive Investigation\" Master Challenge from Tome 16 - EXISTENCE was awarding the incorrect amount of Bloodpoints. Updated the description of the \"I Want It, I Got It\" Master Challenge from Tome 15 - ASCENSION to reflect the update to The Skull Merchant's gameplay changes. Updated the \"Outplayed\" challenge from Tome 16 - EXISTENCE to allow progress from The Dredge to grab a Survivor from a locker they just teleported to. Fixed an issue where the \"Job Well Done\" challenge from Tome 15 - ASCENSION erroneously awarded progress from another Survivor's finished generator repair action. Fixed an issue where the \"Back Off!\" Master Challenge and other similar challenges did not award progress from the stun inflicted after successfully wiggling out of the Killer's grasp. Fixed an issue where the \"Back Off!\" Master Challenge did not correctly display the Player's progress. Fixed an issue where the \"Swarm of Darkness\" Master Challenge did not correctly display the Player's progress. Fixed an issue where the \"Cellar Search\" Master Challenge did not award progress from the chest in the Killer's basement. \"Remix\" challenges no longer prevent the selection of random Perks on consecutive Trials on the same character. Audio Fixed an issue that caused the Hooked On You music not being played on Trickster's Paradise Beatdown outfit. Fixed an issue where the French voice didn't match the text in Tome 15 \"The Absolutely Horrifying Maniacal Puppet Show. Guest Starring, Ashy Slashy. 2.\" Entry. Fixed an issue that prevented The Xenomorph to hear Generators while in Tunnels. Bots Bots can now attempt to self-unhook. Bots now break a stare-down with the Killer earlier when standing still on opposite sides of a Remote Flame Turret. Bots now try to look for potential Killer approach paths when doing long interactions, taking breaks from turning the camera slowly around. Characters Fixed an issue that caused any Survivors grabbed by the Trapper while vaulting towards him to be seen clipping into the ground. Fixed an issue that caused The Doctor to able to see inside of Lockers by walking into them. Fixed an issue that caused survivor Yun-Jin Lee's Tome 17 'Smart Outfit' arm to break when using a flashlight. Fixed an issue that caused the Camera to clips through Wraith's 'Saber-Toothed' weapon after hitting a survivor. Fixed an issue that cause the camera not to transition properly when using the Cenobite’s Summons of Pain. Fixed an issue causing The Xenomorph's tail attack to be able to hit Survivors behind it Fixed an issue causing The Xenomorph's tail attack animation not to match the collision Environment/Maps Fixed an issue in Lery's Hospital where the side of a generator was blocked by assets Fixed an issue in Pale Rose where a groups of blockers were too close and prevented possible navigation between them Perks Fixed an issue that caused the Territorial Imperative perk not to activate when a Survivor enters the basement. Fixed an issue that caused the Pain Resonance Perk to be able to explode a Generator blocked by the Deadlock Perk. Fixed an issue that caused the Blood Pact Perk’s icon to appear dimmed when the Haste effect is active. Platforms Fixed a crash on Nintendo Switch that could happen when interacting with the Friends menu. UI For consoles, the Loadout search bar virtual keyboard now appears in the player's selected language rather than English. In the Store UI, exclamation marks for content in a new DLC will now correctly disappear on viewing that content. The name of the character properly changes when changing to a preset with a Legendary outfit equipped. Wait for mystery box animation to complete before advancing Bloodweb to next level. Misc Equipped Charms are now always visible on the displayed character in the Store. Fixed an issue that caused the Flame Turret’s light to remain visible while vaulting. EDITED: Fixed a bug that resulted in a different distance achieved between male and female Survivors during fast vaults. Public Test Build (PTB) Adjustments Bots Bots no longer pick up Items with nearly no charges remaining. Fixed a crash that could occur when playing with a Bot having the Reassurance Perk. Fixed one vault location on the Nostromo Wreckage that Bots were unable to use. Skull Merchant Update Increased Drone rotation speed while in Stealth mode from 50 degrees/sec to 60 degrees/sec. Increased Drone rotation speed while in Scouting mode from 75 degrees/sec to 85 degrees/sec. Increased Drone detection radius from 8 to 10 meters. Decreased Drone initialization time from 1.5 to 0.3 seconds. Recalling Drones no longer puts the power on cooldown. Recalling Drones is available at all times, regardless of the cooldown. Added the ability to change a Drone's rotation direction while using the Radar. Drones always deploy facing away from you and only rotate after the initialization phase is over. The Randomized Stobes Add-On properly increases the duration of the Hindered status by 1 second. The Adi Valente #1 Add-On properly reduces skill checks by 20% and not 50%. Anti Face-Camp Feature Added 7 second grace period for the Killer to be able to leave the area before the system kicks in. Carrying a Survivor in the radius stops the progress bar from building up. Dying Survivors in the radius slow down the progress bar. Vertical distances are now treated differently to avoid unintentionally triggering the system through floors. Perk Updates Furtive Chase Changed functionality: when hooking the Obsession, gain Undetectable and a 5% Haste status effect for 14/16/18 seconds. Background Player Increased sprint speed to 200%. Sprint Burst no longer triggers at the same time as the Background Player Perk. Shattered Square Map Update Reviewed loops that were noted as too strong and reduced the number of pallets spawning in the map. Misc Fixed a crash that could occur in the Splash Screen. The Sacrificial Ward Offering no longer disables Map Repeat Prevention. The Shape’s arm no longer stretches during the standing Mori from the Survivor’s perspective. ",
                "feedlabel": "Community Announcements",
                "date": 1696948308,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 381210,
                "tags": [
                    "mod_reviewed",
                    "ModAct_873083815_1696949526_0",
                    "ModAct_873083815_1696951818_4",
                    "mod_require_rereview"
                ]
            },
            {
                "gid": "5220292521180780417",
                "title": "Developer Update | October 2023",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5220292521180780417",
                "is_external_url": true,
                "author": "dance_BHVR",
                "contents": "Greetings ghosts and ghouls! We’re back with another Developer Update, this time covering all the adjustments on the way following our last Public Test Build (PTB). We unveiled some major changes during this PTB, including the new Anti Face-Camping mechanic and an overhaul to The Skull Merchant’s Power. You’ve left us with plenty of feedback to go through, and we’d like to share a few tweaks we’ll be making when this update goes live (and a few more in the minor patches that follow)! {STEAM_CLAN_IMAGE}/11814497/1a83c12b3924ba42b74a92f1f35a0b329a902a84.png The Skull Merchant With the overhaul on the PTB, we set our sights on the frustrating strategies that emerged due to how The Skull Merchant’s Power worked. While we’re pleased to see that she was no longer a gen-defending powerhouse, we noticed many felt that she was left in a weaker state. The intent of this update is not to weaken this Killer overall, so we’ll be making a series of adjustments to address some of the feedback we received. Scanning During the PTB, many Killers reported having difficulties scanning Survivors with their drones, making the frequency of Lock On lower than we’d like. To ensure that her Eyes in the Sky are a truly tools of torment (sorry), we have a series of changes in store. First, we noticed that because drones always rotated clockwise, it was far less likely that Survivors would be scanned if they were also running a loop clockwise since the beams would cross their path less often. This is most noticeable on tiles which Survivors ideally want to run in a clockwise direction anyway to line themselves up for a fast vault. To remedy this, The Skull Merchant can now toggle the direction her drones rotate while using her radar. This way, you can swap directions to force the beam to cross a Survivor’s path more often. Experienced Killers who know the best ways to run certain tiles will also be able to pre-emptively choose the best direction for the loop they’ve deployed their drone in. Second, some found drone management to be a little stressful, largely since recalling a drone would put your Power on cooldown. This forced the Killer to rush to recall drones that are no longer needed whenever they had a moment of downtime so their Power was ready for their next chase. To address this, drones can now be recalled at any time and recalling a drone no longer incurs a cooldown. Eyes in the Sky Third, we’ve made a series of smaller adjustments to make it harder for Survivors to cross through a drone’s effective area without being scanned: Increased the drone’s radius to 10m (was 8m). Increased the drone’s rotation speed in Stealth Mode to 60 degrees per second (was 50). Increased the drone’s rotation speed in Scouting Mode to 85 degrees per second (was 75). Lastly, to give The Skull Merchant more control when deploying a drone, the drone’s beams now face directly in front and behind her by default, allowing skilled Killers to scan Survivors as soon as they’re deployed. We have also decreased the drone’s initialization time to 0.3 seconds (was 1.5 seconds) so they activate more quickly and feel more responsive. Combined, these changes will make The Skull Merchant feel better to play and more consistent now that her drones can’t be used to defend generators. {STEAM_CLAN_IMAGE}/11814497/5dfb4bbe85fff2d79a526b2985f6523bc8788ad7.png Anti Face-camping Anti Face-camping is here- and so is the Killer. This mechanic aims to provide Survivors with counterplay for some of the most egregious cases of camping. From what we observed on the PTB, the system seems to come to the rescue when needed most, though we’ll of course continue monitoring and make adjustments as needed. However, there were a few rough edges which we’re looking to refine before this goes live. Grace Period One of the most common critiques of this mechanic comes from the way the meter immediately starts to fill before the Killer could possibly walk away. Although this alone wouldn’t cause Survivors to free themselves, this understandably feels as if the game is wrongly treating you as if you’re camping. There will now be a 7 second grace period before the meter starts filling after hooking a Survivor. This will give the Killer an opportunity to walk away before the system kicks in, with a little wiggle room to kick a nearby generator or reload at a locker. Dying & Carried Survivors During the PTB, dying and carried Survivors did not influence the fill rate of the meter. The former led to some awkward scenarios where a dying Survivor with a Perk that allowed them to pick themselves up could force the Killer to stay nearby, while the latter both exacerbated that strategy as well as punishing the Killer for hooking multiple Survivors in the basement. Therefore, dying will slow the meter (as though they were standing) so long as they are in the area, and carried Survivors now pause the progress bar completely. Verticality When this feature was tested on the PTB, it treated both horizontal and vertical distances equally. However, this had a side effect of detecting Killers on different floors as camping even if the shortest path to the hooked Survivor was rather long. This was especially noticeable on indoor maps such as The Game. In a later update, the meter will be weighted more heavily toward horizontal distance than vertical. This will make the meter a little more forgiving if the Killer passes by on another floor. {STEAM_CLAN_IMAGE}/11814497/7dc1d47b29c20f66f8fffe2606067ed9a3db07d6.png Perk Updates We received a bunch of feedback on the two Perks which were tweaked in this past PTB, so we went back to the drawing board to deliver a new set of changes. Furtive Chase We initially increased the terror radius reduction for each token, though many still did not find this a very appealing choice. Furtive Chase will be receiving a rework when the update goes live. When hooking the Obsession, gain Undetectable and a 5% Haste status effect for 14/16/18 seconds. When the Obsession is rescued from the hook, the rescuer becomes the Obsession (unchanged). With this new version, Furtive Chase rewards the Killer for switching targets and allows them to find a new Survivor to chase more quickly after hooking. Background Player This Perk is most often used for saving teammates, allowing you to get into position quickly in key moments. However, since the Killer’s pickup animation is shorter than the Perk’s duration, it would usually be too late to save your teammate by the time the speed boost ended. Therefore, Background Player now causes you to sprint at 200% speed (was 150%) for 5 seconds (was 4 seconds) when the Killer picks up a dying Survivor. This way, Background Player will allow you to cover more distance quicker than before, potentially allowing you to get into position in time to make the save. {STEAM_CLAN_IMAGE}/11814497/2beb489433cf2f5784f7378c6385353c1a211b01.png The Trapper We were delighted to see such a positive reaction to the adjustments we made to The Trapper. As we dug through the PTB feedback, we noticed many of you found it impractical to wander so far to gather your traps at the start of the match. While The Trapper is still in the spotlight, we’ve decided to make one more change as soon as we’re able to. The Trapper’s Bear-Traps will spawn closer to generators. This way, you’ll have to stray less from your usual patrol routes than before to collect a trap. Unfortunately, we weren’t able to squeeze this change into the initial release, but this will be a part of one of the smaller patches in the coming weeks! {STEAM_CLAN_IMAGE}/11814497/1e68db44016b90397858daf0d93e2aa00b35653c.png Shattered Square Last but certainly not least, we have a few more adjustments on the way for the Shattered Square. We received some feedback regarding the strength of certain pallet loops and the number of pallets overall. For the update’s release, we have reviewed the loops in question and slightly reduced the number of pallets which spawn. {STEAM_CLAN_IMAGE}/11814497/370a6790885cffd46d0d84494d046c14bb27ca09.png And that brings us to the end of this Developer Update! We want to thank you as always for taking the time to test out the changes on the PTB. Nearly all the adjustments mentioned in this post will be available when the update releases, with the rest following in a minor patch shortly after. We look forward to hearing what you think! Until next time… The Dead by Daylight team",
                "feedlabel": "Community Announcements",
                "date": 1696514500,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 381210
            },
            {
                "gid": "5220291886506112455",
                "title": "DBD Haunted by Daylight 2023 start time, rewards, and details",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/PCGamesN/5220291886506112455",
                "is_external_url": true,
                "author": "editor@pcgamesn.com",
                "contents": "<strong>When is the DBD Haunted by Daylight event?</strong> Spooky season is here once again, and many of our favorite games hold events and celebrations to get you in the Halloween mood. Naturally, though, the best games to scare you silly are those that are already terrifying, and the <strong>Dead by Daylight Haunted by Daylight</strong> event is back to <em>Dwighten</em> you in 2023. Like Dwight and frighten, geddit? No? I tried. If you thought <a href=\"https://www.pcgamesn.com/dead-by-daylight/all-dead-by-daylight-killers-perks\">Dead by Daylight killers</a> were the worst thing waiting for you when you enter the Fog, think again... This Halloween, The Entity releases some old victims into the world to make things even harder for <a href=\"https://www.pcgamesn.com/dead-by-daylight/\">Dead by Daylight</a> survivors and killers - but they can also be used to your advantage. Read on for more details about this year's spooky DBD Haunted by Daylight event, in which you can collect some new in-game items. If that's not enough though, there are always <a href=\"https://www.pcgamesn.com/dead-by-daylight/dbd-codes\">DBD codes</a> for more goodies. <a href=\"https://www.pcgamesn.com/dead-by-daylight/dbd-haunted-by-daylight\">Read the rest of the story...</a> RELATED LINKS: <a href=\"https://www.pcgamesn.com/dead-by-daylight/dbd-codes\">DBD codes October 2023</a> <a href=\"https://www.pcgamesn.com/dead-by-daylight/update-buffs-worst-killer\">Forget face-camping, Dead by Daylight update buffs its worst killer</a> <a href=\"https://www.pcgamesn.com/dead-by-daylight/map-rework\">Dead by Daylight teases a rework of its most hated map</a> ",
                "feedlabel": "PCGamesN",
                "date": 1696356017,
                "feedname": "PCGamesN",
                "feed_type": 0,
                "appid": 381210
            }
        ],
        "count": 947
    }
}