{
    "appnews": {
        "appid": 949230,
        "newsitems": [
            {
                "gid": "5229301621579556007",
                "title": "Region Packs | Teaser Trailer | Cities: Skylines II",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5229301621579556007",
                "is_external_url": true,
                "author": "Cities: Skylines Official",
                "contents": "Covering 8 regions, with more than 2500 assets, we present the free Region Packs! We've teamed up with some of your favourite creators including Titan, Bsquicklehousen, darf, RicharcShi, MacWelshman, Badi_Dea, Feindbold, Gurny and many more, to bring you 8 Free Region Packs, coming soon to Paradox Mods! BUY Cities: Skylines II NOW! https://www.paradoxinteractive.com/games/cities-skylines-ii/about",
                "feedlabel": "Community Announcements",
                "date": 1698408021,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 949230
            },
            {
                "gid": "5229301621576266040",
                "title": "Patch Notes for 1.0.11f1",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5229301621576266040",
                "is_external_url": true,
                "author": "CO_Avanya",
                "contents": "Hi everyone. Today we have the first of several patches to improve performance in Cities: Skylines II. While this does not address all issues we are aware of, we wanted to get you these improvements as soon as possible. Unfortunately, this patch is only available on Steam today. We're doing our very best to make it available on Microsoft Store as soon as possible. This patch includes the following improvements and fixes: Changed LOD to be independent of rendering resolution to get more consistent performance with high resolutions Minor optimization with fog Depth of field optimizations and tweaks Global illumination tweaks Optimized stutters when buildings spawn/level up Optimized various stutters across all systems Fixed crash after upgrading wind turbine Fixed crash when car crashes into still hidden car with trailer Fixed crash with mesh loading (that happens with low settings mostly) Please make sure to report any crashes or bugs on our support forum here: https://forum.paradoxplaza.com/forum/forums/cities-skylines-2-bug-reports.1162/ Our team is working hard on getting the next round of fixes and improvements out as soon as possible. Thank you for your patience!",
                "feedlabel": "Community Announcements",
                "date": 1698330059,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 949230,
                "tags": [
                    "patchnotes"
                ]
            },
            {
                "gid": "5229301621571657158",
                "title": "Performance",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5229301621571657158",
                "is_external_url": true,
                "author": "CO_Avanya",
                "contents": "Cities: Skylines II is built for the future with modern hardware in mind, allowing us to add more depth and detail to the game than its predecessor had. Earlier this month, we shared a note on performance as we had not reached the benchmark target we had set for the game. Following this, we have seen some concerns about performance and what it means for the game as a whole. We’d like to give some context to the issues the game is currently facing, what we’re doing to address them, and what you can do if you are among the players experiencing performance issues. Firstly, we want to assure you that the issues are not deeply rooted in the game’s foundation, so we fully expect to be able to improve performance going forward. The issues we are currently facing are tied to the rendering of the game, and decreasing the quality of visual effects such as Depth of Field, Global Illumination, and Volumetrics will get you a fair performance without affecting simulation - at the cost of some eye candy. If you experience low FPS we recommend the following: Reduce screen resolution to 1080p Disable Depth of Field and Volumetrics Reduce Global Illumination Check the full guide for more tips WHAT HAPPENS POST-RELEASE Following the release, we intend to push a series of small patches (and likely a big one) as we significantly improve different areas of performance. We have identified some issues tied to certain hardware setups that yielded unexpected results, and following those discoveries, we're working on improvements to: Remove stutters, generally caused by some synchronization condition in the simulation. They can vary greatly from one CPU to another, as well as how your city is built. Optimize and balance GPU performances by reducing the number of vertices processed per frame and optimizing/balancing the effects that affect fillrate (mainly Depth of Field, Global Illumination, and Volumetrics), which you can turn off or reduce in the settings for the time being to get a decent FPS. Pushing any CPU optimizations that are not already done that we come across in this process. It’s worth noting that balancing GPU performances does not mean reducing quality overall but, for example, taking fewer samples with smarter distribution to achieve identical or very similar results. We are also looking at expanding the options for upscaling solutions. Right now, the game includes AMD FSR1, which does not look that good when the scale ratio is 50% (you can enable it with Dynamic resolution scale setting), but it is supported by Unity out of the box, so it made sense to include. Both FSR2 and DLSS2 require the use of Temporal Anti-aliasing, which is not possible at the moment due to some objects being incompatible with that technique. We are currently working towards making this possible, which will not only help to boost performances but also provide a better quality anti-aliasing solution than the one we currently use (SMAA by default). OUR GOALS With the upcoming patches, the situation will largely improve with default settings. It is worth mentioning that for a game like this, the performance target is to run at a steady 30FPS minimum. There is no real benefit in a city builder to aim for higher FPS (unlike a multiplayer shooter) as a growing city will inevitably become CPU-bound. What matters more with this type of game is to avoid stutters and have a responsive UI. For that reason, our simulation is also built around an expected update rate given 30fps. However, it does not hurt to get 60fps as it can contribute to better visuals in relation to temporal effects, so while our target is 30fps, we don't intend to limit or stop the optimization work just because we reach it on the recommended hardware. We just don't believe there would be a long-term benefit in setting the target to 60fps, especially because we face rendering challenges both from close-ups and far distances. A NOTE ON RELEASE TIMING While some setups on PC have challenges, we concluded the performance is not a dealbreaker for all the players. For us, the number one priority is for the players to have fun with the game, and we had seen enough feedback from players enjoying the game that it would be more unfair to postpone. We know we will keep working on the game and do our best to fix issues as fast as possible, so we wanted to respect the announced release date and allow people to start playing the game. ",
                "feedlabel": "Community Announcements",
                "date": 1698220825,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 949230
            },
            {
                "gid": "5218041989061720083",
                "title": "Cities: Skylines II peaks at 104k players",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/SteamDB/5218041989061720083",
                "is_external_url": true,
                "author": "SteamDB",
                "contents": "<a href=\"https://steamdb.info/app/949230/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\"> </a> Cities: Skylines II has peaked at 104,697 concurrent players on 24 October 2023 on release day. View charts and more statistics on our website.",
                "feedlabel": "SteamDB",
                "date": 1698169804,
                "feedname": "SteamDB",
                "feed_type": 0,
                "appid": 949230
            },
            {
                "gid": "5218041989061693974",
                "title": "Tips: Our Guide to Optimize Performance",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5218041989061693974",
                "is_external_url": true,
                "author": "Cities: Skylines Official",
                "contents": "{STEAM_CLAN_IMAGE}/43753943/67f60f94b48aeefbf9690f145905b3eba5a56af4.png Cities: Skylines II is a performance-heavy game, and with the diverse array of hardware you as a player use, you might find this guide helpful. It's important to us that everyone has access to as smooth of a gaming experience as possible, and while varying hardware may present different challenges, we're here to support and guide you through optimizing your setup for the best performance possible. Virtual Texturing​ The first point that we want to bring up is the Virtual Texturing. This is a technology that uses video memory more efficiently in regards to textures. Please wait for these textures to finish processing. During the time that the game is processing the textures, the buildings might turn dark or have some other graphical artefacts. The time it takes for your computer to render the updated textures depends on your hardware, but it usually does not take longer than a minute, usually much faster than that. https://lh7-us.googleusercontent.com/sA2UchSx7p5xSe9J11excpuAjR-K9XpI0O2tg-gSC8yXw1zipZrchlSR-zNwpDAI-o9FBELU1otvzr72_qhgok4812-F81M2dl9ey_K70I9wl2unvdgpYDgFykRx33RUkTso5JFbtn8uEGuFfh0VxN8 The processing of the Virtual Texturing will appear in the Notifications Tab on the Home Screen. Recommended Settings​ Let’s move on to the settings you are able to adjust before or during your city building. Continuous improvement of performance is our top priority, but here are our best tips to have as smooth of an experience as possible: https://lh7-us.googleusercontent.com/HLVOusg20opxxpP_87dzR9SU3R7b6W_qHD4JdNE0mpnuIRE6aFN1nqusKsSrqmwNvgOE3RvbEVRpn4k28g8cvtqDm993pwVk9IYtqjGbaT_GjCLerjeQKIqkjBwuhETPh7QQdVpW9DjBL7-bezD1uJI Lowering the Resolution; we recommend 1920 x 1080 x 60Hz Disable Depth of Field {STEAM_CLAN_IMAGE}/43753943/2488e70d3b4c40b6ea60d214cc83db907e6d9e89.jpg Disable Volumetrics; this lowers the quality of the volumetric clouds. Motion Blur, Depth of Field, and Dynamic Resolution:​ While these three will not always improve your performance, we wanted to help you understand what these settings are and hopefully help solve potential “why-does-my-game-look-like-this” questions. https://lh7-us.googleusercontent.com/xoZErILxOMiIel6qodUGiBOGH1fkl1MLRguwegFPqTVl3j1R0o26tY8kOlDt505xX5AIEB_8QPX2uJnjWf1tfdTE67RYb161f4QkgWnXKXOJhi6NurZYmPyfsPueEiQBs9chWmfm0y7v4RqTcAlD1fM Depth of Field and Motion Blur can cause the game to look very strange and motion sickness and can cause low FPS to feel worse. https://lh7-us.googleusercontent.com/PJKyHZv0N2KDirVxLjDfDYybjTgb2Nd-LlijxbmLUi_i7OGZs5BK0S63Ehntl5EdfrzluS2xl8SCnQ5jy98KH-gGN2Fy143_oEiVAgV0FIFnG3Sqeow-yBujhNtdxhfPBcxtmRGClr-c45u5eGTyH8g https://lh7-us.googleusercontent.com/aCpR8ErF6t4Bglqg49haW6FX0Wb8mQp0QmSta7_hW5TP-RJT0vlnZQAn_iukuzghQu2RJzByNcWGzmhPOH4J8W76_d3PKVUj6L3H5mFDY13hds3WziQkiC8MFIULZMdlrvOkDVTgXpLa5fVOHeFD18g Tilt Shift Depth of Field and Motion Blur can be very visually disruptive if you have low FPS. https://lh7-us.googleusercontent.com/tnNEqerz6_-jn1r-aAG_Rf6lVxrsicuh43jLmqQvN74DMwgEbySYBiIK44QdB_HVeYW9lfBFk7mXyS4k20PpFpsDt0EPkun8F_QIHuI5CCTsPEtD4ef4eEgk3pDjouRTyPH_XN_bPfKXpsV6sj-cJt0 Dynamic Resolution is a game setting that helps with performance by dynamically changing the resolution. Dynamic Resolution can save FPS but might make the game look blurry; here’s an example; https://lh7-us.googleusercontent.com/UB7BlIrgxKchHj09wNq9LPXNQG3gPbB1KhRy1gB4F6DXutBEgcHeZYszdIAvschyvYlD_HRazJRQOjxtXBLatduWS5XlGZG5Kh5dESshfXNC1a_uqKRF7jw8uWvlUiQvjaJNHgAEzapP5cA0CttKh3c Turning it to “Automatic”. https://lh7-us.googleusercontent.com/CYowmg50WuB3ctSA5FsAji-N2gLrslXCP18WpU6k4PK7Z5OQlTAPmqgraonIm_N657cu2UxuKRlKotqd1JPY9Kl-gwZphUmvV775t55BCymHYLJjIkyCyucyaYms__r4Dc04bMVpeDG_jS-Zw1TR7YI Turning it to “Constant”. These three settings are optional, and we encourage you to change the setting to find what suits you best.",
                "feedlabel": "Community Announcements",
                "date": 1698165412,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 949230
            },
            {
                "gid": "5218041989061658445",
                "title": "Official Accolades Trailer | OUT NOW I Cities: Skylines II",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5218041989061658445",
                "is_external_url": true,
                "author": "Cities: Skylines Official",
                "contents": "The most realistic city builder ever. OUT NOW! 🏗️ You Make It Happen. You Make It Yours. You Make Cities. Footage captured In-Game is not final and might change in time for release. BUY Cities: Skylines II NOW! https://www.paradoxinteractive.com/games/cities-skylines-ii/about",
                "feedlabel": "Community Announcements",
                "date": 1698164574,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 949230
            },
            {
                "gid": "5218041989061720076",
                "title": "Steam Global Top Sellers for week of 17 Oct — 24 October 2023",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/SteamDB/5218041989061720076",
                "is_external_url": true,
                "author": "SteamDB",
                "contents": "<a href=\"https://steamdb.info/topsellers/2023W43/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\"> </a> * <a href=\"https://steamdb.info/app/949230/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">Cities: Skylines II</a>; * <a href=\"https://steamdb.info/app/2195250/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">EA SPORTS FC™ 24</a>; * <a href=\"https://steamdb.info/app/1086940/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">Baldur's Gate 3</a>; * <a href=\"https://steamdb.info/app/1938090/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">Call of Duty®</a>; * <a href=\"https://steamdb.info/app/2344520/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">Diablo® IV</a>; * <a href=\"https://steamdb.info/app/2252570/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">Football Manager 2024</a>; * <a href=\"https://steamdb.info/app/1517290/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">Battlefield™ 2042</a>; * <a href=\"https://steamdb.info/app/227300/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">Euro Truck Simulator 2</a>; * <a href=\"https://steamdb.info/app/1675200/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">Steam Deck</a>; * <a href=\"https://steamdb.info/app/381210/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">Dead by Daylight</a>; <i>* excluding free to play games</i> <a href=\"https://steamdb.info/topsellers/2023W43/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">View top 100 on SteamDB</a>",
                "feedlabel": "SteamDB",
                "date": 1698163200,
                "feedname": "SteamDB",
                "feed_type": 0,
                "appid": 227300
            },
            {
                "gid": "5218041989057888409",
                "title": "Pre-Load NOW!",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5218041989057888409",
                "is_external_url": true,
                "author": "leaderofthemonkeys",
                "contents": "We heard how much you wanted to be able to Pre-Load the game in preparation for tomorrow! You can now Pre-Load!",
                "feedlabel": "Community Announcements",
                "date": 1698075227,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 949230
            },
            {
                "gid": "5218041989054007750",
                "title": "Behind the Scenes #6: Tutorials & Advisor",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5218041989054007750",
                "is_external_url": true,
                "author": "CO_Avanya",
                "contents": "Hello everyone! It’s time for another development diary, the last one in our mini-series taking you behind the scenes. Today, we take a look at the tutorials available in the game, how they work, and what kind of helpful information they provide. Our goal with the tutorials in Cities: Skylines II is to provide you with a thorough introduction to the game and guide you toward building a successful city. While we had small in-game guides in Cities: Skylines to explain different services or features, they were quite limited, so we developed a new system for Cities: Skylines II to help both players familiar with its predecessor and players new to the genre. Tutorials can be enabled at the beginning of the game and function as a guide bringing you essential information on how to start a city. They provide easy step-by-step instructions on the basic city needs and help set up the city for future growth. As the game progresses, the steps of the tutorials provide more information and fewer step-by-step guides letting you take the reins and choose the direction for your city. Tutorials have no time limit on how long to take on each step and are shown for services and panels when the service or panel is opened. Tutorials work together with tooltips and other information in panels, which provide more in-depth information about what the feature is, while tutorials focus more on how and where to build and place the feature. Together they provide a good overview of how to use each feature to make a successful city. For beginners, the tutorials provide an easy start with more guided and instructional beginning with additional information and hints as the city expands and more features are opened. For experienced players, the tutorials provide information on the features that are new and a helpful resource if stuck on something or uncertain about how a feature works. Tutorials are optional and can be turned on or off at any time, and even when turned off they are easy to reach in the Advisor found at the top-right of the screen. Just open the panel and select the feature you want to learn more about. There is also an option to restart or continue the tutorials. These options can be used on the same map while continuing to build the city already started, or on a new map, with a new city. STARTING WITH TUTORIALS At the beginning of the tutorials, there are a few basic instructions on how to move around. These are called Camera Controls and will get you started. In addition to the basic camera movements, there are quite a few keyboard shortcuts to use. The keyboard shortcuts are listed in the options menu under Input. Each one can be changed from the default to whatever feels most comfortable, and reset bindings will restore them to the default settings if the need arises. {STEAM_CLAN_IMAGE}/43753943/e16b8db2c90a822cf539572e68cd8698f73b3353.png Camera Controls Tutorial cards appear in the middle of the screen and display the appropriate instructions depending on whether the game uses a keyboard and mouse or a controller. When the movement has been successfully completed, the instruction text will turn green and the next step is shown. HOW TO BUILD A CITY Once you have a hang of the controls, it’s time to build a city. The tutorials give you a short list of tasks to fulfill which cover the basic needs of a city. Each task has the goal of building an essential utility for the city and showing the very basics of road building and how to zone. These task tutorials are aimed at new players and beginners but contain information about new features in familiar services for experienced players. When the tasks are done, the city is ready to start growing and expanding with more services and controls. During the task list, tutorials are not skippable but become skippable when the list has been completed. {STEAM_CLAN_IMAGE}/43753943/aba805d6c1e9720d5d758c0e1855c8eafffa506a.png TASKS in the task list are tutorials that will start by pressing the play button. You can take as much time with each tutorial as you need, and return to any of them to look through the information or do the tutorial again, by pressing the play button. Tasks will remain gray and locked until the previous task has been done. DIFFERENT TYPES OF TUTORIAL STEPS Tutorials are broken down into a few different types of steps with guides to help you find the relevant place to go. There are balloons that point to features, center cards with information, and task cards that have instructions on how to build something. FIRST STEP BALLOON The first step balloon points to the item it’s talking about and highlights it with a green outline around the icon. These give overall information about the features, like roads or services, and the green outline is animated to encourage you to click the icon and open the menu to move to the next tutorial step. If the panel or service is closed before the tutorial is finished the green outline will appear around appropriate icons and tabs to show you where to go. {STEAM_CLAN_IMAGE}/43753943/ae9cf872e996388c37b1c76b705638881d020777.png The green blinking outline guides you to where the service or feature is found. To move the tutorial forward to the next step, the icon needs to be selected. BALLOON STEPS Balloon steps are next. These point to things like assets and tools. You can freely move backward and forward through these steps to get familiar with the tools and controls before moving on to building. These steps will point out some of the common useful tools and their controls, highlighting new additions that might go unnoticed otherwise. The explanations are short and more details are displayed in the tooltips or panels about the feature in question if you want to learn more. {STEAM_CLAN_IMAGE}/43753943/ee309de71341e6addfd1f196d7e5b0a1c1a94c90.png The balloon step will point to the feature it’s talking about. The number between the arrows shows what step you are in, and how many steps there are in total. When the tutorial has been completed once, the steps become closable. TASK CARDS Task Cards are often the last step of a tutorial sequence. Task cards are instructions on how and where to build and will complete the tutorial when done, though not all tutorial sequences have a card with a task at the end. Tasks are given when there is something to build. While the task list is active there are more of these task cards, but once it’s completed the task cards will show up only for more complex builds like public transportation. The text will scroll if it’s too long to fit in the space and the card can be minimized while building without closing the tutorial. To minimize the card, close and re-open the card with the small arrow on the title bar. {STEAM_CLAN_IMAGE}/43753943/35a797579eefa2b0fe40a1ad0a8b64c860db220e.png Task cards have an image, text, and if relevant guides to keys or selection buttons to use. When the task has already been done once there will be a checkmark next to the card number to close and finish the tutorial without needing to complete the task again. CENTER CARD Center Cards are used when there is no specific icon, tool, or panel to point to. These will show you information about things like info views and might pop up to draw attention to a new type of problem in the city. Center cards can be looked through by selecting the arrow. When the card includes a task, the panel will close after the task is done or it can be closed without completing the task. {STEAM_CLAN_IMAGE}/43753943/148e3eeb824292a1878f6aa3d44c42f985299d84.png HINTS What’s the difference between a hint and a tutorial? Hints are tutorials that pop up between the task list tutorials and are short information balloons that don’t have a task and can be closed once read. Hints point out tools that are particularly useful at the moment. After the hint has been shown it will appear at the bottom of the task list and can be accessed later in the Advisor along with all the other tutorials. {STEAM_CLAN_IMAGE}/43753943/8bf8775ee5f5b7b00e8da0497798c8c0b6501d6c.png Hints point out things that could be handy to know. They don’t need any action and if the information is not useful at the moment they can be closed. If you want to see a hint again select it in the task list or Advisor and it will open. TUTORIALS AFTER THE TASK LIST After the task list is done, the tutorials will show up when a new service or panel is opened for the first time. New features have a green indicator at the top right corner of its icon. These tutorials function the same as they did during the task list, except that they can be closed at any step and don't need to be completed. When they are closed they will be added to the Advisor where they can be opened again at any time. {STEAM_CLAN_IMAGE}/43753943/9fa02382ccd2b46eaf93826ddd4c44d6760be6f9.png Tutorials will open when a new service or panel is opened. New services will be unlocked as the city grows. TEXT HIGHLIGHT Text Highlights are bolded text in the tutorial that shows the most relevant information in that tutorial. Reading just the bolded text will give the short answer to what the feature is and the rest of the text adds more detail. There is a lot of information to read when combining all the tutorials, tooltips, and panels, and highlights give you a quicker way to scan the information and pick what interests you the most at the moment. {STEAM_CLAN_IMAGE}/43753943/7cfa663f6d0677b48f482564d16309fd229c7c00.png Highlighted text is bolded and is the core of the information in the tutorial. ADVISOR After the task list is completed the Advisor will appear in the top-right corner of the screen, or if you play with tutorials turned off, it will be available from the start. Simply select the question mark to open the Advisor and access its collection of all the tutorials in the game. Tutorials are divided into five groups: Services, City, Info Views & Notifications, Citizens, and Interface & Tools. Under these groups, you will find subgroups like Electricity where all the tutorials relevant to that service can be found. To expand or close a group select the small arrow icon and select the tutorial to open it. If the tutorial has more than one step, select the top step or skip to any step you want to start from. Steps are marked with a small dot to make them easily recognizable. Tutorials are added to the list when services or panels are unlocked. {STEAM_CLAN_IMAGE}/43753943/4f4f1b47ad0834499ec94ae24cbdd1dfb0b6e8d8.png The Advisor collects all tutorials that have been completed for later use if needed. When tutorials are off, all tutorials are added to the advisor without being played. STARTING WITHOUT TUTORIALS You can choose not to have tutorials on and open them manually from the Advisor if you need them later on. Only the tutorials for the services and features that have been unlocked will be visible in the Advisor, and each time a service or feature is unlocked the tutorials relevant to them will be added. Tutorials can be turned on and started at any point, even after a city has grown to a larger size. Tutorials provide information on what’s new and how old and improved services work. With the tooltips and panel information you can either take a quick look or a deep dive into how things function in the game. That concludes our behind-the-scenes development diaries. We hope you enjoyed this look at our goals and philosophy behind certain aspects of the game and a peek at our processes for bringing it all to life. If you’d enjoy more of these, don’t hesitate to let us know what kind of topics you’d love for us to cover. For now, we’ll be counting the hours to release as we’re so excited for you to finally get your hands on Cities: Skylines II.",
                "feedlabel": "Community Announcements",
                "date": 1697983224,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 949230
            },
            {
                "gid": "5218041989050363536",
                "title": "Behind the Scenes #5: Citizen Characters",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5218041989050363536",
                "is_external_url": true,
                "author": "CO_Avanya",
                "contents": "Hi and welcome back to another development diary for Cities: Skylines II! We’ve talked about the people living in your cities before, their wants and needs, and how they affect the simulation, but today we focus on the models themselves, our goals for them, and the process of how they came to be. From the very start, we had a distinct goal: we wanted a clear and definite upgrade from Cities: Skylines in all aspects. The new Photo Mode camera allows you to get pretty close, so citizens had to have a level of detail to match this. But we also wanted our citizens to have much more variation to create a more inclusive and realistic gaming world. It was essential to us that the characters in Cities: Skylines II represent a broad spectrum of humanity, including different ethnicities and body types. Achieving this diversity required a flexible and efficient system for creating character models across all the different age groups of the game. It was clear that a tool was needed to combine all those aspects and on top of that a great variety of hair, clothes, and accessories needed to be added. Lastly, it was also a major requirement that animations should work with any type of character model regardless of the body type. {STEAM_CLAN_IMAGE}/43753943/2402d653cd3801f340771bff8bf22ee61ee2dbe6.png Real cities are full of diverse people and we wanted Cities: Skylines II to reflect that reality POPUL8 This is where Popul8 comes into play. We partnered with Didimo, who created the Popul8 character design software that perfectly addresses our design needs: Create a lot of varied characters quickly and easily. We had our own art style for the characters and for this, Didimo created a base mesh to represent that style. With this external tool groups of citizens could easily be created for different seasons, age groups, and jobs, and then these could be imported into the game. We had a set of early placeholder characters during development, which did not have much variety, so getting the first batch of final characters into the game was quite exciting for us. Suddenly the game came alive with a myriad of people walking the streets, doing yoga in the park, or taking selfies in front of interesting buildings. It brought in both young and old, tall and short, heavy and light citizens of all different ethnicities, bringing realism and diversity to the city. And when they started to choose their clothing according to the temperature, we took another exciting step toward more realistic citizens. {STEAM_CLAN_IMAGE}/43753943/843204c55b181d7e25f8c0c5337d05bad6df02af.png A sneak peek at how characters are created in Popul8 GROUP OF CHARACTERS As we wanted a lot of variation in the game, this meant a lot of character models. The game has children, teens, adults, and seniors all of which need to be done separately and set up so that their physical appearance remains the same through all ages. Some might change their hairstyle or gain or lose some weight but in general, they are recognizable throughout their lifetime. When working on new characters, we usually create a group of 100 characters with similar setups at the same time. As an example, let’s say it’s a group of adult people during wintertime. {STEAM_CLAN_IMAGE}/43753943/40c0d3f1cb8f6d4649a2aa53b59a3e244f742d46.png 100 adults in winter gear in Popul8. Color variations for hair and clothing are not shown as these are set in-game. HOW IT’S DONE We have several sliders which control variables for age, tall or short, thin or fat. There are also several sliders for different ethnicities to ensure the characters look just right. As this is a group of adults the age slider is set to about middle with some allowed variance. Other sliders can have full range to give the group a good variety of height, build, and ethnicity. Next, we create sets of winter boots, jackets, trousers, headgear, and accessories from which clothing is randomly picked to form the characters in Popul8. Additionally, we have several versions of hair and tattoos for even more variety. Once the characters are generated, they are checked to avoid any combinations that look way off. Some weirdness is okay, we want characters to reflect experimenting with different styles, but occasionally some just go a little too far from reality. Once we are happy with the group, it is exported from Popul8 and then imported into the game. INGAME SETTINGS The original texture assets are usually a neutral gray to allow for even more variations of color for the clothing, hair, and accessories. Once in the game, artists choose color palettes for the characters. It’s a fine balance between too garish or too dull and we have included both common and rare color choices to represent the variations you find in real life. Some people love a splash of color while others prefer more muted tones, and our character models should represent that. {STEAM_CLAN_IMAGE}/43753943/96d4077efa4d63bad8db7a886f102b7f30281738.png Selecting a jacket for the character {STEAM_CLAN_IMAGE}/43753943/2e7595289ab4d506f53f4380e4baba0330ab86a9.png Getting your hair done CHALLENGES There were quite a few challenges with the character models for Cities: Skylines II. Some of these challenges were technical and expected, like what is the art style, what are the proper blend shapes, how clothes work when they are layered on top of each other, and how to compress animations. Other challenges were trickier to solve, like how different sizes of characters fit onto motorcycles or retargeting animations for children so they all look correct. Then there was just picking clothing combinations that looked realistic but interesting and not too odd - that was more of a fun challenge and it was great to see all the possibilities of the tools. Looking to the future, we want to add more variations in character blend shapes, clothing, and pretty much all aspects of character models, so the city has a wider spectrum of citizens. This also includes animations and accessories for disabled characters and much more. While we have many ideas ourselves, we are always eager to hear from you about the kind of citizens you would like to see and which ones grow to become your favorites. This brings us to the end of this development diary and we hope you enjoyed another peek behind the curtain. We’re back tomorrow with the last of this mini-series, where we cover the Tutorials & Advisor and how they can help you build the city of your dreams.",
                "feedlabel": "Community Announcements",
                "date": 1697896812,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 949230
            }
        ],
        "count": 48
    }
}