{
    "appnews": {
        "appid": 1172470,
        "newsitems": [
            {
                "gid": "5288974951207127482",
                "title": "Apex Legends X Post Malone Event Trailer",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5288974951207127482",
                "is_external_url": true,
                "author": "mattrodriguez",
                "contents": "The biggest partnership in Apex Legends history starts now as Post Malone squads up with Apex Legends to unleash two weeks of beautiful mayhem. The event features the debut of a brand-new Limited Time Mode Three Strikes, plus cosmetics designed in collaboration with Post Malone, and more. Learn More: http://x.ea.com/apxl/post-malone-event ",
                "feedlabel": "Community Announcements",
                "date": 1698945058,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 1172470
            },
            {
                "gid": "5288974951203482763",
                "title": "Apex Legends Post Malone skins could start off Fortnite style trend",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/The Loadout/5288974951203482763",
                "is_external_url": true,
                "author": "editor@theloadout.com",
                "contents": "<strong>Apex Legends</strong> has some of the best skins out there, ranging from outright awesome to more weird creations. There is something for everyone, and it probably won't surprise you that long-time fan <strong>Post Malone</strong> is finally leaving his mark on the game. Developer Respawn Entertainment is collaborating with the award-winning artist on a series of <strong>Apex Legends skins</strong>, but it looks like they could be the start of a Fortnite-inspired tier going forward. <a href=\"https://www.theloadout.com/apex-legends/post-malone-skins\">Read the rest of the story...</a> RELATED LINKS: <a href=\"https://www.theloadout.com/apex-legends/season-19-release-date\">Apex Legends Season 19 changes, Conduit, patch notes, and more</a> <a href=\"https://www.theloadout.com/apex-legends/ranks\">Apex Legends ranks and Season 19 ranked changes explained</a> <a href=\"https://www.theloadout.com/apex-legends/crossprogression-restrictions-ps5\">Exclusive PS5 content to be exempt from Apex Legends' crossprogression</a> ",
                "feedlabel": "The Loadout",
                "date": 1698857875,
                "feedname": "The Loadout",
                "feed_type": 0,
                "appid": 1172470
            },
            {
                "gid": "5288974951200791300",
                "title": "APEX LEGENDS™: IGNITE PATCH NOTES",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5288974951200791300",
                "is_external_url": true,
                "author": "mattrodriguez",
                "contents": "https://media.contentapi.ea.com/content/dam/apex-legends/common/ignite-season-game-updates/conduit-season-updates.jpg.adapt.1920w.jpg NEW LEGEND: CONDUIT Rowenna grew up amidst a war, but in a move that turned the tide, one Monarch Titan sacrificed itself to end the fighting. In the years after, her home planet of Nexus established ties across the Outlands, introducing Rowenna to the Apex Games. The Games represented everything she aspired to–heroism, hard work, sacrifice—and she became a dedicated fan. When her elder sister Diwa suffered a terrible injury at work, Rowenna resolved to support her family no matter what. She stole the battery from the Monarch, still rusting on the hill, and had a combat rig built with its battery at the core. She used it to qualify for the Apex Games, and even though the battery exposes her to poisonous radiation, she refuses to give up. No one else was going to get hurt to support her family. Rowenna’s choosing to have hope for her dreams or die trying. Now, it’s Conduit’s chance for a day in the sun. Check out more on our newest and brightest Legend, Conduit, in our highlights blog and read on for details on her abilities. https://www.ea.com/games/apex-legends/news/ignite-season-game-updates PASSIVE: SAVIOR’S SPEED Gain a burst of speed when running toward a teammate out of Tactical range. TACTICAL: RADIANT TRANSFER Blast your ally with energy, regenerating temporary shields for them when in danger. ULTIMATE: ENERGY BARRICADE Deploy an array of shield jamming devices which damage and slow enemies. IGNITE MAP ROTATION The following maps will be available for public matchmaking in the Battle Royale mode: Broken Moon Olympus Storm Point STORM POINT MAP UPDATE https://media.contentapi.ea.com/content/dam/apex-legends/common/ignite-season-game-updates/title.jpg.adapt.1456w.jpg Read the full breakdown of the Storm Point updates in our Ignite Highlights blog here. https://www.ea.com/games/apex-legends/news/ignite-season-game-updates ANTI-CHEAT UPDATES NEW IN-MATCH NOTIFICATIONS A new feature that launched during Resurrection is live: in-game notifications for banned players. This notification will appear in the kill feed when a player in your current match has been removed. This alert will only be triggered by our anti-cheat systems and will not display when someone quits a match, loses connection or is kicked for AFK. This is the first of many steps the team is taking to improve visibility and player feedback when users are actioned. https://media.contentapi.ea.com/content/dam/apex-legends/common/sample-inmatch-notification.png.adapt.1456w.png RANKED NEW FEATURE: PROMOTIONAL TRIALS In Season 19, players will enter a Promotional Trial state when they reach the peak of their tier. During a Trial, LP loss and gains are frozen, allowing the player to focus on completing the trial: Completing the conditions of a Trial within the given match count limit (either by winning a game or completing the alternative) will allow promotion into the next tier with a 250 LP promotional bonus Failing to complete the Trial within the match limit results in the Trial ending and a loss of LP based on the player’s performance Trials are time limited to 5 matches, increasing by 1 game each time a player fails and then reenters the same Trial, up to a max of 10 retries Promotional Trials are skipped during Provisional matches {STEAM_CLAN_IMAGE}/38098458/b54c78326014d75a191a33446255dedf9fa1df47.png RANKED TUNING If you missed our recent reddit Dev Team Update, we’ve made some tuning adjustments for Ignite’s Ranked: Increasing the amount of Rating Bonus given to help players’ ranking catch up to their skill bracket Reduce the bonus that is withheld and thus the difficulty of climbing, when players are actively pushing against their skill ceiling Provisional Bonuses are adjusted to land players closer to the expected statistical 1.5 tier drop at the end of their 10 provisional games Ranking difference restrictions for 3 stack premades has been REMOVED. Players will now be able to play with friends no matter where they are on their climbs—with the caveat that your squad will face more difficult battles if there’s a bigger discrepancy between your skill PATCH NOTES https://www.ea.com/games/apex-legends/news/ignite-patch-notes",
                "feedlabel": "Community Announcements",
                "date": 1698794906,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 1172470
            },
            {
                "gid": "5229301621592403288",
                "title": "NEW UPDATES WITH APEX LEGENDS™: IGNITE",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5229301621592403288",
                "is_external_url": true,
                "author": "mattrodriguez",
                "contents": "NEW UPDATES COMING WITH APEX LEGENDS™: IGNITE It’s your Time to Shine in Apex Legends™: Ignite. With her shield-based abilities, let Conduit be your guiding light for regeneration and disruption. She’s the spark your squad needs to become Apex Champions on the faster and deadlier Storm Point. This tempest of a map has been overhauled with a reduced size and fresh Points of Interest like The Pylon, ZEUS Station, and Devastated Coast. Last but certainly not least, the team is excited to share that Cross Progression will be rolling out starting this season. Link your platforms to an EA Account to show off your skills no matter where you squad up. NEW LEGEND: CONDUIT https://media.contentapi.ea.com/content/dam/apex-legends/common/ignite-season-game-updates/conduit-season-updates.jpg.adapt.1920w.jpg Conduit is like a firework–warm, bright, and short-lived. To rise quickly, Rowenna must don a combat rig made of an incomplete Monarch Titan that she knows is poisoning her. But it’s a price she’s willing to pay for her dream of being a Legend. At home, she’s the core of her large family. She smoothes over issues with her humor and sunny disposition all while hustling and sacrificing quietly–something that’s unchanged in the Games. Despite the fact she’s exchanging her life and health to be Conduit, Rowenna is having fun because she knows the Apex Games. Expert, fan, supporter–she’s there and she has the replays saved and filed, and her teammates and rivals know she’s there to win! STORM POINT MAP UPDATE Storm Point is a map that is loved by our competitive community for its more predictable pacing and high loot quality. However, some of the elements of Storm Point that make it a great competitive map can also make it more difficult to quickly find action during casual play. This brings us to the team's primary goal for this update, which is to improve the fun factor without sacrificing competitive integrity. To do this, we’ve taken the following actions: Add attractive, central POIs for players searching for combat. Wattson’s Pylon and CETO Station provide central hot drops for players looking to fight early. Reduce overall map size to improve mid-game pacing. Significant map size reductions to both the southern coastline and northern mountainous areas make these zones more attractive for early combat and reduce the overall distance between squads. Reduce friction of central rotations. With CETO Station replacing Prowler Island and a reworked Prowler-less Forbidden Zone, rotations through the center of map have never been smoother. IMC ARMORIES https://media.contentapi.ea.com/content/dam/apex-legends/common/ignite-season-game-updates/armory.jpg.adapt.1920w.jpg Unfortunately, the IMC Spectres failed to defend Storm Point from the storm, leaving only ravaged husks of the armories behind. Expect some high tier loot to remain – but the Spectres will no longer defend the spoils. REWORKED AREA: FORBIDDEN ZONE https://media.contentapi.ea.com/content/dam/apex-legends/common/ignite-season-game-updates/forbidden.jpg.adapt.1920w.jpg The Forbidden Zone was hit hard by lightning during the storm, destroying parts of the perimeter fence and causing the Prowlers to flee! Our goal for this area was to reduce the friction of rotating through the zone by removing the Prowlers, but also providing structures to build better fronts and defensive options when squads are forced into combat. REWORKED AREA: LIGHTNING ROD One of the biggest opportunities we wanted to address with this update was to solve for the low number of players choosing to drop on the high side of the map. In addition to adding ZEUS Station, the team felt that it was important to reduce the overall size of this zone to help make these POIs feel better connected to one another and the rest of Storm Point. And that’s just about everything! The team is looking forward to hearing your thoughts on the new Storm Point and playing with you all. See you in the ring! CROSS PROGRESSION With the launch of Season 19, we’re excited to roll out Cross Progression in a phased deployment across existing platforms in Apex Legends™. Keep an eye out for an in-game prompt to initiate the Cross Progression migration which will bring together your content and progression. For more information and platform restrictions, please check out our Cross Progression blog here: https://www.ea.com/games/apex-legends/news/cross-progression SKYDIVE HOLOSPRAYS Holosprays are soaring to new heights this season. Equip them to your wheel to use them while in-flight! Once deployed, Holosprays will follow your flight path for a limited time or until a Skydive Emote or different Holospray is used. Let the good taunts roll on the ground and in the skies while you’re dropping - hot or not.",
                "feedlabel": "Community Announcements",
                "date": 1698712592,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 1172470,
                "tags": [
                    "mod_reviewed",
                    "ModAct_487791598_1698717720_0",
                    "mod_require_rereview"
                ]
            },
            {
                "gid": "5229301621591472578",
                "title": "Apex Legends: Ignite Battle Pass Trailer",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5229301621591472578",
                "is_external_url": true,
                "author": "mattrodriguez",
                "contents": "Reach for glory with the Ignite Battle Pass, and shine in new cosmetics fit for a Legend. Race toward Elysium in Octane’s Legendary “Godly Speed” skin at Level 50. Brandish Epic skins for Conduit, Wattson, and Newcastle. Let your ambition take flight in new Skydive Emotes. Ascend toward immortality by completing Weekly Challenges, earning new banner frames, emotes, weapon charms, stickers, and more. Blow the doors off the competition in style with the Reactive “Grace of Odin” and “Wrath of Fenrir” Rampage skins at Level 100 and 110. Purchase the Ignite Battle Pass, or get the Premium Bundle to instantly gain divine favor, unlocking the first 25 levels and items, including Rampart’s Legendary “Sly Sovereign” skin and Legendary “Gilded Age” Nemesis skin. Whichever path you choose, may the flames of glory light your way to victory. Learn More: http://x.ea.com/apxl/ignite",
                "feedlabel": "Community Announcements",
                "date": 1698690536,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 1172470
            },
            {
                "gid": "5229301621580342138",
                "title": "Exclusive PS5 content to be exempt from Apex Legends' crossprogression",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/The Loadout/5229301621580342138",
                "is_external_url": true,
                "author": "editor@theloadout.com",
                "contents": "In Season 19, Respawn Entertainment is introducing crossprogression features to its battle royale <strong>Apex Legends</strong>. It's been a long time coming, so to say we're thrilled would be an understatement - and we're not alone in that sentiment, either. However, one thing <strong>PS5</strong> players - and those of you playing on Xbox consoles - should know is that there will be <strong>Apex Legends crossprogression restrictions</strong> in place when it arrives. That means, some of the content you have won't be available everywhere. <a href=\"https://www.theloadout.com/apex-legends/crossprogression-restrictions-ps5\">Read the rest of the story...</a> RELATED LINKS: <a href=\"https://www.theloadout.com/apex-legends/season-19-release-date\">Apex Legends Season 19 changes, Conduit, patch notes, and more</a> <a href=\"https://www.theloadout.com/apex-legends/ranks\">Apex Legends ranks and Season 19 ranked changes explained</a> <a href=\"https://www.theloadout.com/apex-legends/conduit-abilities\">﻿Apex Legends' new gameplay trailer arrives detailing Conduit's kit</a> ",
                "feedlabel": "The Loadout",
                "date": 1698422674,
                "feedname": "The Loadout",
                "feed_type": 0,
                "appid": 1172470
            },
            {
                "gid": "5229301621576795846",
                "title": "Apex Legends: Ignite Gameplay Trailer",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5229301621576795846",
                "is_external_url": true,
                "author": "mattrodriguez",
                "contents": "It’s your Time to Shine in Apex Legends: Ignite. Light the way with Conduit, the new support Legend whose abilities can spark victory for your squad. Battle through a faster, deadlier Storm Point, overhauled with a reduced map size, devastated locations and POI updates to amp up the intensity. Explore what dangers await at new Points of Interest like Watton’s Pylon, ZEUS Station, and more. Unify your accounts with Cross Progression, proving yourself among the pantheon of Legends and ascend the Ignite Battle Pass to earn cosmetics worthy of a champion. Time To Shine with Conduit when Apex Legends: Ignite drops Oct 31st! Learn More: http://x.ea.com/apxl/ignite",
                "feedlabel": "Community Announcements",
                "date": 1698342609,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 1172470
            },
            {
                "gid": "5229301621578895369",
                "title": "﻿Apex Legends' new gameplay trailer arrives detailing Conduit's kit",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/The Loadout/5229301621578895369",
                "is_external_url": true,
                "author": "editor@theloadout.com",
                "contents": "The next major <strong>Apex Legends</strong> update is almost upon us and Respawn Entertainment is showing off the Apex Games' newest contestant, Conduit, with a brand new Ignite gameplay trailer you won't want to miss out on. If you want to know exactly what <strong>Apex Legends' Conduit abilities</strong> are ahead of Season 19, this really is our best look at them yet - and they look like a lot of fun to use. <a href=\"https://www.theloadout.com/apex-legends/conduit-abilities\">Read the rest of the story...</a> RELATED LINKS: <a href=\"https://www.theloadout.com/apex-legends/season-19-release-date\">Apex Legends Season 19 release date, Conduit, patch notes, and changes</a> <a href=\"https://www.theloadout.com/apex-legends/crossprogression-restrictions-ps5\">Exclusive PS5 content to be exempt from Apex Legends' crossprogression</a> <a href=\"https://www.theloadout.com/apex-legends/ranks\">Apex Legends ranks, rewards, LP changes, and more in Season 18</a> ",
                "feedlabel": "The Loadout",
                "date": 1698338033,
                "feedname": "The Loadout",
                "feed_type": 0,
                "appid": 1172470
            },
            {
                "gid": "5229301621576418233",
                "title": "Apex Legends season 19 finally adds the one feature players have been begging for",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/VG247/5229301621576418233",
                "is_external_url": true,
                "author": "",
                "contents": "<a href=\"https://www.vg247.com/games/apex-legends\">Apex Legends</a> season 19 is almost here. With it, the game is getting the usual spread of map reworks, a new Legend for players to mess around with, a battle pass with new cosmetics, etc. But it's also getting something special - a feature fans have been asking about for years now. Apex Legends is getting cross progression. As soon as the season starts, Apex Legends players with multiple accounts spread across PC and consoles will have their accounts merged into one master account. Your highest rank across your accounts will carry over, as will all your cosmetics which will be compiled into one neat collection. We're not quite sure yet how duplicate cosmetics will work, but fingers crossed that you get a nice amount of in-game currency. This is obviously great news for longtime players, especially those who may have a stray legendary skin lost on an old console (<a href=\"https://www.vg247.com/apex-legends-switch-trailer.\">or even the dreaded Apex Legends Switch version</a>) that they've been leaving to gather dust for a while now. Cross progression is one of those features that have been demanded by a subset of the community for a while now - almost as much as the push to make <a href=\"https://www.vg247.com/apex-legends-everything-on-control\">certain limited time modes permanent</a>. As long as this doesn't lead to significant bugs or lost progress, this should go down a treat. <a href=\"https://www.vg247.com/apex-legends-season-19-cross-progression\">Read more</a> ",
                "feedlabel": "VG247",
                "date": 1698333105,
                "feedname": "VG247",
                "feed_type": 0,
                "appid": 1172470
            },
            {
                "gid": "5218041989058667115",
                "title": "Apex Legends: Ignite Launch Trailer",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5218041989058667115",
                "is_external_url": true,
                "author": "mattrodriguez",
                "contents": "Conduit pitches fellow Legends Mirage and Gibraltar on her ideas for the perfect intro trailer. It's a huge dilemma, but luckily she's got support from her family, her squad, and her fully kitted Triple Take. Time To Shine with Conduit when Apex Legends: Ignite drops Oct 31st! Learn More: http://x.ea.com/apxl/ignite",
                "feedlabel": "Community Announcements",
                "date": 1698093681,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 1172470
            }
        ],
        "count": 946
    }
}