{
    "appnews": {
        "appid": 1085660,
        "newsitems": [
            {
                "gid": "5229301621576916056",
                "title": "This Week in Destiny - 10/26/2023",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5229301621576916056",
                "is_external_url": true,
                "author": "Destiny 2 Team",
                "contents": "This week in Destiny, the team is heads down on The Final Shape and other Destiny-related shenanigans while players continue doing Space Grandma proud… um, I mean, doing Eva Levante proud during Festival of the Lost. Let’s take a quick look at what went down in last week’s TWID before candy-diving into this week’s: More Festival of the Lost fun. Closet cosplay shenanigans. Pumpkin carvings galore! Become Eris yourself. Checkmate Rumble? Well, check! Double Nightfall rewards and extra Vanguard ranks reminder . Topics for this week: Get ready to vault from orbit. In this economy? A message on Rahool and a quick chat about Ghost Mods. ProdSec PSA: Let’s talk about boosting services. Global reach is getting more global. Ready to rock ‘n ghoul? Let’s get into it! Click here to read more. ",
                "feedlabel": "Community Announcements",
                "date": 1698345450,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 1085660
            },
            {
                "gid": "5218041989043716262",
                "title": "This Week In Destiny - 10/19/2023",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5218041989043716262",
                "is_external_url": true,
                "author": "Destiny 2 Team",
                "contents": "This week in Destiny, we are—AAAAAAH, IT'S A HEADLESS ONE! Oh, no, it was just my cat. My apologies, but since Festival of the Lost started, I see those three-eyed things everywhere... and I love it! There’s tons of great loot to obtain, but we can also be playful and a bit scary on the side. More about that in a second, just after a message from our sponsor: the topics from last week's TWID. A preview of Festival of the Lost. An update from our PvP strike team. More Checkmate tuning. Matchmaking changes in Control. A long Season 23 preview. Sparrows will be Always on Time, if you know what I mean. Remembering The Craftening with an emblem. And what's in the oven for today?   A spooky event deserves community activities. An update on Sparrows. Vanguard extra ranks and double Nightfall loot! Final week in rotation for some weapons. Have you tried Checkmate Rumble? New Prime Gaming Drops available. The Player Support Report. Some amazing Art of the Week and Movie of the Week submissions. You can read the rest of the TWID here. ",
                "feedlabel": "Community Announcements",
                "date": 1697739237,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 1085660
            },
            {
                "gid": "5218041989039394231",
                "title": "How to get the Festival of the Lost Memento in Destiny 2",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/PC Gamer/5218041989039394231",
                "is_external_url": true,
                "author": "Sean Martin",
                "contents": "The <strong>Festival of the Lost Memento</strong> in Destiny 2 is a newly added reward you can get as part of the yearly Halloween event. If you have no idea what a memento is, it&apos;s essentially a special item you can add to a crafted weapon which will give it a unique kill tracker, a title, and a special shader when it reaches level 30... <a href=\"https://www.pcgamer.com/destiny-2-lost-memento-twilight?utm_source=steam&utm_medium=referral\" target=\"_blank\">Read more.</a>",
                "feedlabel": "PC Gamer",
                "date": 1697636616,
                "feedname": "PC Gamer",
                "feed_type": 0,
                "appid": 1085660
            },
            {
                "gid": "6438516944139311791",
                "title": "Festival of the Lost 2023",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/6438516944139311791",
                "is_external_url": true,
                "author": "Destiny 2 Team",
                "contents": "What will you dress up as?  Go grab your favorite Festival mask in the Tower, Guardians, and brave chilling challenges to score candy along the way. Turn in that sugar for all sorts of ghastly goodies. {STEAM_CLAN_IMAGE}/35190912/f627e61e622bbc7a6d6059351cb618c6ff0f4459.jpg Things are about to get... creepy The votes are in for the event armor ornaments, and this year, players decided on two options, based on your class: spider-themed sets for Hunters and Titans and beetle-themed sets for Warlocks. {STEAM_CLAN_IMAGE}/35190912/2f28e4f8122164096f4b34463e5124071b57c673.jpg Wicked weapons Trick or treat your way to a new Acosmic Legendary Heavy Grenade Launcher and other Festival weapons—all ghoulishly good for blasting pumpkin-headed fiends into candy bits. {STEAM_CLAN_IMAGE}/35190912/25d50b9ba9fd0554cc180d88d54635a2600a8bd7.jpg A ghostly good time Brave your way through Haunted Sectors battling Headless Ones. Earn Eerie Engrams containing a variety of rewards, which you can then decrypt or focus them for Exotic armor and special Festival weapons. Legendary mode boosts your chance to get even more goodies! {STEAM_CLAN_IMAGE}/35190912/092e74d5e64165632edc9aa71bfbb2335a9eac13.jpg Lost, but not forgotten Complete the challenges on your Event Card to rack up tickets. Upgrade your Event Card to trade your tickets in for even more Festival of the Lost-themed rewards, including emblems, emotes, shaders, and ships. {STEAM_CLAN_IMAGE}/35190912/646bcb06bfd3ed5fae37782868c67c6b77314de8.jpg Summon a little Destiny into the real world Earn the chance to get your very own Headless Ones tote containing two Festival of the Lost pins, available through Bungie Rewards. ",
                "feedlabel": "Community Announcements",
                "date": 1697562031,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 1085660
            },
            {
                "gid": "5246188851835557750",
                "title": "Bungie is giving Destiny 2 players $45 of in-game currency to say sorry for accidentally banning them from the game",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/PC Gamer/5246188851835557750",
                "is_external_url": true,
                "author": "Andy Chalk",
                "contents": "common refrain from gamers caught cheating online is that they&apos;ve been falsely convicted of a crime they didn&apos;t commit. It&apos;s hard to know who&apos;s telling the truth and who&apos;s just lying, because of course you&apos;d lie if you were caught cheating. When we&apos;re lucky, the lies are exposed in a dramatic, <a href=\"https://www.pcgamer.com/call-of-duty-player-tries-to-prove-he-isnt-cheating-accidentally-proves-hes-cheating/\" target=\"_blank\">extremely funny</a> fashion. But sometimes the accused are telling the truth, and so it is that Bungie is now forking over 5,000 Silver to \"a small number\" of Destiny 2 players who were banned from the game for cheating, even though they weren&apos;t... <a href=\"https://www.pcgamer.com/bungie-is-giving-destiny-2-players-dollar45-of-in-game-currency-to-say-sorry-for-accidentally-banning-them-from-the-game?utm_source=steam&utm_medium=referral\" target=\"_blank\">Read more.</a>",
                "feedlabel": "PC Gamer",
                "date": 1697058369,
                "feedname": "PC Gamer",
                "feed_type": 0,
                "appid": 1085660
            },
            {
                "gid": "5220291886487807283",
                "title": "THIS WEEK IN DESTINY – 09/28/2023",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5220291886487807283",
                "is_external_url": true,
                "author": "rocksarerad",
                "contents": "Happy Twidsday, Guardians! We are back this week with some previews and new rewards to earn! How have you been enjoying the Season of the Witch story? How many Altars have you completed so far? Thoughts on Checkmate? Speaking of Checkmate, keep reading to learn about some changes coming soon! Make sure you’re sounding off on socials so our teams can read your feedback. Read more in our blog here.",
                "feedlabel": "Community Announcements",
                "date": 1695924422,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 1085660
            },
            {
                "gid": "5219165352624660334",
                "title": "DDoS attacks were the source of Destiny 2's server troubles this week",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/PC Gamer/5219165352624660334",
                "is_external_url": true,
                "author": "Jonathan Bolding",
                "contents": "n increase in Destiny 2 error code encounters earlier this week was caused by DDoS attacks, says developer Bungie. The attacks caused some players to be unable to log in or stay connected, and got worse over September 18 and 19&#x2014;by the evening of the 19th many couldn&apos;t play at all... <a href=\"https://www.pcgamer.com/ddos-attacks-were-the-source-of-destiny-2s-server-troubles-this-week?utm_source=steam&utm_medium=referral\" target=\"_blank\">Read more.</a>",
                "feedlabel": "PC Gamer",
                "date": 1695323262,
                "feedname": "PC Gamer",
                "feed_type": 0,
                "appid": 1085660
            },
            {
                "gid": "5480373588791289919",
                "title": "Update: 'Frankengun' Destiny glitch has been patched, hope you had your fun",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/PC Gamer/5480373588791289919",
                "is_external_url": true,
                "author": "Ted Litchfield",
                "contents": "<strong>Update:</strong> It was fun while it lasted, but Destiny 2&apos;s assault rifles and grenade launchers won&apos;t be blasting away like shotguns any more. A hotfix&#x2014;the first of several&#x2014;has disabled a selection of frames and perks on Exotic and Legendary crafted weapons, including \"Osteo Striga, Revision Zero, Dead Man&apos;s Tale, Dead Messenger, Vexcalibur, and all three Exotic class glaives\" <a href=\"https://twitter.com/bungiehelp/status/1703599535694680203\">Bungie has announced</a>... <a href=\"https://www.pcgamer.com/an-unprecedented-destiny-glitch-is-letting-players-craft-game-breaking-frankenguns-like-machine-gun-grenade-launchers-and-bungie-says-lets-all-have-some-fun?utm_source=steam&utm_medium=referral\" target=\"_blank\">Read more.</a>",
                "feedlabel": "PC Gamer",
                "date": 1694903071,
                "feedname": "PC Gamer",
                "feed_type": 0,
                "appid": 1085660
            },
            {
                "gid": "5480373588786116641",
                "title": "Destiny 2 is going to get rid of one of its currencies like it did with its content",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/VG247/5480373588786116641",
                "is_external_url": true,
                "author": "",
                "contents": "Bungie has announced in its latest <strong>Destiny 2</strong> <a href=\"https://www.bungie.net/7/en/News/article/twid_09_14_2023\">this Week at Bungie blog</a> a major change to the game's economy. Legendary Shards, one of the game's many, many currencies is going away. Bungie will be removing the currency entirely from the game with the launch of the next expansion, The Final Shape. However, changes will start taking place at the launch of Season 23, which is kicking off at the end of November. First, Legendary Shard costs will be removed from the Monument to Lost Lights. Then, non-Adept focusing will no longer cost Shards. Finally, all Legendary Shards will be remove with the release of the expansion. <a href=\"https://www.vg247.com/destiny-2-legendary-shards-removed\">Read more</a> ",
                "feedlabel": "VG247",
                "date": 1694780527,
                "feedname": "VG247",
                "feed_type": 0,
                "appid": 1085660
            },
            {
                "gid": "5480373588785736282",
                "title": "This Week In Destiny - 09/14/2023",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5480373588785736282",
                "is_external_url": true,
                "author": "Destiny 2 Team",
                "contents": "This week in Destiny, we have to talk about Legendary Shards. Check your Destiny 2 inventory—it's those purple spiky things you might have in the thousands (or tens of thousands). They look like weird, sour candy, right? Maybe they taste like grapes? Or blueberries? Oh, no, that's the kind of dark thought a Hive acolyte would have, and we are also missing the point here, so let's focus a bit and recap last week's TWID before jumping to the news: Final call for the Guardians for Maui fundraiser. Update from our PvP Strike team. Show us those Tessellation clips! New ritual armor sets. World First race winners interview. And this is the menu for today: We explain the process of Legendary Shard deprecation. Some new info and updates on the Crota's End raid. New PvP update previews for Seasons 22 and 23. Checkmate enters the Crucible Labs next week. Improved Trials weapon drops for wins. Tessellation shines bright in these community clips! The weekly Destiny Player Support report. Our latest Art of the Week and Movie of the Week picks. Got that? You can read the rest of the article here.",
                "feedlabel": "Community Announcements",
                "date": 1694771716,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 1085660
            }
        ],
        "count": 966
    }
}