{
    "appnews": {
        "appid": 1085660,
        "newsitems": [
            {
                "gid": "5219165352624660334",
                "title": "DDoS attacks were the source of Destiny 2's server troubles this week",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/PC Gamer/5219165352624660334",
                "is_external_url": true,
                "author": "Jonathan Bolding",
                "contents": "n increase in Destiny 2 error code encounters earlier this week was caused by DDoS attacks, says developer Bungie. The attacks caused some players to be unable to log in or stay connected, and got worse over September 18 and 19&#x2014;by the evening of the 19th many couldn&apos;t play at all... <a href=\"https://www.pcgamer.com/ddos-attacks-were-the-source-of-destiny-2s-server-troubles-this-week?utm_source=steam&utm_medium=referral\" target=\"_blank\">Read more.</a>",
                "feedlabel": "PC Gamer",
                "date": 1695323262,
                "feedname": "PC Gamer",
                "feed_type": 0,
                "appid": 1085660
            },
            {
                "gid": "5480373588791289919",
                "title": "Update: 'Frankengun' Destiny glitch has been patched, hope you had your fun",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/PC Gamer/5480373588791289919",
                "is_external_url": true,
                "author": "Ted Litchfield",
                "contents": "<strong>Update:</strong> It was fun while it lasted, but Destiny 2&apos;s assault rifles and grenade launchers won&apos;t be blasting away like shotguns any more. A hotfix&#x2014;the first of several&#x2014;has disabled a selection of frames and perks on Exotic and Legendary crafted weapons, including \"Osteo Striga, Revision Zero, Dead Man&apos;s Tale, Dead Messenger, Vexcalibur, and all three Exotic class glaives\" <a href=\"https://twitter.com/bungiehelp/status/1703599535694680203\">Bungie has announced</a>... <a href=\"https://www.pcgamer.com/an-unprecedented-destiny-glitch-is-letting-players-craft-game-breaking-frankenguns-like-machine-gun-grenade-launchers-and-bungie-says-lets-all-have-some-fun?utm_source=steam&utm_medium=referral\" target=\"_blank\">Read more.</a>",
                "feedlabel": "PC Gamer",
                "date": 1694903071,
                "feedname": "PC Gamer",
                "feed_type": 0,
                "appid": 1085660
            },
            {
                "gid": "5480373588786116641",
                "title": "Destiny 2 is going to get rid of one of its currencies like it did with its content",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/VG247/5480373588786116641",
                "is_external_url": true,
                "author": "",
                "contents": "Bungie has announced in its latest <strong>Destiny 2</strong> <a href=\"https://www.bungie.net/7/en/News/article/twid_09_14_2023\">this Week at Bungie blog</a> a major change to the game's economy. Legendary Shards, one of the game's many, many currencies is going away. Bungie will be removing the currency entirely from the game with the launch of the next expansion, The Final Shape. However, changes will start taking place at the launch of Season 23, which is kicking off at the end of November. First, Legendary Shard costs will be removed from the Monument to Lost Lights. Then, non-Adept focusing will no longer cost Shards. Finally, all Legendary Shards will be remove with the release of the expansion. <a href=\"https://www.vg247.com/destiny-2-legendary-shards-removed\">Read more</a> ",
                "feedlabel": "VG247",
                "date": 1694780527,
                "feedname": "VG247",
                "feed_type": 0,
                "appid": 1085660
            },
            {
                "gid": "5480373588785736282",
                "title": "This Week In Destiny - 09/14/2023",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5480373588785736282",
                "is_external_url": true,
                "author": "Destiny 2 Team",
                "contents": "This week in Destiny, we have to talk about Legendary Shards. Check your Destiny 2 inventory—it's those purple spiky things you might have in the thousands (or tens of thousands). They look like weird, sour candy, right? Maybe they taste like grapes? Or blueberries? Oh, no, that's the kind of dark thought a Hive acolyte would have, and we are also missing the point here, so let's focus a bit and recap last week's TWID before jumping to the news: Final call for the Guardians for Maui fundraiser. Update from our PvP Strike team. Show us those Tessellation clips! New ritual armor sets. World First race winners interview. And this is the menu for today: We explain the process of Legendary Shard deprecation. Some new info and updates on the Crota's End raid. New PvP update previews for Seasons 22 and 23. Checkmate enters the Crucible Labs next week. Improved Trials weapon drops for wins. Tessellation shines bright in these community clips! The weekly Destiny Player Support report. Our latest Art of the Week and Movie of the Week picks. Got that? You can read the rest of the article here.",
                "feedlabel": "Community Announcements",
                "date": 1694771716,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 1085660
            },
            {
                "gid": "5480373588783633307",
                "title": "Destiny 2 is going to delete one of its main currencies because players used exploits to stockpile too much",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/PC Gamer/5480373588783633307",
                "is_external_url": true,
                "author": "Tim Clark",
                "contents": "There must be an almost erotic thrill to eliminating an entire currency at the click of a button. That&apos;s what is going to happen in Destiny 2 at the end of November when Season 23 launches. Bungie today announced that it will be completely deprecating Legendary Shards, which are a material used to pay for all sorts of items in the game. Unlike previous material deprecations, the studio also said that it will not be offering anything by way of compensation. Legendary Shards are just going to be gone... <a href=\"https://www.pcgamer.com/destiny-2-is-going-to-delete-one-of-its-main-currencies-because-players-used-exploits-to-stockpile-too-much?utm_source=steam&utm_medium=referral\" target=\"_blank\">Read more.</a>",
                "feedlabel": "PC Gamer",
                "date": 1694721810,
                "feedname": "PC Gamer",
                "feed_type": 0,
                "appid": 1085660
            },
            {
                "gid": "5141476355658745350",
                "title": "Bungie is determined to bribe me into running Destiny 2's new raid this weekend",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/PC Gamer/5141476355658745350",
                "is_external_url": true,
                "author": "Tim Clark",
                "contents": "Recently, my Destiny 2 clanmates and I took the healthy and responsible decision not to participate in the next raid race. The way things work in Destiny 2 is that for the first 48 hours of any new or reprised raid a modifier called &apos;Contest Mode&apos; is active, during which time player power is capped 20 levels under the enemies in each encounter. Result: you deal less damage and take much more. For those who don&apos;t have a well-drilled fireteam and meta loadouts, the experience is bracing&#x2014;particularly as fatigue creeps in, and the tempers of old gamers with decaying thumb skill begin to fray... <a href=\"https://www.pcgamer.com/bungie-is-determined-to-bribe-me-into-running-destiny-2s-new-raid-this-weekend?utm_source=steam&utm_medium=referral\" target=\"_blank\">Read more.</a>",
                "feedlabel": "PC Gamer",
                "date": 1693514121,
                "feedname": "PC Gamer",
                "feed_type": 0,
                "appid": 1085660
            },
            {
                "gid": "5141476355658404707",
                "title": "This Week In Destiny – 08/31/2023",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5141476355658404707",
                "is_external_url": true,
                "author": "rocksarerad",
                "contents": "This week in Destiny, Crota is back in all his rotating, crotating glory. We're stoked to watch you take him on, but we'll get to that in a minute. Read more on our blog here.",
                "feedlabel": "Community Announcements",
                "date": 1693506459,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 1085660
            },
            {
                "gid": "5141476355654129145",
                "title": "How to complete Metamorphosis Attunement in Destiny 2",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/PC Gamer/5141476355654129145",
                "is_external_url": true,
                "author": "Sean Martin",
                "contents": "Completing <strong>Metamorphosis Attunement</strong> in Destiny 2 is a key step in the new seasonal storyline, as you pick an element to focus as part of the Bladed Path quest. This might seem like a waste of time initially, but gaining each of the three attunements allows you to pick up the elemental <a href=\"https://www.pcgamer.com/destiny-2-opaque-card-locations-deck-of-whispers/\" target=\"_blank\"> Opaque Cards </a> scattered throughout the Savathun&apos;s Spire activity... <a href=\"https://www.pcgamer.com/destiny-2-metamorphosis-attunement-bladed-path?utm_source=steam&utm_medium=referral\" target=\"_blank\">Read more.</a>",
                "feedlabel": "PC Gamer",
                "date": 1693405079,
                "feedname": "PC Gamer",
                "feed_type": 0,
                "appid": 1085660
            },
            {
                "gid": "5141476355651783327",
                "title": "DESTINY 2: THE FINAL SHAPE + ANNUAL PASS - Pre-Order Today",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5141476355651783327",
                "is_external_url": true,
                "author": "Destiny 2 Team",
                "contents": "Pre-order today The Final Shape has been revealed and the Witness’s plans have almost been brought to fruition. This is the hardest challenge you have faced yet, but you won't be alone. Ikora Rey, Commander Zavala, and even a mysteriously returned Cayde-6 will be at your side, ready to walk a path of remembrance and discovery through The Pale Heart of the Traveler itself. The main story of The Final Shape will be told throughout the course of its campaign, which you will be able to complete with increased difficulty and rewards in the Legendary campaign. Players will explore the familiar yet unsettling panoramas of The Pale Heart, the first linear destination in Destiny 2. When the campaign has been completed, there's plenty more coming. In the new raid, Guardians will confront the Witness head on and try to break its hold on The Pale Heart. But even that might not be enough... the culmination of the Light and Darkness Saga is upon us, and all Guardians must answer the call if we want to overcome The Final Shape and the Witness once and for all. The time has come, Guardians. Rally the Vanguard, raise your Light, wield your Darkness, and become legend.",
                "feedlabel": "Community Announcements",
                "date": 1693349531,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 1085660
            },
            {
                "gid": "5141475722345822097",
                "title": "Joe Blackburn on Destiny 2 conspiracy theories, what happened to the PvP team, and The Witness being able to 1v1 anyone in the universe",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/PC Gamer/5141475722345822097",
                "is_external_url": true,
                "author": "Tim Clark",
                "contents": "It&apos;s been two weeks since the mood music in Destiny 2 got so bad that game director Joe Blackburn took to his personal Twitter to deliver a <a href=\"https://twitter.com/joegoroth/status/1691512349398822914\"> video message </a> addressing various community complaints and concerns. For a studio that tends to deal in lengthy blog posts, such a personal approach only underlined the perceived urgency of the situation. Ironically, the latest meltdown had been triggered by one such &apos;State of the Game&apos; post, which, rather than allaying concerns, had air-dropped petrol onto them... <a href=\"https://www.pcgamer.com/joe-blackburn-on-destiny-2-conspiracy-theories-what-happened-to-the-pvp-team-and-the-witness-being-able-to-1v1-anyone-in-the-universe?utm_source=steam&utm_medium=referral\" target=\"_blank\">Read more.</a>",
                "feedlabel": "PC Gamer",
                "date": 1693326388,
                "feedname": "PC Gamer",
                "feed_type": 0,
                "appid": 1085660
            }
        ],
        "count": 960
    }
}