{
    "appnews": {
        "appid": 1938090,
        "newsitems": [
            {
                "gid": "5288974951207101331",
                "title": "Modern Warfare III Campaign Early Access is live now!",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5288974951207101331",
                "is_external_url": true,
                "author": "RedBruto",
                "contents": "Play the Campaign up to a week early* by pre-purchasing any digital edition of Modern Warfare III. Jump in to play the new action-packed story and dive into some of the new Open Combat Missions, in addition to the signature, cinematic Call of Duty campaign missions. Earn rewards for Modern Warfare III multiplayer by completing the Campaign, including new Calling Cards, Operators, Double XP Tokens, and more! *Actual play time subject to possible outages and applicable time zone differences.",
                "feedlabel": "Community Announcements",
                "date": 1698944444,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 1938090
            },
            {
                "gid": "5288974951204284322",
                "title": "Call of Duty: Modern Warfare III Campaign: How to Play",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5288974951204284322",
                "is_external_url": true,
                "author": "csmedley",
                "contents": "{STEAM_CLAN_IMAGE}/42501705/178cd2ae5e1c33b359ad1282ed55fbc83f40a8d7.png A direct sequel: Modern Warfare III picks up immediately after the events of Modern Warfare II. Join Captain Price and Task Force 141 as they face off against the ultimate threat, ultranationalist Vladimir Makarov. Open Combat Missions: New Open Combat Missions redefine the traditional Campaign level. Deploy to wide-open locations and gear up with Supply Boxes, Armor Plates, Vests, and more. Take a stealthy approach or grab a vehicle and drive head-on into danger. Mission completion rewards: Earn over a dozen in-game rewards for completing the Campaign, including new Calling Cards, Operators, Double XP Tokens, and a special Multiplayer Weapon Blueprint unlocked at game launch for Campaign completion. From COD HQ, head to the Modern Warfare III section and select the Campaign tile. Even though the game has already launched, we don’t want to spoil anything about it. Follow the prompts when starting the Campaign to choose your difficulty setting and then get right to it. The game will tell you everything you need to know to get started. Prepare for a wild ride. Choose Your Difficulty Level The Modern Warfare III Campaign features four difficulty levels. The higher the difficulty level, the greater the challenge. Note that you can change the game’s difficulty level at any time. Recruit: For players who are new to Call of Duty. Regular: Your abilities in combat will be tested. Hardened: Your skills will be strained. Veteran: You will not survive. Campaign Mission Rewards {STEAM_CLAN_IMAGE}/42501705/77fce7298aa3c5d0d2a61e86d182060e9af690eb.jpg The Campaign consists of 14 different missions. All but one of these missions reward players with the following items upon completion: Operation 627: “Breather” Calling Card Precious Cargo: 30 mins Double Player XP Token & 30 mins Double Weapon XP Token Reactor: “Corso” Operator Payload: “Ghillie Guy” Calling Card Deep Cover: 30 mins XP Token and 30 mins Weapon XP Token Passenger: N/A Crash Site: “Pathfinder” Operator Flashpoint: “Toxic Drip” Calling Card Oligarch: 1 hour Double Player XP Token and 1 hour Double Weapon XP Token Highrise: “Doc” Operator Frozen Tundra: “Skull Rhapsody” Calling Card Gora Dam: 1 hour Double Player XP Token and 1 hour Double Weapon XP Token Danger Close: “Jabber” Operator Trojan Horse: Campaign Completion Emblem and Weapon Blueprint Open Combat Missions Modern Warfare III introduces Open Combat Missions (OCMs), which occur throughout the Campaign alongside more traditional single-player missions. OCMs redefine player agency, offering an unparalleled degree of freedom and greatly expanding the playable area. {STEAM_CLAN_IMAGE}/42501705/714c5d0ad836f77f2500d35c904f6695477bc20e.png Fixed objective, endless possibilities: You’re there to complete the mission, but how you do it is up to you. Slip through like a shadow or go in loud and start blasting. Scavenge extra gear throughout the AO to suit your preferred playstyle. Seek out essential gear: While seeking out new weapons, Armor Plates, and other items, keep your eyes peeled for Ziplines and Ascenders. Often near objective locations, these items skyrocket your movement potential across the map. But they were just here: Caught off guard and outnumbered? Retreat into the environment, using your Ascender and Parachute to quickly get out of view. If the enemy loses sight of you for long enough, they will eventually stop their direct pursuit, and resort to searching the vicinity for you. Your Operator {STEAM_CLAN_IMAGE}/42501705/514c18e6b2857ad2d40efb2a869a965e0f663055.jpg Open Combat Missions require the best of the best. In each mission, you will deploy as a designated member of Task Force 141: Farah, Ghost, Gaz, Soap, or Price. In your first playthrough of an OCM, your Operator is assigned a starting Loadout according to the mission’s narrative, including the Spotter Scope to better scan the environment for enemy threats, tagging enemies, locating equipment, and discovering information about points of interest. One of your first tasks is to seek out better gear, of which there is an abundance, found throughout the area of operations. Gear Up Expect to find all sorts of useful items in OCMs, including new weapons, Equipment, Field Upgrades, and even Armaments (that Multiplayer Operators know as “Killstreaks”) that will boost your offensive and defensive capabilities. Of particular importance, however, are the Parachute, Ascender, and Armor Plate Carrier upgrades. {STEAM_CLAN_IMAGE}/42501705/2800a6efe49669de5b8f726949c1e7bfeb6fe574.jpg Parachute: The Parachute is a game changer, allowing you to safely jump from great heights and soar over long distances. Follow the button prompt when jumping from a high point to activate the Parachute. When you’re close to landing, your Operator will automatically cut the rope and return to a standing position, or you can cut the cord manually to force a landing. Ascender: Going up! The Ascender helps you reach the highest points on the map. With this item, you can zip up ropes that lead to places in key positions throughout the environment, or ziplines to move across long horizontal distances. Use your elevated or newly-acquired position to escape a problematic situation, snipe from a distance, or, if you’ve got the Parachute, reposition far from your current location. Plate Carrier Upgrade Vest: Initially, your Operator can only equip one Armor Plate at a time, a reasonable-enough defense in minor battles but lacking when the action gets hectic. Find a Plate Carrier Upgrade Vest to increase the number of Armor Plates you can equip at a time. When you first find the Vest, your carrying capacity will increase to two Armor Plates, and then three after finding another one. Now you’re ready for anything. Getting Around: Your Tac Map and Minimap {STEAM_CLAN_IMAGE}/42501705/28204aa4b74705753a9b533d461d0550e046447a.jpg Tac Map The Tac Map is of essential importance, providing an overview of the objective and its location. A legend indicates the position of important items, and a tracker shows your most important gear and the weapons and items you’ve discovered in the level. When first deploying into an OCM, the majority of the Tac Map will be covered in a fog of war. As you explore the environment, the fog will be lifted, revealing greater environmental detail. Minimap Use the minimap to pinpoint items in your immediate surroundings without needing to pull up your Tac Map. Discovered weapons, Supply Boxes, Field Upgrades, and other Armaments will be displayed here along with the objective location and other points of interest. Enemy Alert Levels: The minimap is also your cue to the enemy’s current alert level. When you’ve been seen, the borders will turn yellow, indicating that they are aware of something in the vicinity without knowing your exact location. If found — or if you initiate the attack — the borders will turn red to show that they know where you are. At this time, an enemy may even throw the alarm to call in reinforcements. {STEAM_CLAN_IMAGE}/42501705/198f7805c2a977457e2bd25e2a66374f186d4ba3.jpg The enemies themselves also follow this color-coded system. Red dots on the minimap indicate enemies rushing to engage in combat, while yellow dots represent enemies on the lookout. With fast movement and clever repositioning, it’s possible to get out of the alert state. Red will revert to yellow when they’ve lost you but are still on guard for your whereabouts, and then will return to a less aggressive state if you continue to remain out of sight. At this point, you can resume your stealth operations, or just get into a better position before going guns blazing again. Play It Again OCMs reward exploration and repeated playthroughs with weapons and items found throughout the level. When you replay an OCM, you get to customize your starting Loadout based on the weapons and items you’ve found in previous playthroughs. Start the mission with your Parachute and Ascender already in hand, plus any extra Armor Plate carrying capacity earned through Vests. Use your enhanced starting gear to push into higher difficulty levels and/or try out new tactics. Top 5 Tips for Open Combat Missions {STEAM_CLAN_IMAGE}/42501705/338f0786baf1363bc8d92008d45eb65276e2a3c1.jpg 1. There’s always another way. Grab a vehicle and race past the sentries straight to the objective; dive into the water and reposition out of sight; use your Parachute to soar over enemy encampments. OCMs offer endless possibilities in how you approach the task at hand. If something’s not working, revisit your tactics and take a new approach. 2. The right gear for the job. While at first, you’ll need to make do with the gear you’re provided, with enough exploration and scavenging, you’ll soon a wider variety of equipment that can best suit your style of play. If you’re going stealth, Throwing Knives and a Recon Drone are better choices than Frag Grenades and unsuppressed weapons and vice versa. 3. Know your enemy. Even if you’re not going the stealth route, it pays to stay out of sight and scout nearby enemy positions. Look for red vehicles on the minimap indicating enemy patrols, and scan the horizon for snipers and other threats you might miss when rushing straight in. Regardless of your approach, that intel will help you make better decisions in the heat of the moment. 4. Build up your arsenal. OCMs encourage replayability through the accumulation of weapons and items found in the level. Use your arsenal to build out the perfect Loadout on subsequent playthroughs and get right to the task at hand without first needing to scavenge for the proper supplies. 5. Ramp up the challenge. Use your expanded arsenal on subsequent playthroughs to push into higher difficulty levels. Tackling an OCM on Veteran is much more manageable when deploying with your preferred Loadout. Stay frosty. © 2023 Activision Publishing, Inc. ACTIVISION, CALL OF DUTY, and MODERN WARFARE are trademarks of Activision Publishing, Inc. All other trademarks and trade names are the property of their respective owners. For more information, please visit www.callofduty.com and www.youtube.com/callofduty, and follow @Activision and @CallofDuty on X, Instagram, and Facebook. For Call of Duty Updates, follow @CODUpdates on X. ",
                "feedlabel": "Community Announcements",
                "date": 1698877682,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 1938090,
                "tags": [
                    "mod_reviewed",
                    "ModAct_487791598_1698882936_0",
                    "mod_require_rereview"
                ]
            },
            {
                "gid": "5288974951203169819",
                "title": "Get ready for Campaign Early Access!",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5288974951203169819",
                "is_external_url": true,
                "author": "RedBruto",
                "contents": "{STEAM_CLAN_IMAGE}/42501705/ffa9b86eb3880a76bd9e25d6e232eccc69a9d987.jpg Play the Campaign up to a week early* by pre-purchasing any digital edition of Modern Warfare III. In the direct sequel to the record-breaking Call of Duty®: Modern Warfare® II, Captain Price and Task Force 141 face off against the ultimate threat. The ultranationalist war criminal Vladimir Makarov is extending his grasp across the world causing Task Force 141 to fight like never before. *Actual play time subject to possible outages and applicable time zone differences.",
                "feedlabel": "Community Announcements",
                "date": 1698851269,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 1938090,
                "tags": [
                    "mod_reviewed",
                    "ModAct_1400956464_1698856184_0",
                    "mod_require_rereview"
                ]
            },
            {
                "gid": "5229301621594999636",
                "title": "Multiplayer Maps and Modes: What You Need to Know",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5229301621594999636",
                "is_external_url": true,
                "author": "csmedley",
                "contents": "{STEAM_CLAN_IMAGE}/42501705/48cfacf08e86f99845716906daa57e8f58ea123a.jpg Expect the following launch modes scheduled for rotation in the available Playlists, with more Standard and Alternate Modes being added in the following weeks. 3v3v3 Mode {STEAM_CLAN_IMAGE}/42501705/02a5571538e5ae1bd1fb4036c257e71d8226e3b1.jpg Cutthroat: Three teams go head to head . . . to head. First team to reach the round win limit wins. 6v6 Modes {STEAM_CLAN_IMAGE}/42501705/7ced695190a1b027d46cbfa4ec14acb6bb47a6d6.jpg Team Deathmatch: An exercise in attrition. Eliminate enemy players until the score limit is reached to win. {STEAM_CLAN_IMAGE}/42501705/34297aac81855b2afa46b9ccbceaf21b6b669ee6.jpg Domination: Capture, hold and defend objectives to earn points. First team to the score limit wins. {STEAM_CLAN_IMAGE}/42501705/9b6c8e55db40609b020aeed1740ffe3e33f45fa5.jpg Search & Destroy: Teams alternate between detonating and defusing a bomb. No respawns. {STEAM_CLAN_IMAGE}/42501705/1fcfccaf43d018374fe6d2a9875293cdce42cb90.jpg Kill Confirmed: Recover dog tags to score for your team and deny enemy scores. {STEAM_CLAN_IMAGE}/42501705/de4a592b34409f870aa6009dbd4ec5af2a91c185.jpg Free-For-All: Defeat everyone. The first player to reach the score limit ends the game. The top three players win. {STEAM_CLAN_IMAGE}/42501705/92a4de07c8e301e0d8647b892b8308e64ef6cb60.jpg Hardpoint: Capture the Hardpoint and hold it against attack. The first team to reach the score limit wins. {STEAM_CLAN_IMAGE}/42501705/d792643d90c0a01813eb72708cef56e74bbe7545.jpg Control: Take turns attacking and defending the objective. War: Progress through linear objectives to push the battle line and win. {STEAM_CLAN_IMAGE}/42501705/50ae2d689f303b887aa351c4d89bdc640a39d44d.jpg Gun Game: Be the first player to score a kill with each one of the provided weapons. 32v32 Modes {STEAM_CLAN_IMAGE}/42501705/790503f14eae06906dcfa7c34d97da6136b8b936.jpg Ground War: Large-scale conflict featuring vehicles. Capture and hold objectives to score. Captured objectives open forward spawning locations for your team. {STEAM_CLAN_IMAGE}/42501705/c0992e49ee0288c67b9dc9e6a37f68d2c68340c1.jpg Invasion: A massive and chaotic battle with a mix of Players and AI fighting alongside each other and against each team. Additional Mode Intel {STEAM_CLAN_IMAGE}/42501705/f31b403c2599ec19e5c73b79702baec6a712dc05.jpg Hardcore: Features a limited HUD, low health, friendly fire enabled, and other changes to gameplay; this is also scheduled for launch. The Firing Range: This returns with the familiar three-dummy corridor to practice in. Bring in any Loadout, swapping weapons, modifications, and your Perks (Vest, Gloves, Boots and Gear) while you practice. The usual shelving and bars allow you to mount and fire at different heights. {STEAM_CLAN_IMAGE}/42501705/ba547d1d52ac2377d70674a511ec91020630edd8.jpg Private Matches (Training and Benchmark): As ever, Private Matches are a great way to look through (and tweak) all the game settings for every type of mode, and they allow you to explore the available maps. In addition, expect a Training Course where you can learn basic movements and combat skills as you navigate one of the launch Core 6v6 maps as a solo player. Play: Launch Maps (Multiplayer) An impressive number of modernized Modern Warfare 2 (2009) maps are part of the initial map pool, along with three Ground War maps (based on points of interest within the Urzikstan Big Map) and a linear section of the massive Urzikstan itself (War mode). {STEAM_CLAN_IMAGE}/42501705/7a309916d8d1ecc8daef6e699d55d18627f25bc2.jpg Afghan (Core): Battle in the arid desert canyons around a crash site, encircled by bunkers and cliffside anti-air batteries poised to take down incoming aircraft. The uneven terrain presents risk and opportunity, from the high cliff face above to the dark cave below. {STEAM_CLAN_IMAGE}/42501705/406b8cfd3fc32479a5f69733193e29aa9693f40b.jpg Derail (Core): Snow blankets the forest surrounding a railway town and its facilities. At the center, a trainwreck has scattered railcars over the landscape. Take the lead on this large map and leave your enemies out cold in the woods. {STEAM_CLAN_IMAGE}/42501705/ebb51e2334899585877480cb549bb89840f1cbf8.jpg Estate (Core): Head to a secluded getaway in the Caucasus Mountains, where a pristine lodge overlooks an expansive woodland property. Fight from the main living quarters or utilize the various outbuildings and fields to engage enemies from the perimeter. {STEAM_CLAN_IMAGE}/42501705/57ff9ea074876bff97c2bc325664489388e16be4.jpg Favela (Core): Drop into the slums of Rio de Janeiro as bystanders scramble to escape the scene of the oncoming skirmish. Brave the tightly clustered center, fire down on enemies from the rooftops, or stick to the perimeter and eliminate enemies from afar. {STEAM_CLAN_IMAGE}/42501705/d654cc2e4f8bf127d0d76f5dae4cf10cf54d38ff.jpg Highrise (Core): Whatever you do, don’t look down. This midsized map consists of two opposite facing buildings over a central rooftop worksite. Tunnels wind below the surface and an imposing Helipad offers access to some of the map’s best vantage points alongside other perilous crossings for the brave and foolhardy. {STEAM_CLAN_IMAGE}/42501705/8d67728cba94e2a2e5b267828f8fa3fba499f5fa.jpg Invasion (Core): Deploy to a battle-torn, medium-sized Multiplayer map featuring tightknit buildings, close street fighting, and long-distance vantage points. In this urban layout, Operators must act fast and smart, turning the map’s risks into advantages. {STEAM_CLAN_IMAGE}/42501705/35384f3e7feed29022f83ab60fd22cd3681a1f85.jpg Karachi (Core): Keep your eyes sharp and your head on a swivel; this map challenges Operators with a compact urban setting packed with climbing opportunities and routes for every playstyle. A keen understanding of the layout will help you prepare for your next drop into this medium-sized Multiplayer map. {STEAM_CLAN_IMAGE}/42501705/8d3ec73e9f4bc33802e769f50c8efeb7ff9fe548.jpg Quarry (Core): This open-pit mine in a wide-open map features plenty of long-distance fights down the center Crane and side lanes. Quarry is punctuated by close-range battles in the offices and warehouses. Climbing opportunities abound. Or bring the fight indoors where multilevel buildings provide room to move and windows that overlook huge swaths of the map. {STEAM_CLAN_IMAGE}/42501705/ef9f521a906d23c602b1b521a42ab09a01d11280.jpg Rundown (Core): Infiltrate a South American village where a low-running river divides the main settlement from its more sparsely populated Outback. Group your forces when attempting to make a crossing and watch those corners when weaving through the cluster of buildings. {STEAM_CLAN_IMAGE}/42501705/80997e283721212700a552ccb4436b8756e56d00.jpg Rust (Core): Located in the oil fields of the Urzikstan desert, Rust is a small, square map dominated by its central tower. Fight for your spot up top or use the map’s various obstacles to stay out of sight while you skirmish on the ground. {STEAM_CLAN_IMAGE}/42501705/30a065f52023dcb675b74b9631decf614565be54.jpg Scrapyard (Core): Battle in an aircraft boneyard surrounded by buildings overlooking the wreckage within. Flank enemies by racing through the fuselages and watch your head when sniper battles erupt between the two main warehouses. {STEAM_CLAN_IMAGE}/42501705/7d6057313115584ef7e613f9ad4760471820e8bf.jpg Skidrow (Core): Deploy to a midsized urban landscape dominated by the central block. Smaller buildings around the perimeter provide further vantage points, and the streets throughout give savvy Operators the means to flank and outmaneuver their enemies. {STEAM_CLAN_IMAGE}/42501705/9800379895b1a44b48d2243568fc9db4cc9589a1.jpg Sub Base (Core): Submarines dock for maintenance and refueling at a naval base on the high seas. Deploy dockside and battle for control over the locale — a midsized map packed with vantage points, flanking routes, and a deadly center ground where only the most stalwart Operators dare pass. {STEAM_CLAN_IMAGE}/42501705/e89dab9dea61a8f4f9a83cf1e4bd27be8bc3cc10.jpg Terminal (Core): Infiltrate an International Airport and battle across one of the most infamous locales of all. Try your luck inside the terminal or take the fight to the Apron. All playstyles have their place on this midsized, classic Multiplayer map, so gear up how you want and get ready for departure. {STEAM_CLAN_IMAGE}/42501705/535ec23a59c3dd7fb6e9231d233c80fd6dabfadb.jpg Underpass (Core): Pouring rain has transformed this run-down South American industrial sector into a mud bath, but that won’t stop Operator skirmishes. Tromp through the mud, stage an ambush, or test your luck on the rain-slicked rooftops. In this large environment, your climbing and ambush options are nearly endless. {STEAM_CLAN_IMAGE}/42501705/103a49f4b8eb7a2c334def05bb00da4b871e20a1.jpg Wasteland (Core): Battle across an abandoned Wasteland, where wide-open fields encourage sniper battles all around. If extreme close range is more your speed, try your luck in the Dugout, a tight underground crossroads where all trenches meet in the middle. {STEAM_CLAN_IMAGE}/42501705/9e346b675c048d1fdac010206397c587308a99ad.jpg Levin Resort (Ground War): Tourists and business travelers alike used to flock to the Levin Resort, enjoying the poolside seating and abundant shopping and services within. It’s now a vacant site, the nearby statues of General Barkov defaced following his downfall. Tread carefully through the resort courtyard, where vantage points from multiple angles present danger to those below. {STEAM_CLAN_IMAGE}/42501705/4372ff4d369ce7bae141694a84ad55aad54d329c.jpg Orlov Military Base (Ground War): Missile silos lie at the heart of the Orlov Military Base alongside bunkers and facilities built into the mountainous terrain that dominates the northern portion of the map. Scattered barricades throughout provide squads with a means of defense when pushing into the area. {STEAM_CLAN_IMAGE}/42501705/33612ee198e787569e607ac84ebe4aaadb1bf61f.jpg Popov Power (Ground War): The workhorse of Urzikstan, Popov Power supplies energy to the growing region. Fight around the plant’s cooling towers and containment structures and utilize the full run of its industrial buildings to flank and ambush enemy squads. {STEAM_CLAN_IMAGE}/42501705/a1af50d7c9e2b5b04615ac7416a766d2cefe2b82.jpg Operation: Spearhead (War Mode): At launch, the first location within Operation Spearhead is the large-scale Urzikstan map, inside a linear corridor within the Orlov Military Base and Kadurin Silo. Clear anti-aircraft defenses so armored vehicles can be airdropped, staying close to the armor to break through to the launch site and set up missile overrides in this thrilling 6v6 battle! Modern Warfare II: Carry Forward Maps {STEAM_CLAN_IMAGE}/42501705/b31871315bcb1e56eb93fbc641af6ff08a12e4ca.jpg To further augment an already-impressive selection of Core 6v6 maps, we are excited to announce that a number of fan-favorite Modern Warfare II maps will gradually become available to play in Modern Warfare III throughout the live seasons. The initial selection — scheduled to be four Core 6v6 maps that include Farm 18, Mercado, and Shoot House — will become available shortly after launch in a dedicated Playlist, and more will follow throughout the Live Seasons. Here's some beneficial intel about these additions: These maps are graphically identical to how they appeared in MWII, and due to the innovations to movement and general gameplay mechanics present in MWIII, you may find that they play in an altogether different manner. These maps are completely additive, meaning they are scheduled to appear in addition to a full complement of new (and remastered) seasonal maps and other content. New MWIII modes (such as Cutthroat) will not be playable on these Carry Forward MWII maps. Operators: SpecGru and KorTac Reinforcements {STEAM_CLAN_IMAGE}/42501705/40635dc84b50ba2fa96cdca65fc08028d9717cc2.jpg Expect 25 additional Modern Warfare III Operators (13 SpecGru, 12 KorTac) to bolster the Operator pool, allowing you to select from a total of over 90 different Operators across MWII and MWIII. Some Operators are instantly accessible. Locked Operators can be unlocked via in-game challenges or purchased in-Store. Any MWII Operators you have acquired will be carried forward and can be used in MWIII. Read more about Carry Forward here. {STEAM_CLAN_IMAGE}/42501705/2f9be7d7bf62fc678f3dd5a5a4289222b48bc8ba.jpg SpecGru Operators (13): Price: Nemesis Reactive Skin available via MWIII Vault Edition purchase. Ghost: Nemesis Reactive Skin available via MWIII Vault Edition purchase. Blueprint (Mil-Sim): Initially available. Rocket (Mil-Sim): Initially available. Byline: Unlocked after completing a challenge in Multiplayer. Scorch: Unlocked after completing a challenge in Modern Warfare Zombies. Ripper: Unlocked after completing a challenge in Modern Warfare Zombies. Pathfinder: Unlocked after completing a Campaign Challenge. Warrior: Available after purchasing the Call of Duty Endowment “Warrior” Pack, available November 10. Riptide: Unlocked after completing a challenge in Multiplayer. BBQ: Unlocked after completing a challenge in Multiplayer. Jabber: Unlocked after completing a Campaign Challenge. Jet: Unlocked after completing a challenge in Multiplayer. KorTac Operators (11):          Warden: Operator and Nemesis Reactive Skin available via MWIII Vault Edition purchase.          Makarov: Operator and Nemesis Reactive Skin available via MWIII Vault Edition purchase. Blaze (Mil-Sim): Initially available. Thirst (Mil-Sim): Initially available. Alpine: Unlocked after completing a challenge in Multiplayer.          Enigma: Unlocked after completing a challenge in Multiplayer. Bantam: Unlocked after completing a challenge in Multiplayer.          Doc: Unlocked after completing a Campaign Challenge.          Raptor: Unlocked after completing a challenge in Multiplayer. Corso: Unlocked after completing a Campaign Challenge. Swagger: Unlocked after completing a challenge in Multiplayer. Operator Customization: Select the Operator (whether from MWII or MWIII) from the main menu to check out their Customization Options, like additional Skins, Finishing Moves and biographical information. Modern Warfare III Launch Comms Continues Be sure to check back at the Call of Duty Blog between now and launch, as we confirm in-game content and offer deep dives on both Multiplayer and Zombies. Here’s what to expect prior to November 10: Blog 1: Pre-Season Preparation: A look back at Intel Drops, confirmation of Preload and Early Access Times, and confirmation of the rewards you receive for playing the Campaign. Blog 2: Mapping Out Multiplayer: You’re reading this Blog! Blog 3: Fully Equipped: A Deep Dive into Loadouts (MP, MWZ): Gear up for the evolution of Perks, with detailed confirmation on all the launch Equipment, including Vests, Gloves, Boot, and Gear. Tacticals, Lethals, Field Upgrades, and Killstreaks are also confirmed. Blog 4: Upping Your Arsenal: Primary and Secondary Weapons (MP, MWZ): All launch weapons are confirmed, including Aftermarket Parts, and a weapon-balancing pass. The Gunsmith receives a statistical overhaul, and we break this all down for you. Blog 5: Cosmetic Customization: Weapon Camos (MP, MWZ): Could this be the biggest weapon progression feature in Call of Duty history? We detail the immense Multiplayer and Zombies Camo Challenge and Weapon Mastery system for your MWII and MWIII arsenal! Blog 6: Modern Warfare Zombies: Launch Content Overview: Join Operation Deadbolt, learning about the Mission structure, your Equipment and Zombies Field Upgrades, Acquisitions and Schematics, Acts, Tiers, Rewards and what to find during your deployments to the Exclusion Zone. Stay Frosty. For more information on Call of Duty, check out www.callofduty.com and www.youtube.com/callofduty and follow @RavenSoftware and @CallofDuty on X, Instagram, and Facebook. © 2023 Activision Publishing, Inc. ACTIVISION, CALL OF DUTY, MODERN WARFARE, and CALL OF DUTY WARZONE, are trademarks of Activision Publishing, Inc. All other trademarks and trade names are the property of their respective owners. For more information on Activision games, follow @Activision on Twitter, Facebook, and Instagram. ",
                "feedlabel": "Community Announcements",
                "date": 1698774110,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 1938090
            },
            {
                "gid": "5229301621594998838",
                "title": "Modern Warfare III: Everything You Need to Know",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5229301621594998838",
                "is_external_url": true,
                "author": "csmedley",
                "contents": "Ready yourself for Call of Duty®: Modern Warfare® III. The war has changed, and for the first time in back-to-back years, Call of Duty returns with a direct sequel. Continue your journey with seamless weapon progression, a full selection of Carry Forward content, and an all-new Campaign that continues the story immediately following the events of Call of Duty: Modern Warfare II. On Thursday, November 2, anyone who has digitally preordered or prepurchased Call of Duty: Modern Warfare III receives Early Access to the game’s Campaign*, which includes exciting and innovative Open Combat Missions, up to one week prior to the official launch. (*One week based on estimated access; actual play time subject to possible outages and applicable time zone differences.) The entire game, featuring the full Campaign, seminal Multiplayer, and an all-new open-world Modern Warfare Zombies experience, launches on November 10. Since the game’s reveal back on August 17, we’ve dropped a variety of important game innovations and revelations: Modern Warfare III Intel Drops {STEAM_CLAN_IMAGE}/42501705/d060f95efd4172d2c74ec409cc094794a5a5ee2b.jpg Campaign: Open Combat Missions: As Task Force 141’s rules of engagement have changed to fight the ultimate threat, so does the way you approach the Campaign, as Modern Warfare III is set to redefine player agency, offering an unparalleled degree of freedom and adaptability thanks to Open Combat Missions, dispersed throughout the Campaign to create a seamless, intertwined experience with the more traditional missions. Read more here. Multiplayer: Welcome home: Afghan. Derail. Estate. Favela. Karachi. Highrise. Invasion. Quarry. Rundown. Rust. Scrapyard. Skidrow. Sub Base. Terminal. Underpass. Wasteland — 16 Core Call of Duty: Modern Warfare 2 (2009) maps, constructed to maintain authenticity with a thorough modernization. Read more here. {STEAM_CLAN_IMAGE}/42501705/eae387624e46701648355685b35fbea471953ccc.jpg Multiplayer: Aftermarket Parts:  Aftermarket Parts, a new addition to Gunsmith, are innovative modification kits that drastically change a weapon's function and identity. They offer powerful enhancements beyond regular attachments, unlocked by completing weekly in-game challenges when a weapon reaches its maximum level. Read more here. {STEAM_CLAN_IMAGE}/42501705/b3cdfd57c19f89d50ca17e527888669d702387e8.jpg Modern Warfare Zombies: Welcome to Operation Deadbolt. Prepare for a massive, open-world experience as a team of multinational Operators assist the members of Operation Deadbolt  in taking down the vast undead hordes and a second major enemy threat. Read more here. {STEAM_CLAN_IMAGE}/42501705/17ebedf07206705f335ecfbf17740830a0ded125.jpg The Call of Duty: Next live event dropped some major announcements, confirming Map Voting, the Classic Minimap, a Silent Movement Perk, “Covert Sneakers”, Increased Health, and other updates to Multiplayer gameplay. Tac-Stance; changes to movement, weapons and Operators; a Gear system representing the Perks you utilize; and at least 12 new Core 6v6 maps in post-launch seasons. Read more here. From Beta to Launch {STEAM_CLAN_IMAGE}/42501705/daea88f49abeb80606deee3ba9fb9994cbd568a4.jpg Now that the Modern Warfare III Multiplayer Beta has concluded, Sledgehammer Games is fine-tuning the gameplay based on community feedback and has created the Modern Warfare III Trello Board so you can track the progress of some of these changes. You should expect regular communications from Sledgehammer Games via the official Patch Notes webpage, with the first set of Notes scheduled  by November 10. Let the Game Begin: Preload and Early Access Times Check the following timeframe to ensure that you’re preloading the game as early as possible, and ready up for the exact launch date, coming November 9–10: Preload of Campaign Early Access: November 1, 10 AM PT. Digitally preorder now and receive the Campaign Early Access, ready to preload on this date and play on November 2. Campaign Early Access Go-Live: November 2, 10 AM PT. Adapt or die in a fight against the ultimate threat as part of Task Force 141, including Open Combat Missions, and a number of content unlocks as you play. These rewards become available in Multiplayer and Zombies when the full game releases on November 10. Modern Warfare III Preload Timing {STEAM_CLAN_IMAGE}/42501705/0dab91ff15038fe297dd85f24e93c19b4a8a288f.jpg November 8, various times. Full game preload begins, for Campaign (for those who did not partake in Early Access), Multiplayer, and Zombies: Campaign Preload Times: PC Owners: November 1, 10AM PT. Full Game Preload Times (including Multiplayer and Zombies): PC Owners: November 8, 10AM PT. Modern Warfare III Launch Timing {STEAM_CLAN_IMAGE}/42501705/712c27850fb072c46b22f9cb5887434a09ad3a6c.jpg November 9, various times. For PC players, the game becomes available to play on November 9 at 9 PM PT. For exact availability in your time zone, consult the adjacent map image. PC Platforms: November 9, at 9 PM PT. Modern Warfare III: Pre-Season November 10 to Early December Once the full game is live, Vault Edition owners gain access to the Nemesis Operator Skins and the FATE Weapon Vaults, and rewards become available for those who unlocked them during the MWIII Beta, as well as Campaign Early Access. During the pre-season, you have a wide range of content to unlock. Here’s what you can expect to accomplish: {STEAM_CLAN_IMAGE}/42501705/8377910cd5468b005a8a806019b17cac9198fda1.jpg Rank up your player: Level up through the Military Ranks from 1–55 to unlock all base Multiplayer and Zombies Loadout items. {STEAM_CLAN_IMAGE}/42501705/f628aa4375833e350f1f6466593135878f2ede0e.jpg Level up your weapons: Level up each of the MWIII Primary and Secondary Weapons and unlock attachments, as well as all the Call of Duty: Modern Warfare II weapons you haven’t finished. {STEAM_CLAN_IMAGE}/42501705/84feb08f151eea9d3ac7700eceeb1cac908286ed.jpg Complete challenges: Focus on completing the six different types of Challenges: Daily, Weekly, Armory, Weapons (including a massive set of Camos to unlock!), Operators, and Calling Cards. {STEAM_CLAN_IMAGE}/42501705/07f0a2b16c2ed3277efbf24cf2dc827fd83ea4bc.jpg Get good (Multiplayer): Hone your talents against fellow Operators around the world by jumping into a variety of Playlists for Core 6v6, Ground War, War, and choose from a wide variety of maps and modes. {STEAM_CLAN_IMAGE}/42501705/c0bed0a42beda5516e35136da1d5617affb6dcfc.jpg Get good (Zombies): Join a cadre of international Operators and take on the mysterious Terminus Outcomes PMC as part of Operation Deadbolt. Complete dozens of missions and battle through the vast Zombie hordes overtaking Urzikstan. {STEAM_CLAN_IMAGE}/42501705/3eb2230979359dbf902f9c27c8bffaddb039c670.jpg Complete the MWII Season 06 Battle Pass in MWIII: If you still have Sectors and Tiers to unlock in the MWII Season 06 Battle Pass in Modern Warfare II, your time playing Modern Warfare III counts toward the completion of this Battle Pass. All content within this Battle Pass carries forward and can be used in Modern Warfare III. Modern Warfare III Season 1 Start Date: Early December Expect a robust first season of content for Modern Warfare III when it launches in early December. Led by the arrival and integration of Call of Duty: Warzone™ and the new Urzikstan “Big Map,” ready yourself for three brand-new Core 6v6 Multiplayer Maps, additional maps and modes, and an impressive selection of free and premium content, including free functional weapons, which will be revealed in the coming weeks. Vault Edition owners can activate their free seasonal Battle Pass unlock and 50 Tier Skips. Campaign: Early Access and Campaign Rewards {STEAM_CLAN_IMAGE}/42501705/a978493ce6f75a626897c5bc37cd73c91918718f.jpg Developed by Sledgehammer Games in partnership with Infinity Ward, the Call of Duty: Modern Warfare III Campaign is the direct sequel to the events of Modern Warfare II. This Campaign features a seamless integration of missions built around Call of Duty’s signature, cinematic moments that have defined two decades of the franchise’s action-packed, narrative-driven, single-player experiences, and brand-new Open Combat Missions designed to give the player freedom to approach the action in a variety of ways. Prepare for uneasy alliances and unfinished business: To save a world on the brink, the time has come to confront your past. . . . Campaign: Completion Rewards {STEAM_CLAN_IMAGE}/42501705/ffa9b86eb3880a76bd9e25d6e232eccc69a9d987.jpg The Campaign consists of 15 different missions. Almost every one of these missions rewards players with items upon completion, which can be used across Multiplayer, Zombies, and Call of Duty: Warzone. These are available to all players, regardless of whether the Campaign was played during Early Access or not: “Breather” Calling Card 30 mins Double Player XP Token & 30 mins Double Weapon XP Token “Corso” Operator “Ghillie Guy” Calling Card 30 mins XP Token and 30m Weapon XP Token “Pathfinder” Operator “Toxic Drip” Calling Card 1 hour Double Player XP Token and 1 hour Double Weapon XP Token “Doc” Operator “Skull Rhapsody” Calling Card 1 hour Double Player XP Token and 1 hour Double Weapon XP Token “Jabber” Operator Campaign Completion Emblem Campaign Completion Weapon Blueprint Modern Warfare III Launch Comms Continues Be sure to check back at the Call of Duty Blog between now and launch, as we confirm in-game content and offer deep dives on both Multiplayer and Zombies. Here’s what to expect prior to November 10: Blog 1: Pre-Season Preparation: You’re Reading This Blog! Blog 2: Mapping Out Multiplayer: Details on the launch modes (3v3v3, 6v6, and 32v32), Additional Mode Intel, all the launch maps (both Core and Ground War), Carry Forward Maps, and the Modern Warfare III Operators from SpecGru and Kortac. Blog 3: Fully Equipped: A Deep Dive into Loadouts (MP, MWZ): Gear up for the evolution of Perks, with detailed confirmation on all the launch Equipment, including Vests, Gloves, Boot, and Gear. Tacticals, Lethals, Field Upgrades, and Killstreaks are also confirmed. Blog 4: Upping Your Arsenal: Primary and Secondary Weapons (MP, MWZ): All launch weapons are confirmed, including Aftermarket Parts, and a weapon-balancing pass. The Gunsmith receives a statistical overhaul, and we break this all down for you. Blog 5: Cosmetic Customization: Weapon Camos (MP, MWZ): Could this be the biggest weapon progression feature in Call of Duty history? We detail the immense Multiplayer and Zombies Camo Challenge and Weapon Mastery system for your MWII and MWIII arsenal! Blog 6: Modern Warfare Zombies: Launch Content Overview: Join Operation Deadbolt, learning about the Mission structure, your Equipment and Zombies Field Upgrades, Acquisitions and Schematics, Acts, Tiers, Rewards and what to find during your deployments to the Exclusion Zone. Stay Frosty. For more information on Call of Duty, check out www.callofduty.com and www.youtube.com/callofduty and follow @RavenSoftware and @CallofDuty on X, Instagram, and Facebook. © 2023 Activision Publishing, Inc. ACTIVISION, CALL OF DUTY, MODERN WARFARE, and CALL OF DUTY WARZONE, are trademarks of Activision Publishing, Inc. All other trademarks and trade names are the property of their respective owners. For more information on Activision games, follow @Activision on Twitter, Facebook, and Instagram. ",
                "feedlabel": "Community Announcements",
                "date": 1698774091,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 1938090,
                "tags": [
                    "mod_reviewed",
                    "ModAct_873083815_1698777219_0",
                    "mod_require_rereview"
                ]
            },
            {
                "gid": "5288974951200613628",
                "title": "Steam Global Top Sellers for week of 24 Oct — 31 October 2023",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/SteamDB/5288974951200613628",
                "is_external_url": true,
                "author": "SteamDB",
                "contents": "<a href=\"https://steamdb.info/topsellers/2023W44/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\"> </a> * <a href=\"https://steamdb.info/app/2399830/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">ARK: Survival Ascended</a>; * <a href=\"https://steamdb.info/app/949230/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">Cities: Skylines II</a>; * <a href=\"https://steamdb.info/app/2195250/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">EA SPORTS FC™ 24</a>; * <a href=\"https://steamdb.info/app/1086940/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">Baldur's Gate 3</a>; * <a href=\"https://steamdb.info/app/1938090/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">Call of Duty®</a>; * <a href=\"https://steamdb.info/app/2322560/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">Love Is All Around</a>; * <a href=\"https://steamdb.info/app/1817070/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">Marvel’s Spider-Man Remastered</a>; * <a href=\"https://steamdb.info/app/1174180/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">Red Dead Redemption 2</a>; * <a href=\"https://steamdb.info/app/1675200/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">Steam Deck</a>; * <a href=\"https://steamdb.info/app/1817190/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">Marvel’s Spider-Man: Miles Morales</a>; <i>* excluding free to play games</i> <a href=\"https://steamdb.info/topsellers/2023W44/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">View top 100 on SteamDB</a>",
                "feedlabel": "SteamDB",
                "date": 1698768000,
                "feedname": "SteamDB",
                "feed_type": 0,
                "appid": 949230
            },
            {
                "gid": "5229301621591262940",
                "title": "Call of Duty: Modern Warfare III PC Trailer, Specs, Preloading Info, and More",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5229301621591262940",
                "is_external_url": true,
                "author": "csmedley",
                "contents": "The upcoming release of Call of Duty®: Modern Warfare® III is quickly approaching its November 10 PC launch date on and Steam. In partnership with Sledgehammer Games, Call of Duty PC lead developer Beenox has ensured players have over 500 customization options at their fingertips, with 4K graphics and Ultrawide support, and a massive array of options across all manner of settings. We’re also excited to share some of the highlights coming to the PC version of the game. But first, let’s take another look at the incredible PC trailer: Get the Ultimate PC Modern Warfare III Experience with Performance Multiplying DLSS 3 {STEAM_CLAN_IMAGE}/42501705/b9c77951d784bf7c9efdb76d04fccc7108e750fd.jpg DLSS 3 is a breakthrough in AI-powered graphics that boosts performance while maintaining great image quality and responsiveness. Building upon DLSS Super Resolution, DLSS 3 adds Frame Generation for GeForce RTX 40 Series GPUs to create additional high quality frames and integrates NVIDIA Reflex low-latency technology for optimal responsiveness. When you play with other GeForce RTX GPUs, you can activate DLSS Super Resolution to accelerate your frame rates and enhance your Modern Warfare III experience. There are a couple of additional graphical presets for PC players to look for, and check out, as you adjust the visual quality that’s right for you. NVIDIA Reflex - Best PC Responsiveness {STEAM_CLAN_IMAGE}/42501705/6fe296793a6e26b049eb5a09944926e63bb8bc55.jpg NVIDIA Reflex revolutionizes low-latency gaming, giving Modern Warfare III PC gamers the ultimate experience with incredible responsiveness. Pinpoint accuracy and timing are key to overcoming Modern Warfare III’s most intense gunfights and missions; NVIDIA Reflex reduces system latency, making gameplay smooth and more responsive, delivering the reaction time needed to compete at the highest levels. PC Preloading — Campaign Early Access and Official Launch Players who pre-purchase Modern Warfare III digitally on PC can preload the game ready at launch. Preloading will also be available for Campaign Early Access. {STEAM_CLAN_IMAGE}/42501705/db3cf5c4ab5c31ea948f75a8f720f863b43cd2f9.jpg Preloading for Campaign Early Access on PC begins on November 1 at 9AM PT, with Early Access going live on November 2 at 10AM PT. A direct sequel, Modern Warfare III picks up right after the events of Call of Duty: Modern Warfare II. Play up to a full week before launch and experience Captain Price and Task Force 141 facing off against the ultimate threat, Vladimir Makarov. {STEAM_CLAN_IMAGE}/42501705/17e9ed8ba6bbd2f82e577e1915bad9eb1ad3a244.jpg Preloading for the game’s official launch, including Multiplayer and Zombies, begins on November 8 at 9AM PT, with the full title going live on November 10 at 9PM PT. Official PC System Requirements {STEAM_CLAN_IMAGE}/42501705/5f970602b8d1e225d21271136b62acf6fad11f90.jpg Minimum OS: Windows 10 64 Bit (latest update)† CPU: Intel Core i5-6600 or AMD Ryzen 5 1400 RAM: 8 GB Hi-Rez Assets Cache: Up to 32 GB Video Card: NVIDIA GeForce GTX 960 / GTX 1650 or AMD Radeon RX 470 Video Memory: 2 GB Storage: SSD with 149GB available space (78GB if COD HQ and Warzone are already installed) Recommended OS: Windows 10 64 Bit (latest update) or Windows 11 64 Bit (latest update)† CPU: Intel Core i7-6700K or AMD Ryzen 5 1600X RAM: 16 GB Hi-Rez Assets Cache: Up to 32 GB Video Card: NVIDIA GeForce GTX 1080Ti / RTX 3060 or AMD Radeon RX 6600XT Video Memory: 8 GB Storage: SSD with 149GB available space (78GB if COD HQ and Warzone are already installed) Competitive / Ultra 4K Specifications OS: Windows 10 64 Bit (latest update) or Windows 11 64 Bit (latest update)† CPU: Intel Core i7-8700K or AMD Ryzen 7 2700X RAM: 16 GB Hi-Rez Assets Cache: Up to 64 GB Video Card: NVIDIA GeForce RTX 3080 / RTX 4070 or AMD Radeon RX 6800XT Video Memory: 10 GB Storage: SSD with 149GB available space (78GB if COD HQ and Warzone are already installed) Required for all specs: Network: Broadband Internet connection Sound Card: DirectX compatible Recommended Drivers for NVIDIA/AMD NVIDIA: 537.58 AMD: 23.10.2 Get Game Ready with the Latest Drivers To get your system game ready for Modern Warfare III, head to the Drivers tab of GeForce Experience or GeForce.com to download and install the latest driver. Game Ready Drivers are finely tuned in collaboration with the developers and extensively tested for maximum performance and reliability. Pre-purchase on PC Today {STEAM_CLAN_IMAGE}/42501705/af9332f4b6646946d7daf0d5c0599b33b41a65e1.jpg Lock in your pre-purchase now and get immediate rewards such as the Soap Operator Pack and the Zombie Ghost Operator Skin, available in Call of Duty: Warzone™ and Modern Warfare II as well as for Modern Warfare III later in November. Upgrade to the Vault Edition to unlock the Nemesis Operator Pack and two FATE Weapon Vaults at launch, plus one Modern Warfare III season of BlackCell, which includes the Battle Pass, 50 Battle Token Tier Skips, a BlackCell Sector featuring a 1,100 CP Bonus, and more as well as the Soul Harvester Tracer Weapon Blueprint, which is immediately available in Call of Duty: Warzone™ and Modern Warfare II as well Modern Warfare III at launch.  Stay Tuned for More Intel Follow the Call of Duty Blog daily for the latest information on Modern Warfare III and follow the Sledgehammer Games blog for more Call of Duty: Modern Warfare III announcements and content. Stay frosty. © 2023 Activision Publishing, Inc. ACTIVISION, CALL OF DUTY, CALL OF DUTY WARZONE, and MODERN WARFARE are trademarks of Activision Publishing, Inc. All other trademarks and trade names are the property of their respective owners. For more information, please visit www.callofduty.com and www.youtube.com/callofduty, and follow @Activision and @CallofDuty on X, Instagram, and Facebook. For Call of Duty Updates, follow @CODUpdates on X. ",
                "feedlabel": "Community Announcements",
                "date": 1698685569,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 1938090,
                "tags": [
                    "mod_reviewed",
                    "ModAct_1428002267_1698686806_0",
                    "mod_require_rereview"
                ]
            },
            {
                "gid": "5229301621577104778",
                "title": "Бывший глава PlayStation Шон Лейден призвал разработчиков развивать популярные жанры и придумывать новые виды игр",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/Gamemag.ru/5229301621577104778",
                "is_external_url": true,
                "author": "Павел Вескер",
                "contents": "Бывший глава <strong>PlayStation Шон Лейден </strong>считает, что зацикленность ведущих разработчиков на одних и тех же жанрах не способствует росту индустрии и ограничивает привлечение новой аудитории. По его мнению, студиям следует вносить больше изменений в привычные форматы и придумывать новые виды игр — от этого в конечном итоге выиграют все . ",
                "feedlabel": "Gamemag.ru",
                "date": 1698340260,
                "feedname": "Gamemag.ru",
                "feed_type": 0,
                "appid": 1938090
            },
            {
                "gid": "5229301621573136951",
                "title": "Количество принадлежащих Microsoft игровых мегафраншиз выросло до 13 после покупки Activision Blizzard",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/Gamemag.ru/5229301621573136951",
                "is_external_url": true,
                "author": "Павел Вескер",
                "contents": "После покупки <strong>Activision Blizzard</strong> количество принадлежащих <strong>Microsoft </strong>игровых мегафраншиз <strong>выросло до тринадцати</strong>, сообщил генеральный директор корпорации <strong>Сатья Наделла </strong>на встрече с аналитиками и инвесторами по итогам презентации <a href=\"https://gamemag.ru/news/182670/xbox-fy24-q1-results-total-gaming-9-content-and-services-13-first-party-and-game-pass-growth\"><strong>квартального отчета</strong></a>. ",
                "feedlabel": "Gamemag.ru",
                "date": 1698250200,
                "feedname": "Gamemag.ru",
                "feed_type": 0,
                "appid": 1938090
            },
            {
                "gid": "5218041989061720076",
                "title": "Steam Global Top Sellers for week of 17 Oct — 24 October 2023",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/SteamDB/5218041989061720076",
                "is_external_url": true,
                "author": "SteamDB",
                "contents": "<a href=\"https://steamdb.info/topsellers/2023W43/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\"> </a> * <a href=\"https://steamdb.info/app/949230/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">Cities: Skylines II</a>; * <a href=\"https://steamdb.info/app/2195250/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">EA SPORTS FC™ 24</a>; * <a href=\"https://steamdb.info/app/1086940/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">Baldur's Gate 3</a>; * <a href=\"https://steamdb.info/app/1938090/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">Call of Duty®</a>; * <a href=\"https://steamdb.info/app/2344520/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">Diablo® IV</a>; * <a href=\"https://steamdb.info/app/2252570/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">Football Manager 2024</a>; * <a href=\"https://steamdb.info/app/1517290/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">Battlefield™ 2042</a>; * <a href=\"https://steamdb.info/app/227300/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">Euro Truck Simulator 2</a>; * <a href=\"https://steamdb.info/app/1675200/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">Steam Deck</a>; * <a href=\"https://steamdb.info/app/381210/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">Dead by Daylight</a>; <i>* excluding free to play games</i> <a href=\"https://steamdb.info/topsellers/2023W43/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">View top 100 on SteamDB</a>",
                "feedlabel": "SteamDB",
                "date": 1698163200,
                "feedname": "SteamDB",
                "feed_type": 0,
                "appid": 227300
            }
        ],
        "count": 313
    }
}