{
    "appnews": {
        "appid": 1091500,
        "newsitems": [
            {
                "gid": "5288974951203355294",
                "title": "Got high hopes for Cyberpunk 2077's sequel? CD Projekt wants it to put the games on a Witcher-esque trajectory",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/VG247/5288974951203355294",
                "is_external_url": true,
                "author": "",
                "contents": "CD Projekt is aiming to try and mirror the incredible transformation seen across its Witcher games with its follow-up to <a href=\"https://www.vg247.com/games/cyberpunk-2077\">Cyberpunk 2077</a>. This is according to CD Projekt Red narrative director Igor Sarzy&nacute;ski, who told <a href=\"https://www.pcgamer.com/cd-projekt-wants-the-cyberpunk-series-to-experience-a-similar-evolution-to-the-witcher-games/\">PC Gamer</a> that, when it comes to working on Cyberpunk’s sequel, the studio’s collective aim is to emulate the kind of progression that’s visible across the fantasy series that put it on the map. &ldquo;Consider The Witcher games and how much they changed with each instalment,&rdquo; said Sarzy&nacute;ski, &ldquo;We want a similar evolution here.&rdquo; The developer went on to explain that as CDPR’s first attempt at realising the vision of a new IP — with fresh elements in terms of gameplay, writing and art that marked a bit of a departure from what it had previously pulled off in other titles — the first Cyberpunk game was always going to serve as a bit of a proving ground. <a href=\"https://www.vg247.com/cyberpunk-2077-sequel-cd-projekt-witcher-series-trajectory\">Read more</a> ",
                "feedlabel": "VG247",
                "date": 1698855224,
                "feedname": "VG247",
                "feed_type": 0,
                "appid": 20900
            },
            {
                "gid": "5288974951202535598",
                "title": "Vampire: The Masquerade - Bloodlines 2 will feature a Cyberpunk-esque fully-voiced protagonist",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/VG247/5288974951202535598",
                "is_external_url": true,
                "author": "",
                "contents": "If Halloween wish-lists were a thing, then news about <a href=\"/games/vampire-the-masquerade-bloodlines-2\">Vampire: The Masquerade - Bloodlines 2</a> would likely have been what many of us wrote about in our letters to Santa Pumpkin. And even though I just made him up, maybe he really does exist after all, because that's exactly what we just got: a surprise stream granting a first-look at the narrative and RPG elements of one of gaming's most long-awaited sequels. The 18 minute video, which you can watch below, is the first proper look we've had at the resurrected Bloodlines 2 since The Chinese Room — the indie studio behind <a href=\"/games/amnesia-a-machine-for-pigs\">Amnesia: A Machine For Pigs</a> and <a href=\"/topics/everybodys-gone-to-the-rapture\">Everybody's Gone To The Rapture</a> — were <a href=\"/vampire-the-masquerade-bloodlines-2-release-date-trailer\">announced as the game's new developers</a> back in early September. Bloodlines 2 is a sequel to the 2004 PC game <a href=\"/topics/vampire-the-masquerade-bloodlines\">Vampire: The Masquerade - Bloodlines</a>, a cult classic which is still intensely popular after nearly two decades, despite its infamously troubled production and launch. It's a testament to the quality of the writing and world-building that many players — myself included — still count it among the all-time greatest video games, even though you famously need to mod the living hell out of the thing to get it to run smoothly. <a href=\"https://www.vg247.com/vampire-the-masquerade-bloodlines-2-halloween-reveal-stream\">Read more</a> ",
                "feedlabel": "VG247",
                "date": 1698836101,
                "feedname": "VG247",
                "feed_type": 0,
                "appid": 532790
            },
            {
                "gid": "5229301621595576280",
                "title": "CD Projekt wants the Cyberpunk series to experience 'a similar evolution' to The Witcher games",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/PC Gamer/5229301621595576280",
                "is_external_url": true,
                "author": "Wes Fenlon",
                "contents": "s troubled as <a href=\"https://www.pcgamer.com/cyberpunk-2077/\" target=\"_blank\">Cyberpunk 2077</a> was at launch, it&apos;s remarkable to think back to what a CD Projekt Red game looked like just 12 years before. The first Witcher game is almost comically rudimentary next to the lavishly motion captured, ray traced first-person world of Cyberpunk. But it was fun, with a fantasy setting that felt different to other RPGs I&apos;d played at the time. The graphical leap in 2011&apos;s The Witcher 2 was nothing short of stunning, and the quality of the sidequests in The Witcher 3&apos;s massive open world made CD Projekt my favorite RPG developer just four years later. I&apos;m thinking about that progression now that CD Projekt is moving on to work on Cyberpunk 2077&apos;s sequel&#x2014;and so are the developers... <a href=\"https://www.pcgamer.com/cd-projekt-wants-the-cyberpunk-series-to-experience-a-similar-evolution-to-the-witcher-games?utm_source=steam&utm_medium=referral\" target=\"_blank\">Read more.</a>",
                "feedlabel": "PC Gamer",
                "date": 1698787208,
                "feedname": "PC Gamer",
                "feed_type": 0,
                "appid": 1091500
            },
            {
                "gid": "5229301621583634654",
                "title": "Cyberpunk 2077's 2.0 overhaul was inspired by the 'old school design' of Diablo 2's skill trees and Doom's 'relentless' combat",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/PC Gamer/5229301621583634654",
                "is_external_url": true,
                "author": "Wes Fenlon",
                "contents": "<a href=\"https://www.pcgamer.com/cyberpunk-2077-2-0-patch-breakdown/\" target=\"_blank\">Cyberpunk 2077&apos;s 2.0 update</a> changed so much about the game, it&apos;d probably be quicker to list things it didn&apos;t touch than the systems it tweaked or wholesale refinished. But the most impactful, I think, is the skill tree revamp, which changes how you build V and what you&apos;re capable of. I only played about two hours of Cyberpunk in 2020, so when I really sunk my teeth into 2.0 I was shocked to look back at how the trees were designed before. There were still cool skills there, but without the more obvious build paths and synergies in 2.0. I asked CD Projekt Red how that change came about... <a href=\"https://www.pcgamer.com/cyberpunk-2077s-20-overhaul-was-inspired-by-the-old-school-design-of-diablo-2s-skill-trees-and-dooms-relentless-combat?utm_source=steam&utm_medium=referral\" target=\"_blank\">Read more.</a>",
                "feedlabel": "PC Gamer",
                "date": 1698504254,
                "feedname": "PC Gamer",
                "feed_type": 0,
                "appid": 1091500
            },
            {
                "gid": "5229301621579950649",
                "title": "Here’s why Phantom Liberty was never going to change Cyberpunk 2077’s endings",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/VG247/5229301621579950649",
                "is_external_url": true,
                "author": "",
                "contents": "<a href=\"https://www.vg247.com/games/cyberpunk-2077\">Cyberpunk 2077</a> was never going to get an expansion designed to take place following the conclusion of the base game’s main story, as the team behind the game didn’t want to risk diluting how V’s tale ends. This is according to CD Projekt Red narrative director Igor Sarzy&nacute;ski, who told <a href=\"https://www.pcgamer.com/cd-projekt-never-considered-a-cyberpunk-expansion-set-after-the-main-games-endings-no-need-to-water-them-down-sometimes-less-is-more/\">PC Gamer</a> that, prior to settling on the premise that would end up coming to life as Phantom Liberty, Cyberpunk’s developers did contemplate taking things in a couple of other directions. Though, Sarzy&nacute;ski says that continuing on from the events that can follow V’s meeting with Hanako Arasaka at Embers wasn’t on the cards. Acknowledging that, had CDPR selected one set of ending circumstances to serve as the basis for a post-final mission adventure, it would have risked annoying players by potentially undermining the choices they’d made for their version of V during the events of the game, narrative director also suggested that doing so wouldn’t have meshed with the team’s desires. <a href=\"https://www.vg247.com/cyberpunk-2077-phantom-liberty-never-going-to-change-main-quest-endings\">Read more</a> ",
                "feedlabel": "VG247",
                "date": 1698416975,
                "feedname": "VG247",
                "feed_type": 0,
                "appid": 1091500
            },
            {
                "gid": "5229301621577423449",
                "title": "CD Projekt never considered a Cyberpunk expansion set after the main game's endings: 'No need to water them down. Sometimes less is more'",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/PC Gamer/5229301621577423449",
                "is_external_url": true,
                "author": "Ted Litchfield",
                "contents": "If you&apos;d asked me what I thought a Cyberpunk 2077 expansion would focus on after I first beat the game in December 2020, I would have guessed the <a href=\"https://youtu.be/yjpwA0_flYU?si=XN8Fyst74-5bcvjF&t=889\" target=\"_blank\">heist on the Crystal Palace satellite casino</a> teased in two of the base game&apos;s endings. According to CD Projekt Red narrative director Igor Sarzy&#x144;ski, though, the team was always firm on Cyberpunk&apos;s endings being the final word on V&apos;s story. <strong>Spoilers for 2077 and Phantom Liberty ahead.</strong>.. <a href=\"https://www.pcgamer.com/cd-projekt-never-considered-a-cyberpunk-expansion-set-after-the-main-games-endings-no-need-to-water-them-down-sometimes-less-is-more?utm_source=steam&utm_medium=referral\" target=\"_blank\">Read more.</a>",
                "feedlabel": "PC Gamer",
                "date": 1698357252,
                "feedname": "PC Gamer",
                "feed_type": 0,
                "appid": 1091500
            },
            {
                "gid": "5229301621576867273",
                "title": "Cyberpunk 2077's 2.02 patch rebalances the near-impossible vehicle contracts",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/Rock, Paper, Shotgun/5229301621576867273",
                "is_external_url": true,
                "author": "",
                "contents": "Even after several years of updates and an excellent expansion, <a href=\"/cyberpunk-2077-walkthrough-hub-all-of-our-guides-in-one-handy-place\">Cyberpunk 2077</a> still isn't bug-free. I said as much in my <a href=\"https://www.rockpapershotgun.com/cyberpunk-2077-phantom-liberty-review\">Phantom Liberty review</a>. The difference now versus launch back in 2020 is that the bugs are now within acceptable limits. CDPR continue to fix them, too. Patch 2.02 is out now. <a href=\"https://www.rockpapershotgun.com/cyberpunk-2077s-202-patch-rebalances-the-near-impossible-vehicle-contracts\">Read more</a> ",
                "feedlabel": "Rock, Paper, Shotgun",
                "date": 1698343748,
                "feedname": "Rock, Paper, Shotgun",
                "feed_type": 0,
                "appid": 1091500
            },
            {
                "gid": "5229301621576484998",
                "title": "Cyberpunk's new patch means the game will no longer strike you down like a fickle god right before the ending",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/PC Gamer/5229301621576484998",
                "is_external_url": true,
                "author": "Joshua Wolens",
                "contents": "<a href=\"https://www.pcgamer.com/uk/cyberpunk-2077/\" target=\"_blank\">Cyberpunk&apos;s</a> 2.02 patch has hit, bringing with it a surfeit of tweaks, fixes, and improvements to Night City in the wake of the game&apos;s sweeping 2.0 update and accompanying <a href=\"https://www.pcgamer.com/how-cyberpunk-2077-clawed-its-way-back-from-disaster-to-complete-one-of-the-greatest-redemption-arcs-in-gaming-history/\" target=\"_blank\">redemption arc</a>. As usual there&apos;s a whole lot of bullet points here, and I&apos;ll put the full patch notes below, but there are a couple of entries worth highlighting in particular... <a href=\"https://www.pcgamer.com/cyberpunks-new-patch-means-the-game-will-no-longer-strike-you-down-like-a-fickle-god-right-before-the-ending?utm_source=steam&utm_medium=referral\" target=\"_blank\">Read more.</a>",
                "feedlabel": "PC Gamer",
                "date": 1698334628,
                "feedname": "PC Gamer",
                "feed_type": 0,
                "appid": 1091500
            },
            {
                "gid": "5229301621576238670",
                "title": "Cyberpunk 2077 patch 2.02 ensures Phantom Liberty’s vehicle contract missions can no longer be impossible",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/VG247/5229301621576238670",
                "is_external_url": true,
                "author": "",
                "contents": "The latest <a href=\"https://www.vg247.com/games/cyberpunk-2077\">Cyberpunk 2077</a> patch addresses a number of issues, including a bug that’d caused some of the vehicle delivery missions added to the game with the Phantom Liberty expansion to become physically impossible to complete. Patch 2.02 for CD Projekt’s futuristic RPG, which is currently being rolled out across PC and consoles, comes with a pretty hefty list of changes aimed at both Phantom Liberty and the base game. Nestled among the section of these that are Phantom Liberty-specific is a bug fix that’ll definitely help lower the blood pressures of Dogtown’s mercenaries. The change in question is a simple rebalancing of the time limits for some of the game’s vehicle contract side missions, which see V tasked by Santo Domingo fixer Muamar \"El Capitán\" Reyes (whose hairstyle genuinely looks like it should be illegal) to steal specific vehicles and drive them to specific locations in return for some decent rewards. <a href=\"https://www.vg247.com/cyberpunk-2077-patch-phantom-liberty-vehicle-contract-missions-not-impossible\">Read more</a> ",
                "feedlabel": "VG247",
                "date": 1698329308,
                "feedname": "VG247",
                "feed_type": 0,
                "appid": 1091500
            },
            {
                "gid": "5229301621575632760",
                "title": "Patch 2.02",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5229301621575632760",
                "is_external_url": true,
                "author": "Vattier",
                "contents": "Patch 2.02 for Cyberpunk 2077 and Phantom Liberty is live! It includes quest and gameplay fixes for the most common issues as well as other general improvements. For details, check out the list of changes below. Phantom Liberty-specific Rebalanced the time limits for Vehicle Contracts. Various fixes for animations, lighting, scenes, VFX and more. Fixed collision issues in various locations that could cause players to get stuck. When starting a new game and skipping ahead to Phantom Liberty, quests that were simulated as completed will now be visible in the Journal. Fixed an issue where the Quadra Sport R-7 \"Vigilante\" wasn't available for purchase on the Autofixer website in some circumstances. Fixed an issue where roadblocks were present in front of the Dogtown gates, thus preventing entry. Sasquatch's Hammer will now appear in the vendor's stock at the stadium's black market if it was originally missed after the boss fight with Sasquatch. Dex's body will now spawn in the landfill on saves where the option to skip ahead to Phantom Liberty was selected. It will now be possible to pick up Jackie's guns from the altar in El Coyote Cojo on saves where the option to skip ahead to Phantom Liberty was selected. Addicted To Chaos - Fixed an issue where it could become impossible to complete the quest if the stash is looted before receiving the message with the code. Black Steel in the Hour of Chaos - Fixed an issue where, under specific circumstances, the quest could remain active even after failing it by not following the traces left by Songbird. Firestarter - It will no longer be possible to disassemble the stadium security datashard after looting it from Hansen's body, thus blocking quest progression. Firestarter - It will now be possible to pick up the Bald Eagle weapon after siding with Songbird. Gig: Roads to Redemption - Fixed an issue where the door leading to the stadium's weapons factory could be opened by accident earlier in Firestarter, which later interfered with gig progression and could lock the player behind the door. Hi Ho Silver Lining - Fixed an issue where the objective \"Leave Heavy Hearts\" might not be marked complete after leaving Heavy Hearts. I've Seen That Face Before - Fixed an issue where the \"Go to the vantage point\" objective might not be marked complete after reaching the vantage point. Moving Heat - Fixed an issue where it wasn't possible to get in the car because it didn't spawn. Moving Heat - Fixed an issue where the quest could remain stuck on the \"Leave with the car\" objective even after getting in the car and leaving the area. Run This Town - Fixed an issue where the Black Sapphire could become inaccessible because of closed shutters if the player had triggered combat in the lobby at the end of You Know My Name. Run This Town - Fixed an issue where it wasn't possible to meet Mr. Hands in Heavy Hearts because the elevator was disabled. Run This Town - Fixed an issue where the character menu and fast travel remained blocked after removing Aguilar's imprint. Run This Town - Fixed an issue where the Journal incorrectly suggested that the player had to complete Gig: Spy in the Jungle to continue the quest when, in fact, Gig: Heaviest of Hearts was required instead. Somewhat Damaged - Fixed an issue where Cerberus wouldn't spawn until the corridor chase scene if the player fired a weapon in a specific spot near terminal Sierra. Somewhat Damaged - Removed the attribute check from doors when locked in the Observation Room and adjusted the objective to make it clearer that hiding from Cerberus is required to progress. Spider and the Fly - Fixed an issue where the boss fight with the Chimera might not start. The Damned - Fixed an issue where the quest objective disappeared after the meeting in The Moth, thus blocking progress. The Killing Moon - Fixed an issue where it was possible to trigger the police system while driving to the spaceport. Things Done Changed - Fixed an issue where the screen could go black after calling the nurse. Tomorrow Never Knows - Fixed an issue where completing Heroes made it impossible to ask Misty about the tarot cards. New Person, Same Old Mistakes - Fixed an issue where the door to Bill's hot dog stand was still closed for some players on 2.01. Quests & Open World Fixed an issue where the Quadra Type-66 \"Wingate\" wasn't visible in the Call Vehicle menu after being purchased. Johnny will no longer appear when collecting the reward for Trauma Drama prior to completing Act 1. The Trauma Team website will now be accessible on V's computer when the Killing in the Name quest is active. Beat on the Brat: Arroyo - Fixed an issue where beating Buck while having Microgenerator cyberware equipped could block completion of the quest. Gig: We Have Your Wife - Fixed an issue where the gig might not start after approaching the quest area. Life During Wartime - Fixed an issue where Panam might not get on the motorcycle and ride to the gas station if V got on theirs first. Path of Glory - V will no longer flatline after entering the Delamain AV. The Beast in Me - Fixed an issue where it wasn't possible to shoot from the vehicle during the race. Gameplay Rebalanced the stats of some weapons based on player feedback. The Malorian Arms 3516 received a buff. Recoil is easier to handle, even at low stamina, and damage was increased. Crafting specs for Iconic weapons will now disappear after crafting the item. Added stats to the tooltip of Monowire that were missing. Fixed an issue where it was possible to duplicate junk items. Bullets now deal damage correctly when shooting through glass. Fixed an issue where it was possible to easily obtain Tier 5 Skill Shards early in the game. Their prices have also been adjusted. Disabled the Bait quickhack on enemies standing at the edge of an area they're not supposed to leave. Fixed an issue where the Data Recycler perk recovered the base RAM cost without taking RAM reduction perks into account, thus recovering more RAM than was actually spent. Fixed some specific instances where crowd NPCs could clip through vehicles while walking. Fixed an issue that could cause elevators in various quests to spawn on an incorrect floor if a save/load was performed after they started moving. Fixed an issue where the appearance of V's hands in first-person perspective might not change correctly after installing or uninstalling arm cyberware. Giving money to a homeless person will no longer lower your NCPD Wanted Level. Fixed an issue where cyberware could get downgraded to Tier 1 after updating the game to 2.01. Fixed skill progression passives. PC-specific Selecting default graphics settings should now pick the proper Quick Preset based on your hardware and according to the latest system recommendations. Introduced a mechanism for the detection of mismatched or corrupted scripts which are caused by outdated mods or file corruption during update/installation. It will now show a descriptive error message and close the game instead of resulting in a crash. Miscellaneous Various optimizations, performance improvements and crash fixes. Fixed an issue where some achievements or trophies could unlock after loading a pre-2.0 save on 2.01 despite not meeting the criteria for them. Please note that this fix will not reset already unlocked achievements. Fixed an issue where, under specific circumstances, a \"Warning - Detected\" message could be displayed instead of \"Completed\" when having your vehicle scanned or when connecting your personal link. Fixed an issue of blinking trash that could sometimes be visible when crawling out of the landfill in Playing for Time. Fixed a misaligned glitch effect on Johnny. Fixed an issue where NPCs could appear stretched out when affected by explosions or the Savage Sling ability. Fixed an issue where tooltips on the map and interaction prompts for renting apartments showed double the actual price. Blocked Cross-progression from uploading saves bigger than the max save size limit on consoles to prevent crashes and issues when importing such saves. Remastered the voiceover to improve audio quality in German, Simplified Chinese and Japanese. ",
                "feedlabel": "Community Announcements",
                "date": 1698315055,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 1091500,
                "tags": [
                    "mod_reviewed",
                    "ModAct_1294976491_1698317134_0",
                    "mod_require_rereview"
                ]
            }
        ],
        "count": 1380
    }
}