{
    "appnews": {
        "appid": 230410,
        "newsitems": [
            {
                "gid": "5124585319850452460",
                "title": "PSA - SteamInput Controller Issues",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5124585319850452460",
                "is_external_url": true,
                "author": "Juicy",
                "contents": "Hi Tenno, For those of you who use controllers on the Steam client for Warframe, we are aware of some issues relating to controller inputs. With Echoes of Duviri’s launch, we did post a clarification on how to fix lost controller support for those experiencing it, found here: https://forums.warframe.com/topic/1361266-lost-controller-support-on-pc/#comment-12839111 . For ease of reference, the comment reads: e just updated the Recommended Official Layouts (we couldn't do this until we'd released the update and there was some difficulty getting them ported over from our Test cluster). If you're using Steam Input for Warframe (ie: for a PS4 or Steam Controller that doesn't work with the native XInput) restart Steam to refresh the list, edit your Warframe Controller settings in steam, select a layout, and you should see an updated recommended layouts for Playstation, Xbox, Nintendo Switch, Steam, and Steam Deck controllers now: {STEAM_CLAN_IMAGE}/4437469/e04d53a2ebe44c895fcc2f88bbd3601beb16fdb5.png Further Issues Following Each Update: If you are seeing custom controls being reset with our hotfixes, this is due to us publishing fixes for SteamInput, which invalidates custom layouts. We have been actively working on SteamInput (and by extension, SteamDeck) changes but excluded them from our patch notes until we had more news about the status on ongoing issues for our SteamDeck players* -- with that said, we understand that this decision may have led to even more player confusion. To recap the fixes done to the SteamInput system over the past week: Echoes of Duviri: Hotfix 33.6.1 Fixed Archwing blink when using Steam Input. Echoes of Duviri: Hotfix 33.6.3 Fixed Shawzin inputs not functioning properly with Steam Input. As for further Steam Input fixes, we usually like to get you fixes ASAP however, because of the way Steam Input works, almost every fix we make will invalidate all customized layouts. As a result, we're trying to bundle up as many fixes as possible before sending out another update. * For our SteamDeck players, we are actively working with Valve to resolve various issues. Once we are closer to a resolution on these, we will post a separate PSA pertaining to that situation. Thank you for your patience on this matter! ",
                "feedlabel": "Community Announcements",
                "date": 1691098171,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 230410,
                "tags": [
                    "patchnotes"
                ]
            },
            {
                "gid": "5124585319850049706",
                "title": "Prime Resurgence: Nyx Prime and Rhino Prime are now available!",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5124585319850049706",
                "is_external_url": true,
                "author": "Markus",
                "contents": "Flex your mind AND your muscles with the latest Prime Resurgence rotation featuring Nyx Prime and Rhino Prime! {STEAM_CLAN_IMAGE}/4437469/418cbb2489b91de0fcac21431dc521b3839034c2.png These two powerful Prime Warframes — along with their Prime Weapons and signature Prime Accessories — can be yours instantly with the power of Regal Aya. Infiltrate the minds of your enemies with the psychic prowess of Nyx Prime, who wields the stealthy Hikou Prime throwing stars and the not-so-stealthy Scindo Prime war axe. Or embrace the iron will of Rhino Prime and his devastatingly brute strength. Envelop yourself with Iron Skin and nail your foes to the nearest wall with the Boltor Prime Rifle, or pummel them into oblivion with the Ankyros Prime fists. Get the latest gear from Prime Resurgence with the help of Varzia Dax in Maroo’s Bazaar on Mars! Trade for it instantly using Regal Aya, or exchange the Aya you earn during Missions for Relics containing Blueprints to craft Prime Warframes and Weapons!",
                "feedlabel": "Community Announcements",
                "date": 1691088625,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 230410
            },
            {
                "gid": "5124585319845882512",
                "title": "PSA - Steam Deck Login Issues (RESOLVED)",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5124585319845882512",
                "is_external_url": true,
                "author": "Juicy",
                "contents": "Tenno, We are aware of issues for the Warframe Steam Deck client as a result of the August Steam Deck System Update. Upon installing, the On Screen Keyboard no longer appears to let you enter your login details, preventing players from being able to log-in. At this time, we recommend you avoid updating your Steam Deck to the August Steam Deck System Update until we find a resolution for this issue. We have contacted Valve and are looking for a solution with them. We’ll update this announcement as more information comes in. Thank you for your understanding and cooperation. EDIT: A temporary workaround has been discovered with the following steps: Launch your Steamdeck in desktop mode Open the Steam app Switch to Big Picture Mode (monitor symbol top right) Launch Warframe UPDATE: August 3 @ 2pm We have heard back from Valve that they have identified an issue and are looking for a fix. UPDATE: August 4 @ 10am Valve has put out a hotfix for SteamDeck users and functionality as been restired. Please apply the update in order to see the changes. It may not automatically search for the update so below are instructions to manually install it. Steam button Settings > System \"Check for Updates\" You should see a new software update! ",
                "feedlabel": "Community Announcements",
                "date": 1690989863,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 230410,
                "tags": [
                    "patchnotes",
                    "mod_reviewed",
                    "ModAct_1400956464_1690990713_0",
                    "ModAct_873083815_1691087972_4",
                    "mod_require_rereview"
                ]
            },
            {
                "gid": "5124584686246807153",
                "title": "Echoes of Duviri",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5124584686246807153",
                "is_external_url": true,
                "author": "bloates",
                "contents": "Jump back into the mind-bending open world of Duviri for an ancillary update featuring new QOL changes plus an iconic boss battle deep within the subterranean confines of the Undercroft! THE JACKAL RETURNS No longer limited by the industrial walls of a Corpus laboratory, the Jackal can now be found roaming the eerie sub-realm beneath Duviri: the Undercroft. Take on this famous Warframe boss in a new Assassination game mode! {STEAM_CLAN_IMAGE}/4437469/297df63d85a3592531629254761a2588129a04f8.png Please note: this version of the Jackal fight has been modified from its original form on Venus. You’ll need to battle the Jackal through three phases (instead of four), and will have to deal with reinforcements between each phase. NEW UNDERCROFT TILESETS Two new tiles have been added to the Undercroft: the large, open spaces of the Fractal Pastures as well as the calming Amphitheatre. All five existing game modes can be experienced through both of these exciting new areas with the Jackal appearing exclusively on Fractal Pastures to wreak havoc on the crops. THE ETHEREAL WARFRAME, PRIMED Now entering Prime Access: the interdimensional enchantress, Wisp Prime. {STEAM_CLAN_IMAGE}/4437469/672b4e08dfd913e3952530aa7862bdcced703742.png Instantly acquire the latest Prime Warframe along with her signature Prime Weapons, Fulmin Prime and Gunsen Prime, plus new Prime Accessories, Resource and Affinity Boosters and more. NEW DRIFTER MELEE: ARGO & VEL Argo & Vel bolster the warrior who stands fast. Gain instant access to this powerful Melee weaponry (for use with both Drifter and Warframe) with Platinum, available from either Teshin’s Cave or the in-game Market. Alternatively, you can unlock each weapon with Pathos Clamps for Drifter use and then gain its Blueprint to craft in your Foundry for use with your preferred Warframe. {STEAM_CLAN_IMAGE}/4437469/e56f24aa774d7122848147b45c4c83f827818c00.png DOMESTIK DAIS DRONE Available through the Void Trader, Baro Ki'Teer, this diligent drone is sure to keep your home and/or Orbiter spotless — whether you’re a commoner or a king! {STEAM_CLAN_IMAGE}/4437469/0d518ba0467ef27bbbc033b132ca2fb93d1d274f.png NEW INCARNON GENESES You can now earn new Incarnon Geneses via the Circuit Steel Path! Once acquired, these can be installed into their applicable weapons by visiting Cavalero aboard the Zariman. Boar (base and Prime) Awaken this weapon’s ability to fire three short-range beams that chain link enemies in Incarnon Form. Gammacor (base and Synoid) Awaken this weapon’s ability to fire projectiles that pull enemies into a Cold Damage explosion in Incarnon Form. Angstrum (base and Prisma) Awaken this weapon’s ability to launch target-seeking fireballs that ricochet toward enemies in Incarnon Form. Gorgon (base, Wraith, and Prisma) Awaken this weapon’s ability to fire embedding projectiles that explode with Heat Damage in Incarnon Form. Anku Awaken this weapon’s ability to increase Range and Slash Damage during slide attacks in Incarnon Form. NEW DECREES New Decrees have been added to the randomized pool of options upon completing Duviri Spiral stages and side objectives! Stable Stance Gains 25% resistance to knockdown for each enemy within 20m. Swooping Miasma Gain +3 jumps. Jumping slide kicks cause 300 Viral Damage and status in an area around hit enemies. Kexat’s Pounce Jump higher. Gain +180% damage while airborne. Effect wears off 2s after landing. Baneful Harmony Inflicting Cold or Toxin status effects also inflicts Viral status. Consuming Rage (Spiteful) Heavy Attacks and Power Strikes consume 10% of Energy or Transference Bar, but gain +300% damage. NEW WARFRAME AUGMENT MODS Acquire new Warframe Augment Mods through Syndicate Offerings: Temporal Erosion (Protea - Temporal Anchor) While Temporal Anchor is active, each strike of Grenade Fan and Blaze Artillery strips 10% Armor from enemies. Shadow Haze (Sevagoth - Reap) Increase Critical Chance by 50% on enemies inflicted with Death Harvest. A new Shadow emerges from those enemies when they perish. Limit of 3 Shadows. Ulfrun’s Endurance (Voruna - Ulfrun’s Descent) During Ulfrun’s attack, enemies that die from Bleed within 20m restores Voruna’s charges. Intrepid Stand (Styanax - Final Stand) Each javelin that hits an enemy grants 60 Overguard to Styanax and 30 Overguard to his allies within Affinity Range. QOL CHANGES First announced in the recent Dev Workshop, changes have been made to the following systems: Enhanced Damage Numbers Overguard for Warframes Cold, Impact, and Puncture Status Check out the video below for a quick explanation of the changes to Damage Numbers, courtesy of Lead Designer Pablo Alonso: As always, be sure to check out our patch notes for full details on the changes and additions listed above. Good luck on your latest foray into Duviri, Tenno!",
                "feedlabel": "Community Announcements",
                "date": 1690480928,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 230410,
                "tags": [
                    "mod_reviewed",
                    "ModAct_1428110219_1690483887_0",
                    "mod_require_rereview"
                ]
            },
            {
                "gid": "5124584686246473147",
                "title": "Wisp Prime Access Now Available!",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5124584686246473147",
                "is_external_url": true,
                "author": "bloates",
                "contents": "The interdimensional enchantress, Wisp Prime, enters Prime Access! Add Wisp Prime to your Arsenal along with her signature Prime Weapons Fulmin Prime and Gunsen Prime, along with new Prime Accessories, Resource and Affinity Boosters and more. {STEAM_CLAN_IMAGE}/4437469/672b4e08dfd913e3952530aa7862bdcced703742.png Wisp Prime Wisp Prime’s gilded splendor haunts the battlefield. Allies welcome her interdimensional beauty. Fulmin Prime Wield a storm. Fulmin Prime's electric rounds switch between lightning beams and short-range bursts. Wisp quickly swaps between each mode with her elemental prowess. Gunsen Prime Command the beauty and lethality of these ornate warfans. Exclusive Wisp Prime Glyphs Wisp Prime Accessories featuring: Entheor Prime Syandana Clearvoy Prime Suit 90-Day Resource Booster 90-Day Affinity Booster Get Wisp Prime and more instantly with Prime Access or earn Relics in-game to craft Wisp Prime, Fulmin Prime and Gunsen Prime. https://store.steampowered.com/app/2461823/Warframe_Wisp_Prime_Access__Accessories_Pack/ https://store.steampowered.com/app/2461820/Warframe_Wisp_Prime_Access__Reservoirs_Pack/ https://store.steampowered.com/bundle/33693/Warframe_Wisp_Prime_Access__WilOWisp/ https://store.steampowered.com/bundle/33692/Warframe_Wisp_Prime_Access__Sol_Gate/",
                "feedlabel": "Community Announcements",
                "date": 1690473009,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 230410
            },
            {
                "gid": "5124584051988335335",
                "title": "Wisp Prime Access Starts July 27",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5124584051988335335",
                "is_external_url": true,
                "author": "bloates",
                "contents": "Beginning July 27 on all platforms, get instant access to the latest Prime Warframe with Wisp Prime Access. Add Wisp Prime to your Arsenal along with her signature Prime Weapons Fulmin Prime and Gunsen Prime, along with new Prime Accessories, Resource and Affinity Boosters and more. ",
                "feedlabel": "Community Announcements",
                "date": 1690298239,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 230410
            },
            {
                "gid": "5124584051970230945",
                "title": "Just Launched! Recall: Ten-Zero",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5124584051970230945",
                "is_external_url": true,
                "author": "benloates",
                "contents": "Recall: Ten-Zero is a chance to relive some of the biggest moments in Warframe. Take part in weekly Alerts commemorating unforgettable parts of Warframe history to earn Glyphs, Noggles and much more! {STEAM_CLAN_IMAGE}/4437469/12680cdb7178c1d543639433f7274bb5de363cc9.png Complete every mission for 3 out of 5 Weeks of Alerts to receive the 10-Year Anniversary Emblem, and complete all 5 Weeks to get the Kyndryn Gunblade Skin. The first week has kicked off with Vor’s Prize, from now until July 27, so jump in and start playing today, Tenno! Learn more",
                "feedlabel": "Community Announcements",
                "date": 1689869072,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 230410
            },
            {
                "gid": "5124584051967038048",
                "title": "TennoCon 2023 Giveaways and Digital Extras",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5124584051967038048",
                "is_external_url": true,
                "author": "benloates",
                "contents": "Prepare for TennoCon 2023 by taking advantage of these giveaways and Digital Extras! Enter exclusive giveaways for a chance to win custom gaming gear and more. Then keep an eye out for your chance to create a custom TennoCon 2023 Badge in the near future. PHYSICAL GIVEAWAYS Steam Deck Giveaway Be as agile as any Warframe with a Valve Steam Deck of your very own! Giveaway begins August 21. {STEAM_CLAN_IMAGE}/4437469/a54a7c4d77169f63cb6392103d39ee04fd8a1ba5.jpg PC and Peripheral Giveaway Starting on August 21, you could win hardware from HyperX and HP OMEN. Plus, during TennoLive 2023 on August 26 at 4:30 p.m. ET, you can enter for your chance to win an HP Victus gaming PC during via Twitch! There will also be giveaways for PC peripherals on social media starting August 21 as well as an HP Omen Gaming Hub code giveaway! {STEAM_CLAN_IMAGE}/4437469/a1c8a00e0f5408aaa5dc5f2a4273954bce5908e7.jpg Custom PC Bundle Giveaway Win a custom PC modded by JMDF at TennoCon! Don’t miss your chance to win and tune in on Steam or Twitch. {STEAM_CLAN_IMAGE}/4437469/b06e39edc6e4132defa0622741afe9eef10f9d32.jpg And More! There are more giveaways waiting to reinforce your TennoCon experience so stay tuned as we approach August 26! DIGITAL PROMOTIONS 10 Year Anniversary Log In Reward Starting August 26, log in to Warframe to claim the Dex Operator and Drifter Suit. {STEAM_CLAN_IMAGE}/4437469/55e7eca4a03ecd87cd28b80662f5fa0cf563bfd0.png TennoCon Drop: Gotva Prime Rifle Get the Gotva Prime Rifle when you watch TennoCon on Steam or Twitch for 30 minutes between 12:30 p.m. ET and 4:30 p.m. ET. {STEAM_CLAN_IMAGE}/4437469/54584b9322f19befbf7aa44a7c6866e73cdfff62.png TennoLive Drop: Gara Prime Warframe Get Gara Prime when you watch TennoLive on Steam or Twitch for 30 minutes between 4:30 p.m. ET and 6:30 p.m. ET. Gara Prime comes with a pre-installed Orokin Reactor and Warframe Slot. {STEAM_CLAN_IMAGE}/4437469/b3e66c1258d058a985e1d26aab5e813f2995a553.png",
                "feedlabel": "Community Announcements",
                "date": 1689793392,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 230410
            },
            {
                "gid": "5124584051966610009",
                "title": "Countdown to TennoCon 2023",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5124584051966610009",
                "is_external_url": true,
                "author": "Markus",
                "contents": "Today officially marks the next step in our approach to TennoCon 2023 and our 10-Year Anniversary. Learn more about all the announcements today and prepare for the big day on August 26! TennoCon 2023 With TennoCon 2023 only a little more than a month away, the schedule for the Main Stage events and livestream has been confirmed! Tune in on Twitch, Steam or YouTube for a full day of panels, a Cosplay Contest with a $10,000 CAD prize and the moment when the next era of Warframe will be revealed: TennoLive! You won’t want to miss a single moment, Tenno. With so many reveals, hardware giveaways like Steam Decks, a custom PC and more, there’s plenty of reason to join us to celebrate Warframe’s 10-Year Anniversary! If you’re looking for more ways to add to your TennoCon experience, consider picking up a TennoCon 2023 Digital Bundle — featuring TennoCon-exclusive Customizations for your Warframe as well as access to Baro’s TennoCon Relay, where you can browse the Void Trader’s entire inventory! {STEAM_CLAN_IMAGE}/4437469/9feace4d0f0aecf2eb3ede09421ced80cd245cc1.png Recall Ten-Zero Recall: Ten-Zero has begun, Tenno! From now until TennoCon, engage with a series of five weekly Alerts with brand-new Rewards commemorating some of the most unforgettable Warframe moments including Quests, Nightwave, Tactical Alerts and more! Relive Vor’s Prize in the first week of Alerts to get the Darvo Noggle, Orokin Catalyst and Vor Recall Glyph. Complete every mission for three out of five Weeks of Alerts to receive the 10-Year Anniversary Emblem. Then complete all five Weeks to get the Kyndryn Gunblade Skin! Learn more about Recall Ten-Zero. {STEAM_CLAN_IMAGE}/4437469/116ef9c0bc69ec9a06d7104a47f65e478e0cbbca.png 10 Year Login Reward + Drops This year, there will be three ways to reinforce your Arsenal during TennoCon with login rewards and Twitch & Steam Drops! Starting August 26, log in to Warframe to claim the Dex Operator and Drifter Suit Get the Gotva Prime Rifle when you watch TennoCon for 30 minutes between 12:30 p.m. ET and 4:30 p.m. ET Get Gara Prime when you watch TennoLive for 30 minutes between 4:30 p.m. ET and 6:30 p.m. ET Make sure your account is linked to Twitch to ensure you’re eligible to receive these drops for tuning in to TennoCon 2023 on Twitch! {STEAM_CLAN_IMAGE}/4437469/55e7eca4a03ecd87cd28b80662f5fa0cf563bfd0.png Merch Pack Pre-Order and Darvo Deals Display your love of Warframe with a Merch Pack that celebrates 10 years of the game! The TennoCon 2023 Merch Pack features an adorable Clem Plush with magnetic Twin Grakatas, a TennoCon T-shirt featuring major updates from the game’s first decade and glow-in-the-dark enamel pin. Pre-order your Merch Pack today! Darvo Deals also makes its return, with savings on select merchandise starting now and more coming as TennoCon approaches! Just like Darvo, these deals are pretty elusive – so act now, Tenno! {STEAM_CLAN_IMAGE}/4437469/5f26faf0e7e0110349592f3981c364c4a222126b.jpg Wisp Prime Access Reap devastation with Wisp Prime Access, starting July 27! Stay tuned for a new Prime Access trailer next week and get ready to add a haunting new Prime Warframe, Weapons and signature Accessories to your Arsenal. {STEAM_CLAN_IMAGE}/4437469/9c6a2f0c89d92de1af93c040a8311062ed338c1f.png",
                "feedlabel": "Community Announcements",
                "date": 1689783245,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 230410,
                "tags": [
                    "workshop"
                ]
            },
            {
                "gid": "5124582150171237693",
                "title": "Claim free in-game items and enter to win slick hardware!",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5124582150171237693",
                "is_external_url": true,
                "author": "benloates",
                "contents": "Bolster your Arsenal with a new giveaway courtesy of Alienware! From now until July 21, 2023, all Tenno can claim free in-game items by completing various Alienware Arena community challenges. Embody pure Void energy with the Excalibur Avalon Helmet and cut down foes with the elegant Prisma Skana and let the entire Origin System stand in awe of your magnificence! Head over to Alienware Arena to learn more information regarding the community challenges. The Alienware Bundle features: Excalibur Avalon Helmet “Excalibur In Action” Glyph Prisma Skana Weapon Karak Grineer Rifle Weapon Tenno Color Palette That’s not all, Tenno! We're also giving away an incredibly sleek Warframe themed Alienware M16 Laptop to upgrade your gaming setup! {STEAM_CLAN_IMAGE}/4437469/b99988562f76c218af4d973b7d8f2f327b866aed.png Entries will be accepted from July 10 at 10 a.m. ET to July 18 at 10 a.m. ET via Gleam.io. Just submit your name and email address to enter, and make sure to complete any additional actions for extra entries: New to Warframe? Play free now and sign up here. We'll announce the lucky winner through Twitter on July 18, 2023, so be sure to follow us there! The winner will also be notified privately via the email address provided for the initial entry. Check out the official Alienware x Warframe giveaway sweepstakes rules for more information.",
                "feedlabel": "Community Announcements",
                "date": 1689003619,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 230410
            }
        ],
        "count": 1336
    }
}