{
    "appnews": {
        "appid": 1938090,
        "newsitems": [
            {
                "gid": "5124585319857507008",
                "title": "«Ricochet вошёл в чат»: В Call of Duty будут уведомлять игроков о читерах в самих матчах",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/Gamemag.ru/5124585319857507008",
                "is_external_url": true,
                "author": "Илья Корпылёв",
                "contents": "Компания <strong>Activision</strong> сообщила об обновлении античита <strong>Ricochet</strong> в <strong>Call of Duty: Modern Warfare II</strong> и <strong>Warzone</strong>. Теперь уведомления об исключении читеров из матча будут отображаться прямо в «ленте убийств» . ",
                "feedlabel": "Gamemag.ru",
                "date": 1691262060,
                "feedname": "Gamemag.ru",
                "feed_type": 0,
                "appid": 1671410
            },
            {
                "gid": "5124585319849369131",
                "title": "Первые постеры Call of Duty: Modern Warfare III — анонс состоится 17 августа",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/Gamemag.ru/5124585319849369131",
                "is_external_url": true,
                "author": "Илья Корпылёв",
                "contents": "В сети появились ключевые арты шутера <strong>Call of Duty: Modern Warfare III</strong> от <strong>Sledgehammer Games</strong>. Их опубликовали датамайнеры. ",
                "feedlabel": "Gamemag.ru",
                "date": 1691065380,
                "feedname": "Gamemag.ru",
                "feed_type": 0,
                "appid": 1671410
            },
            {
                "gid": "5124585319846700745",
                "title": "All in one place: Call of Duty",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5124585319846700745",
                "is_external_url": true,
                "author": "csmedley",
                "contents": "Going forward, future Call of Duty® titles can be played from the same location on Steam. This should make deploying to the battlefield even more straightforward, so you and your squad can worry less about where to launch and more about how to score your next victory. You can continue diving straight into Call of Duty®: Modern Warfare® II and Call of Duty®: WarzoneTM from one central location, now represented by the Call of Duty logo. Call of Duty®: Vanguard, Call of Duty®: Black Ops Cold War, Call of Duty®: Modern Warfare®, and other Call of Duty® titles will continue to be accessed separately on the favorites list and in your library. ",
                "feedlabel": "Community Announcements",
                "date": 1691009252,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 1938090
            },
            {
                "gid": "5124585319846164822",
                "title": "Modern Warfare II and Warzone Season 5: Update",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5124585319846164822",
                "is_external_url": true,
                "author": "RedBruto",
                "contents": "“Let’s unleash the beast, shall we?” SPOILER ALERT: This introduction continues the story of Call of Duty®: Modern Warfare® II to set the stage for Season 05. Commander Phillip Graves was presumed KIA during a ferocious tank battle during the Modern Warfare II Campaign, after turning on members of Task Force 141. Graves is alive. Even if Task Force 141 successfully secured the warhead as part of their RAID, Farah lost her brother — and AQ asset — Hadir . . . but not before he revealed that a greater threat is on the horizon. Unbeknownst to Price, Gaz, and the rest of 141, Farah and Alex head back into Urzikstan. A meeting has been set up with a former enemy who apparently wasn’t incinerated in his tank at the Fuerzas Especiales Headquarters in South America. Three elite leaders pore over a map of Al Mazrah, where Graves has intel on a new ultranationalist threat now present in the AO, the same group Hadir could not speak of in his dying breaths: The Konni Group. This is Season 05 Call of Duty: Modern Warfare II and Call of Duty®: Warzone™, launching on August 2 at 9 AM PT. ",
                "feedlabel": "Community Announcements",
                "date": 1690996553,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 1938090,
                "tags": [
                    "mod_reviewed",
                    "ModAct_1400956464_1690996987_0",
                    "mod_require_rereview"
                ]
            },
            {
                "gid": "5124585319846139566",
                "title": "Season 05 Patch Notes",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5124585319846139566",
                "is_external_url": true,
                "author": "csmedley",
                "contents": "Season 05 is here, bringing a fresh twist of the knife in the Call of Duty: Modern Warfare story, impressive free content drops across both Modern Warfare II and Call of Duty: Warzone, to celebrating the 50th anniversary of hip hop, and much, much more. Read the full patch notes here.",
                "feedlabel": "Community Announcements",
                "date": 1690995950,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 1938090
            },
            {
                "gid": "5124584686264904318",
                "title": "Content Drop: Season 05 BlackCell, Battle Pass, and Bundles",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5124584686264904318",
                "is_external_url": true,
                "author": "csmedley",
                "contents": "Announcing the Season 05 Battle Pass  Commander Graves (very much alive) and Oz, one of Shadow Company’s finest leaders in cyber warfare, are about to launch a counterattack against the greatest threat to Modern Warfare® in Season 05. The Season 05 Battle Pass features 100+ rewards, including two new functional weapons, Commander Graves, and a ton more content that will prepare you for a critical season of Call of Duty®: Warzone™ and Call of Duty®: Modern Warfare® II. In fact, for the first time in Call of Duty® history, there will be five total Operators offered across the Battle Pass and BlackCell, an unprecedented value for those looking to reinforce their roster with Shadow Company’s finest. Like prior seasons, purchasing the Battle Pass for 1,100 COD Points grants access to all 100 Tiers, while the BlackCell — available for $29.99 USD (or regional equivalent — offers even more rewards on top of everything in the standard Battle Pass. BlackCell Season 05 {STEAM_CLAN_IMAGE}/42501705/ad55bc4611a0c9a12424d0981c3c07525368145d.jpg In summary, the BlackCell offering for Season 05 includes the following: Full access to the Season 05 Battle Pass, plus 20 Battle Token Tier Skips. The full Battle Pass includes 1,400 COD Points within 100 Tiers of unlockable content from Battle Pass progress. The BlackCell Sector, including 1,100 COD Points; the new BlackCell Operator Arthur and his Tactical Pet Merlin; the “Caliburn” Tracer Weapon Blueprint; and Gwen, a Battle Buddy Gun Screen. An exclusive BlackCell Sector within the Battle Pass AO serving as an alternative starting location. Additional BlackCell-only Battle Pass content: eight BlackCell Operator Skins – one for Ghost, Alex, Roze, and new Operator Velikan, and two for new Operators Oz and Graves – six Tracer Weapon Blueprints, and two Vehicle Skins. Players who upgrade to BlackCell after purchasing the Battle Pass will also receive 1,100 COD Points back. For more information, check out the dedicated BlackCell blog here. Shadow Company’s Arthur Joins BlackCell {STEAM_CLAN_IMAGE}/42501705/a8b553ce9907f19481b23980c961f37c5c7359c4.jpg One of Shadow Company’s best, Arthur is ]. All we know is that he is a warrior to the core. No face, only a callsign; he is apparently a legend, but no legible records were found. And the only companion he associates with his second-in-command, a K9 Unit in Merlin. New Tactical Pets Companion Feature {STEAM_CLAN_IMAGE}/42501705/769e96453d7d2810ac5b15c0c5735b5f21a59e09.jpg New to Modern Warfare® II, Operators will have the option to bring companions alongside them in Multiplayer, Battle Royale, and DMZ modes. This provides the unparalleled benefit of companionship along with a devastating Finishing Move. Merlin — and other Tactical Pets— cannot be harmed in any way and play a role in Finishing Moves. . . . Just remember to equip the Finishing Move separate from the companion when editing your chosen Operator. New: Battle Buddy {STEAM_CLAN_IMAGE}/42501705/312796c954aed7571b727e10b716efa10b660e5f.jpg Another new addition to Modern Warfare II is a Battle Buddy  – virtual “assistants” who act as a mini-announcer with some additional personality. “Gwen” is the first, as her Gun Screen – what she prefers as opposed to “Battle Buddy” – is packaged with Arthur and his K9 unit Merlin. Just perform well with her equipped, because she has no time to assist with anything but a successful mission. She will callout Killstreak activations, kills – including with specific weapons or equipment – and other in-game personal events, especially when you win or perform well in a match. Purchase the Battle Pass to Unlock Graves, Oz {STEAM_CLAN_IMAGE}/42501705/0937ab3bc5304ef3b4a5ae23677c672441d55e4c.jpg As mentioned, the BlackCell offering includes everything in the Battle Pass. However, whether you are BlackCell or just picking up the standard Battle Pass for 1,100 COD Points, everyone gets two Operators in the instantly unlocked Bonus Sector: Oz and Graves. Yes, Phillip Graves is back alongside a new Shadow Company leader in Oz. They co-headline Battle Pass for Season 05, and their biographical information is here. {STEAM_CLAN_IMAGE}/42501705/f4b5f2f0488a7d7e5ff3c4cb2c3e8f0317f84b2d.jpg The instant reward Sector for the Season 05 Battle Pass will include both Graves and Oz as Operators with their default Skins. It also will award the blue and silver “Take Point” Assault Rifle Weapon Blueprint, meant for midrange engagements; the  “Lucena” Shotgun Weapon Blueprint, perfect for close-quarters situations; and a 10% Battle Pass boost. BlackCell owners will also unlock two alternate black and gold Operator skins – one for Oz and another for Graves – as part of the instant reward sector. Velikan Returns in Battle Pass, Additional Operator Also Included {STEAM_CLAN_IMAGE}/42501705/bef3b7e695188274021e2293f7089ef41dd6f60a.jpg The fourth new Operator in the Battle Pass and BlackCell offering is a familiar face whether you played Modern Warfare (2019) or ventured into Building 21. Available as the HVT of Sector 19 in the Season 05 Battle Pass, Velikan is a giant in terms of his legacy. Not many people know of this Shadow Company mercenary’s past, but they do know of his current assignments . . . by way of facing him down on the wrong side of the fight. Battle Pass Skin: The former Shadow Company warden of Building 21 deploys with a painted helmet and orange trim accentuating his gray heavy armor. BlackCell Additional Skin: Velikan’s enhanced BlackCell Skin variant adds gold embellishments and a darker shade of armor embellished by electric-blue trim. Mila Also Joins the Fight Via Battle Pass {STEAM_CLAN_IMAGE}/42501705/5606d232e42c0db12acdb7c01afcdccc5fa61f0f.jpg Although her bio is ], Mila is a powerful warrior who fights for KORTAC across Multiplayer, Special Ops, and any Call of Duty: Warzone modes. She is available as the HVT of Sector 6, and has the following Skin at launch: Battle Pass Skin: Simple yet effective, Mila is prepared for combat with a tactical (non-functional) armor vest and standard-issue blue-and-black gear. She also comes with some sweet shades to protect her from the desert sun in Al Mazrah. New HVT Operator Skins Operators on both factions are in place for the next game across new battlegrounds. BlackCell owners get eight additional Operator Skins with enhanced black-and-gold aesthetics when completing certain HVT Sectors across the AO. These Operators are no pawns; they are ready to pull double duty to stop Konni, regardless of their allegiance. “The Bishop” Skins for Alex (Sector E13, HVT) {STEAM_CLAN_IMAGE}/42501705/45bdf5ed6d6c289db8ce4d49ce4d7e477a1d37c7.jpg Battle Pass Skin: Alex prepares for heavy fighting in a helmet and fatigues, sturdy boots, and a beige vest topped off with ammo and gear. BlackCell Additional Skin: Heavy armor with big style. This black and gold set means business, his prosthetic leg reinforced and recolored to match. “Bad Bishop” Skins for Roze (Sector E14, HVT) {STEAM_CLAN_IMAGE}/42501705/ce40e07b276e52dd64f2fcd0ec48d3d2931d2d81.jpg Battle Pass Skin: Equipped in medium armor balancing mobility and defense, Roze additionally conceals her identity behind a mask, preserving anonymity in the field. BlackCell Additional Skin: To match her tricked out armor, Roze opts for a golden mask and emits a green and blue hue in her animated BlackCell alternate Skin. “The Rook” Skins for Ghost (Sector E17, HVT) {STEAM_CLAN_IMAGE}/42501705/67583dc400ffba497d60c49a34f5cbff2e5295e8.jpg Battle Pass Skin: The perfect gear for the desert landscape of Fort Resurgence, “The Rook” finds Ghost in a cape and his signature mask, exchanging his typical dark colors for a more muted beige, brown, and white. BlackCell Additional Skin: Trade the muted look for a striking black and gold variant, featuring topographical designs over the pants and jacket, as well as gilded strips along his hood and cape. New Weapon HVTs in Sectors E7, E8 Season 05 brings two new, free functional weapons to unlock in the Battle Pass: the long-distance Carrack .300 and the rapid-fire FR Avancer. Carrack .300 Sniper Rifle (Sector E7, HVT, Free) {STEAM_CLAN_IMAGE}/42501705/5fd9eeed4da9f2386a698cf30fdbc5342beab101.jpg This semi-auto bullpup sniper rifle features an exceptionally high fire rate and is capable of putting multiple rounds into targets at long distances. Operators seeking a fast-firing yet accurate Sniper Rifle should look no further than the Carrack .300. While it may not possess the power-per-bullet of its harder-hitting companions, this weapon is still capable of inflicting heavy damage from a distance with proper shot placement to the head down to the upper chest. In fact, its strength lies in its ability to deliver quick follow-up shots so long as the Operator behind it handles its high vertical recoil. Use the Gunsmith to fashion the Carrack .300 into a highly mobile and fast-handling weapon for aggressive play. Alternatively, with the right attachments, an Operator can lean into its strengths by extending its damage range and stabilizing its recoil for sturdy longshots. Find your preferred balance and reap the rewards in long-range fights no matter the operation. FR Avancer Assault Rifle (Sector E8, HVT, Free) {STEAM_CLAN_IMAGE}/42501705/1fe44ad1f38419459b2dda1476b9a66ace55dc86.jpg With a blinding fire rate and exceptional maneuverability, in the right hands, this aggressive bullpup rifle can dominate the battlefield. Shred enemies with this midrange bullpup rifle that features a rapid-fire rate and a strong vertical recoil to match. Its solid hip-fire spread and high damage per minute make it a phenomenal weapon up close in addition to its “category standard” range for all Assault Rifles. And with a recoil pattern that’s easy to learn, an Operator with a steady hand or trigger discipline can make this tool a devastating Primary Weapon in any operation that calls for close- to midrange combat. The Gunsmith allows Operators to maximize efficiency with the FR Avancer. Equip it with an extended magazine, or a Laser for improved aiming capabilities, an Underbarrel for recoil control, a Stock to counter mobility penalties from other attachments, and a red dot Optic for better visibility. . . . Or do all of the above in a well-balanced yet powerful combination fit for fighting entire squads. New Weapon Blueprints, Vehicle Skins A larger game is looming over the Battle Pass. . . . The Weapon Blueprints on offer give you plenty of moves to make no matter the mode, allowing you to put even the most worthy of opponents in serious checkmate. King Hunter — Assault Rifle (Sector E1, HVT) {STEAM_CLAN_IMAGE}/42501705/9e6a8f6c6dad31567d809ee9f4639fee4ff6a787.jpg Cool off with this cobalt-blue Assault Rifle Blueprint unlockable right at the normal starting position in the Battle Pass. The “King Hunter” outfits this staple weapon with an extended damage range, a holographic sight, and recoil stabilizers for a cleaner shot. Also available for BlackCell owners is the “King Hunter BlackCell” Weapon Blueprint. Offering a similar attachment setup to the standard “King Hunter” Assault Rifle but with a sleek black-and-gold finish and Tracer Rounds, this is one of the six additional Weapon Blueprints BlackCell owners can receive as part of the full Season 05 Battle Pass. Banneret — SMG (Sector E12, HVT) {STEAM_CLAN_IMAGE}/42501705/18d5242e6881ce80edbd2d89a4740fbf7607393b.jpg Based off the SMG introduced in Season 04, the “Banneret” is a Shadow Company–themed weapon featuring a bloodred skull design and a balanced attachment setup. Customized with an extended damage range plus improved recoil control and stability, the “Banneret” is a capable tool against enemies up close and at midrange. Raider — Battle Rifle (Sector E14, Non-HVT) {STEAM_CLAN_IMAGE}/42501705/4b4f34c43ead55a966fc0ef28fe9f19d30cfc5a8.jpg For Shadow Company Operators, the “Raider” Weapon Blueprint features a precision sight picture along with improvements to aiming stability and recoil control. It is a Battle Rifle meant for midrange combat, harmonizing precision and power to grant an accurate and well-positioned Operator a commanding presence in their engagements. New Vehicle Skins {STEAM_CLAN_IMAGE}/42501705/4f476440701aa39247511932b4d116ec1173fb99.jpg Several new Vehicle Skins are here for those designated drivers around Ground War and other modes across Call of Duty: Warzone and Modern Warfare II. Get the “Magnitude” Heavy Tank Skin in Sector E15; if its skull-inlaid, white paint job doesn’t scare off the enemy, it’s black and gold cannon and turret sure will. In Sector E2, access the “Wheeled Steed” Dirt Bike, which includes an additional BlackCell Skin variant. Remember: BlackCell owners get that variant Skin as well as another Vehicle Skin variant as part of the full BlackCell offering in Season 05. Complete the Map for Victory Sector Tier 100 Rewards {STEAM_CLAN_IMAGE}/42501705/b97df96f26b5466c738574dc731d94c69c42b426.jpg Conquer all Sectors to access the final Victory Sector: “Grandmaster” Assault Rifle Blueprint {STEAM_CLAN_IMAGE}/42501705/a07851ac4f856c46f4fee7c4932757dd27218698.jpg This five-attachment build highlights the versatility of the new Assault Rifle in the Battle Pass. In this configuration, a 45-Round Mag helps offset the weapon’s high fire rate, with other attachments improving its Aim Down Sight speed and flinch resistance for a snappy and sturdy weapon that’s as effective as it looks. Also available to BlackCell owners is the “Grandmaster BlackCell” Weapon Blueprint. This variant dips the whole weapon in a black-and-gold aesthetic with Tracer Rounds, making this Primary Weapon serious royalty when it comes to any loadout. “Shadow 0-1” Tier 100 Skin for Graves {STEAM_CLAN_IMAGE}/42501705/ca5843c3c69c79808d7fbb0ab064799dc7adfb1b.jpg Commander Graves deploys in his classic all-black Shadow Company gear, featuring a tool for every possible scenario. BlackCell owners also get a variant for this Skin, which adds gold leaf to some of Graves’ practical body armor. “Onslaught” Tier 100 Skin for Oz {STEAM_CLAN_IMAGE}/42501705/715d7970b047dcf844d5790c8f269b3989cee3ff.jpg Break their will to fight with this red, black, and brown Tier 100 Skin featuring a terrifying helmet and twin machetes at his sides, both hooked at the end and appearing well-worn with the blood of enemies. The third BlackCell addition makes this tier an incredible value for owners. The “Onslaught BlackCell” Skin makes Oz a true gilded menace with his long braids flowing over his glitzy gold and black attire. 300 COD Points, Emblem Players who reach Tier 100 will also unlock the “Knight 5” Emblem and 300 COD Points to put toward their next regular Battle Pass or Store Bundle purchase. Store Highlights: Call of Duty Celebrates 50 Years of Hip Hop Celebrate 50 years of hip hop with two new Operators who are synonymous with the culture and are innovators within the genre, both available at launch. 21 Savage will be available at mid-season; his bundle details will be revealed closer to that launch date. Tracer Pack: Snoop Dogg — Return of the Shizzle {STEAM_CLAN_IMAGE}/42501705/95995d111544bd2f32dc030d90c01a206c6d963f.jpg Snoop Dogg returns to the series in a Bundle featuring two Operator Skins: the default “Snoop Dogg” and the “D-O-Double G” alternate Skin. Blaze up the competition with the “Life of Da Party” Assault Rifle, the “Toke Force 141” SMG, and the “Wild and Free” Sidearm Weapon Blueprints. And take out enemies from behind with the “Snoop Hustle” Finishing Move. Ride around in style with the “High Rider” Hatchback Vehicle Skin, represent his label with the “Death Row Records” Weapon Charm, roll in with “A Snoop Thang” Loading Screen, and show your fandom off with the “Snoop” Emblem on your Player Profile. Pro Pack: Gunslinger Ghost {STEAM_CLAN_IMAGE}/42501705/cc921b70a0e4058a93fe383c75c84a86d263e815.jpg Saddle up to the fight with the Pro Pack: Gunslinger Ghost Bundle, available in Season 05 for $19.99 or your regional equivalent. This pack includes the “The Marshal” Operator Skin, which has Ghost looking like he is ready to lay down the law whether it’s out in the Wild West or in Al Mazrah. Take control of the lobby with “The Bandit” Assault Rifle and “ Gallows Call” Sidearm Weapon Blueprints, or ride into the sunset with the “Saddle Up” Vehicle Skin. Additional customization options include the “Wall Mounted” Sticker, “Grave Marker” Weapon Charm, and the “Rounds and Roses” Emblem. The Pro Pack: Gunslinger Ghost Bundle also comes with 2,400 CP to put toward your next Store or regular Battle Pass purchase. Tracer Pack: Elementals: Iceflow {STEAM_CLAN_IMAGE}/42501705/63e97f3ee81b2de3718295d3c88d439f4fd6941a.jpg Send shivers down their spine with the “Dead Winter” Operator Skin for Valeria, outfitted with the “Snowfall” Assault Rifle and “Cold Wind” LMG Weapon Blueprints, plus the “Polar Vortex” Vehicle Skin for the ATV. When you need to get stealthy, freeze their hearts with the “Ice Spike” Melee and Throwing Knife variant. Other cosmetic items include the “Deep Freeze” Weapon Charm, “Electric Ice” Loading Screen, “Cold Heart” Sticker, and the “Deadly Lead” Emblem. Tracer Pack: Dark Rituals III {STEAM_CLAN_IMAGE}/42501705/812afd6131b819af6cc9d1d9d7100575a004c84b.jpg The Dark Rituals series continues with its third installation offering the “Possessed” Operator Skin and three Weapon Blueprints: the “To Dust” Assault Rifle, the “Death’s Door” Battle Rifle, and the “Necrotic” Sniper Rifle. Equip the “Grave Digger” Frag Grenade variant, and further the reaper’s cause with the “Death’s Harbinger” Loading Screen and “Just Ghostly” Emblem. This Bundle also features a one-hour Double Player XP and one-hour Double Weapon XP token. Tracer Pack: Penumbra + Universal Wrap {STEAM_CLAN_IMAGE}/42501705/3aeeeae0a140ba1d0182c6cd3daaf8146c036333.jpg Equip Shadow Company’s “Onyx Pitch” Assault Rifle Blueprint and outfit it with the “Vault Keeper” Sticker and “cubic Weapon Charm. Complete your Shadow Company allegiance with the “Destination: Chaos” Loading Screen and “Shadow Company” Emblem. All of these offerings are just some of what is on offer as part of Season 05, with more Bundles to be released as part of the Reloaded update. Stay frosty. © 2023 Activision Publishing, Inc. ACTIVISION, CALL OF DUTY, and MODERN WARFARE are trademarks of Activision Publishing, Inc. All other trademarks and trade names are the property of their respective owners. For more information, please visit www.callofduty.com and www.youtube.com/callofduty, and follow @Activision and @CallofDuty on Twitter, Instagram, and Facebook. ",
                "feedlabel": "Community Announcements",
                "date": 1690909961,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 1938090
            },
            {
                "gid": "5124585319843259504",
                "title": "Steam Global Top Sellers for week of 25 Jul — 1 August 2023",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/SteamDB/5124585319843259504",
                "is_external_url": true,
                "author": "SteamDB",
                "contents": "<a href=\"https://steamdb.info/topsellers/2023W31/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\"> </a> * <a href=\"https://steamdb.info/app/1282100/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">Remnant II</a>; * <a href=\"https://steamdb.info/app/1086940/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">Baldur's Gate 3</a>; * <a href=\"https://steamdb.info/app/1675200/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">Steam Deck</a>; * <a href=\"https://steamdb.info/app/1938090/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">Call of Duty®</a>; * <a href=\"https://steamdb.info/app/381210/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">Dead by Daylight</a>; * <a href=\"https://steamdb.info/app/1895880/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">Ratchet & Clank: Rift Apart</a>; * <a href=\"https://steamdb.info/app/671860/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">BattleBit Remastered</a>; * <a href=\"https://steamdb.info/app/1174180/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">Red Dead Redemption 2</a>; * <a href=\"https://steamdb.info/app/271590/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">Grand Theft Auto V</a>; * <a href=\"https://steamdb.info/app/359550/charts/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">Tom Clancy's Rainbow Six® Siege</a>; <i>* excluding free to play games</i> <a href=\"https://steamdb.info/topsellers/2023W31/?utm_source=Steam&utm_medium=Steam&utm_campaign=SteamRSS\">View top 100 on SteamDB</a>",
                "feedlabel": "SteamDB",
                "date": 1690905600,
                "feedname": "SteamDB",
                "feed_type": 0,
                "appid": 271590
            },
            {
                "gid": "5124584686263689236",
                "title": "ЕС: Call of Duty и другие игры Activision Blizzard, скорее всего, будут добавлять только в Xbox Game Pass Ultimate",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/Gamemag.ru/5124584686263689236",
                "is_external_url": true,
                "author": "Дмитрий Чистяков",
                "contents": "Компания <strong>Microsoft</strong> находится в шаге от приобретения Activision Blizzard и многие фанаты Xbox ожидают, что после завершения сделки игры серии <strong>Call of Duty</strong> массово начнут появляться в <strong>Game Pass</strong>, однако в этом может быть небольшой подвох. ",
                "feedlabel": "Gamemag.ru",
                "date": 1690847340,
                "feedname": "Gamemag.ru",
                "feed_type": 0,
                "appid": 1938090
            },
            {
                "gid": "5124584686261236773",
                "title": "Call of Duty: Modern Warfare II Strike Map Intel",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5124584686261236773",
                "is_external_url": true,
                "author": "csmedley",
                "contents": "Strike Urzikstan Day 278, 11:00 Factions Deployed: SpecGru / KorTac In this sprawling urban center, there’s danger at every corner and enough traversable buildings to make you check both high and low when approaching the next objective. The map’s larger size provides ample opportunity to get into position before the fight begins. Will you move up in haste to bring the battle to the enemy right away, or melt into one of many power positions, waiting for the enemy to come stumbling into your line of sight? In this iconic 6v6 Core Multiplayer map – first released in the original Call of Duty® 4: Modern Warfare® and re-released in Modern Warfare 2 (2009) – launching with Season 05 in Call of Duty®: Modern Warfare® II, the possibilities are endless. {STEAM_CLAN_IMAGE}/42501705/1620e5ff51e201b637a4ee32cd8786d1581d854f.jpg KorTac Spawn Zone (Northeast) — Junkyard Starting from the Junkyard, KorTac forces have several options at the start of the match, with each path catering somewhat to a certain type of Loadout. Midranged Loadouts perform well through the southern Market route; prepare to engage at the dividing wall. Those with closer-ranged Loadouts may prefer to book it toward the western Clock Tower, using its pedestal and the surrounding buildings to cut sightlines short. For snipers, the real prize is found along the central Main Street, a long route with little visual obstruction down the length of it. A two-story building is essentially the “hero” of the map for these sharpshooters, as it will become a power position and focal point for combat early and often during a match. Spawn Point: SpecGru {STEAM_CLAN_IMAGE}/42501705/b8b9f7ab0ec21278f60ff8754d55602b2ee8663a.jpg SpecGru Spawn Zone (South) — Hill From the southern Hill location, fast SpecGru Operators can get the advantage over the Clock Tower by rushing north to the second story of the Main Store. From here, you’ll have a powerful vantage point over the eastern half of the tower. You might also head east and up the Flower Shop stairs for a vantage point over enemies coming through the Market. For snipers and other long-ranged Loadouts, consider booking it to the west end of Main Street, where you’re likely to encounter enemy snipers on the other side, so be ready to engage. Map Maneuvers: Route Planning {STEAM_CLAN_IMAGE}/42501705/8aca8c99be2e132428e0e48e52697b0ceabe488c.jpg For the purposes of this guide, we’re dividing Strike into seven main sections: Junkyard and Market Apartment Clock Tower Shops Main Street Hill Flower Shop {STEAM_CLAN_IMAGE}/42501705/51dbba7091dbf45b7e4430e2bc6a4131a7fd8be5.jpg Junkyard and Market Starting in the northeast and running south through the Market, this section offers a great means of moving up and down the map without being exposed to the central Main Street. Its narrow layout and plentiful cover pieces allow close- and midranged Loadouts to shine in a map where long distances are the mainstay. There’s also easy access to the Apartment and Electronics Store for making a push west, both offering valuable cover when combat gets heated. {STEAM_CLAN_IMAGE}/42501705/62024b4c7a360f4e81572851111dcffff90736f7.jpg Apartment Easy to spot by the big “Laundry” sign hanging out front, the Apartment marks a critical point in the northeast section of the map, standing guard over the Junkyard, Market, Crashed Car, and the roads leading toward the Clock Tower and Main Street. Its two levels offer multiple points from which to launch an attack, so an active player can attack on all sides. {STEAM_CLAN_IMAGE}/42501705/d8f1613a56cedaffaedccfc900e6d80c31cc19e8.jpg Clock Tower Surrounded by high walls, the Clock Tower and Culture Center behind it mark another point where shorter-ranged Loadouts can perform well. The entry points from the Café to the west, Main Street to the south, and Apartment to the east present some risk when holding these positions, but the area’s central location gives Operators a chance to cut off a major thoroughfare through the map. Lock down this spot and enemies will be forced into crossing Main Street. {STEAM_CLAN_IMAGE}/42501705/af7f92f1dbb92991fd27e7265b0a9ca15e7e13cc.jpg Shops The Shops form a key area around the western section of Main Street, providing access to several interior spaces. The Café and Main Store are great starting points for an attack toward the Clock Tower, with the upper Main Store additionally looking deep into Hill. The Restaurant on the area’s southern border offers a large ground-floor interior; hop onto the walls surrounding its outdoor seating for a raised view over the Shops. {STEAM_CLAN_IMAGE}/42501705/23b7d604c083ff535a4bffbc590856e3c1d7fcdf.jpg Main Street A sniper’s paradise, Main Street stretches nearly all the way across the map. Located in the center, it’s also a major crossing point. If you need to get through, take a moment to read the area and then race across using Tactical Sprint. Expect Operators to occupy the buildings on its perimeter, namely the Main Store on its west end, the Electronics Store on its east end, and the Hotel along the bottom. Expect fighting from building to building, with Operators in the street getting caught in the middle. Sandbags, barricades, and other obstacles offer some cover in the street, but you’ll still be highly exposed from multiple angles. {STEAM_CLAN_IMAGE}/42501705/b363c6a0c434acfb66f6c8165e949a32347b326a.jpg Hill While not quite as concealed as the Junkyard main spawn, the Hill sits relatively apart from the rest of the map, at least when pulling back behind Thorley’s Supermarket. Note that, for this version of Strike, a new hallway was added for better combat flow, ensuring that an Operator that holes up in the Supermarket can still be smoked out through this hallway. When looking north, long-ranged Loadouts can get some shots on enemies in the Main Store and even out to the Shops. Note the balcony of the orange building here — this provides a good vantage point against enemies moving between Hill and the Flower Shop just east. And watch for Shotguns when traversing the tight staircase connecting Hill and Restaurant. {STEAM_CLAN_IMAGE}/42501705/8a25ee80e1223bb63bc422c004e415389710040c.jpg Flower Shop The Flower Shop provides a strong power position over activity in the southeast, with its upper level offering views toward Hill, over the Market, and a small section of the eastern Main Street. From the ground floor, its single front entrance provides a more concealed view against enemies coming in from the north. The gas station just east is also worth mentioning; while you can’t get inside of it, the low stone wall and barricade offer solid protection when skirmishing in the area. Objective Routes and Rotations {STEAM_CLAN_IMAGE}/42501705/8ecb4f2e665f23a6471f8bd94d4f48c3b33042b0.jpg Mode Intel: Domination Main Street heats up even more in Domination, with all three flags positioned just out of sight of the main drag. In the west, the A flag sits within the Restaurant’s outdoor seating area, surrounded by high walls. It’s a short trek from here to the B flag at the base of the Clock Tower, but the deadly Main Street separates the two. Positioned in the eastern Market, the C flag presents a longer travel time to B, but it’s possible to move between the two flags without crossing Main Street. The team that can hold down the Clock Tower is in the best position to win, even if that means swapping between A and C as your second flag; because the area is relatively protected, it’s not as difficult a task as capturing B in other maps. Mode Intel: Search & Destroy It’s a long route to the bomb sites on this large map, with the attacking team starting in the southern Hill, the A site positioned by the Cultural Center behind the Clock Tower, and the B site in the eastern Market just behind the Apartment. The defending team therefore has ample time to get into position, so take it slow and communicate. Thankfully, because both sites are north of Main Street, attackers can avoid the danger there by quickly crossing over at the start of the match. Moving east from Shops is also a solid strategy, as well as booking it to the Flower Shop and then working your way up to the B site. On defense, the Apartment offers an obvious power position over B, so it may be wise to send the bulk of your forces to the A site until you have a better idea of where the attackers are heading. And don’t hesitate to fan out, as this provides the team a greater overall field of view. Mode Intel: Hardpoint There are six total Hardpoints on Strike, making this a great mode for learning all the ins and outs of the map. Teams will first rush to the center with the initial Hardpoint appearing inside the Hotel before moving just west outside the Restaurant; bulk up your forces between these two areas to increase your chances of getting the most points out of both objectives. From the Restaurant, the objective moves to the Electronics Store on the other side of Main Street, then south to the Flower Shop. As with the first two Hardpoints, sending the bulk of your forces between the third and fourth objectives can help you form an early lead in the match. From the Flower Shop, teams will need to cross the map for the fifth Hardpoint by the Cultural Center; get some Operators there early since it’s a long trip. The final Hardpoint appears in the primary room of the upstairs Apartment. On a larger map like this, early rotations are crucial, so play aggressively. Top Tips {STEAM_CLAN_IMAGE}/42501705/300f6872a1658d2edbae5a1e6b12878dd4c23565.jpg 1. Learn the layout. With large buildings around every corner, you might at first feel like you can’t move a step without being spotted from some balcony. That’s not the case, however, as many of the buildings are closed off or only accessible on the ground floor. Take your time learning where the real threats are so you can ignore the rest. 2. Know your power positions. Once you’ve identified the traversable buildings, it’s time to lock in on the major power positions so that you know where to look when passing through. Get to know the Flower Shop, Apartment, and Main Store, and don’t neglect power positions located on the ground floor in places like the Hotel and Electronics Store. 3. Up in smoke. Enemy snipers clogging up Main Street? Equip a Smoke Grenade so you can obstruct their view when you need to pass. Pair it with the Drill Charge to blast enemies inside buildings and behind the walls by the Clock Tower and Restaurant. 4. Found you. On larger maps like Strike, it can be more difficult to pinpoint the enemy’s location. Use the Spotter Bonus Perk to check for fortified positions around the map, particularly within and around the main traversable buildings. 5. Special delivery. Can’t seem to dislodge the enemy Operator holed up in the Apartment or get close to that deadly sniper on Main Street? Use the Bomb Drone Killstreak to send them an explosive gift. It’s cheap and it gets the job done. 6. Pick up weapons. On bigger maps, there’s often a greater chance of running through your ammo reserves. Expand your supply by picking up weapons on the ground as you move through the map. 7. Easy Care Packages. Fall back to the Junkyard or Hill for an easy Care Package deployment. While the enemy is fighting for control over Main Street, you’ll be safely acquiring your next streak. 8. Birdseye. Use the Birdseye Ultimate Perk for a better view of the minimap, making it more difficult for enemies to catch you unaware on a flank. Pair it with the UAV and/or Portable Radar Field Upgrade to reveal the enemy’s direction on each ping. 9. Tactical Insertion. Take control of your next spawn by placing a Tactical Insertion, an especially useful item when you need to hold down a specific area of the map. 10. Buddy system. Traverse the map with a friend to better your odds against enemy encounters. The loser of each skirmish has quite a trek back to their position. Stay frosty. © 2023 Activision Publishing, Inc. ACTIVISION, CALL OF DUTY, and MODERN WARFARE are trademarks of Activision Publishing, Inc. All other trademarks and trade names are the property of their respective owners. For more information, please visit www.callofduty.com and www.youtube.com/callofduty, and follow @Activision and @CallofDuty on Twitter, Instagram, and Facebook. ",
                "feedlabel": "Community Announcements",
                "date": 1690823030,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 1938090
            },
            {
                "gid": "5124584686261235977",
                "title": "Call of Duty: Modern Warfare II Punta Mar Map Intel",
                "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5124584686261235977",
                "is_external_url": true,
                "author": "csmedley",
                "contents": "Punta Mar is ready to skirmish. In this small 6v6 Core Multiplayer map launching with Season 05 for Call of Duty®: Modern Warfare® II, teams will fight across the streets and over the rooftops of a tight arena with little time between engagements. Watch the shop windows for enemy Operators, use the side streets and alleyways to your advantage, and keep pressing for the win. Spawn Point: KorTac {STEAM_CLAN_IMAGE}/42501705/ba8abf6b09d0bb2ee199832f06cf60a3576a2c4c.jpg KorTac Spawn Zone (East) — Backlot It won’t take long for the fighting to begin on this small map, but KorTac forces still have a few options in the match’s opening seconds, namely whether they opt for sticking to ground level or climbing to the Rooftops. On the ground, take the middle path to get right into the thick of the battle on the main road, or head through the northern alley or southern Underpass for tighter, closer-quarters combat. There are several easily accessible ladders leading to the Rooftops of the nearby buildings for those looking to get above the action. Spawn Point: SpecGru {STEAM_CLAN_IMAGE}/42501705/7b55b9e0604783e0a0955d9347bc07a697493c89.jpg SpecGru Spawn Zone (West) – Construction While the SpecGru starting spawn lacks the verticality available to KorTac, the Construction area is also closer to the main road compared to the Backlot. Head north to access the top of the road, with an even better view obtainable by climbing to the Shootout balcony via the dumpster on the building’s south side. Take the southern path toward the Intersection to avoid the main road, instead focusing on short- to mid-ranged battles; watch for enemies firing from the second floor of Stores or rushing in from the Underpass. Map Maneuvers: Route Planning {STEAM_CLAN_IMAGE}/42501705/a9fc6f4b55b1e34e37895a0147db1ffe9d8c858a.jpg For the purposes of this guide, we’re breaking up Punta Mar into five main sections: Construction Center Intersection Rooftops Shrine {STEAM_CLAN_IMAGE}/42501705/aec5b7b82acd9f28551ab9bb5d2d189e13731ed5.jpg Construction The open Construction area features stacked supplies and large vehicles for cover when passing through. Of particular interest are the stacked paving stones; hop onto the barrel beside them for a fortified view of all three entry points. Prepare to encounter enemies doing the same when breaching the area. A sticky grenade thrown just behind their position should convince them to move. Note the southern path leading in and out of Construction; the garage here makes for the perfect ambush point against passing enemies. Use it to cut down traffic in the area and look out for opponents inside when moving through. {STEAM_CLAN_IMAGE}/42501705/45fc6183aaae40dacca252142a73aa8a00272605.jpg Center Including the tourist information center and the buildings around it, Center marks a natural hotbed of activity between the two major spawn points. Climb onto the tourist building for a commanding view over the main road, or fight for a spot on the upper levels of Stores, Shootout, and Hotel. On the ground, watch for enemies coming from the Underpass or firing from Groceries. With many available points of contact surrounding it, Center is likely to be in the thick of battle for much of the match. {STEAM_CLAN_IMAGE}/42501705/df08586e8d06b09f94bfbc84f2651a2c28dcce4c.jpg Intersection At the southern point of the map, Intersection finds Operators battling across storefronts. With Intersection being located about equidistant from the two main spawn points, there will be a lot of clashes here. Fights are bound to break out between Groceries and Stores, and anyone moving through the Intersection additionally becomes exposed to the Center. Move quickly and be ready to engage; in a pinch, the blue truck offers solid cover against attacks from the north. {STEAM_CLAN_IMAGE}/42501705/4effb19898b7382882d503222b7a2a88f67459ca.jpg Rooftops Punta Mar features several ladders and other means of accessing the Rooftops of the eastern buildings, providing Operators with the ability to get high above the competition. From here, players can easily get a full view of the main road, though watch your six as enemies around the Backlot and Shrine can land shots from behind. Also be prepared to fight off intruders joining you here, so swap to your Handgun if your Primary Weapon struggles in close quarters. {STEAM_CLAN_IMAGE}/42501705/9d8b1976f7b5e16bd3b45530c86db30094cee0d1.jpg Shrine The Shrine and the Backlot behind it sit in a fairly open area, so be mindful when moving around here. The nearby Green Building and Fire both face the Shrine, with the upper level of Fire providing another access point to the Rooftops. When capturing objectives in this area, move into one of these two buildings afterward to defend the point; otherwise you’re a sitting duck to anyone on the Rooftops or coming through the narrow passage. Objective Routes and Rotations {STEAM_CLAN_IMAGE}/42501705/59f17dc8c9d434e8892ebefa2e605957d33a6f7d.jpg Mode Intel: Domination Flags can change hands fast on a small map like this, so stay focused on the objective and strive to lock down two flags and hold them. The A and C flags are both near the starting spawns, though these points may change throughout the match if the enemy team’s spawn flag is captured. The Intersection gains extra prominence here as the location for the B flag, so expect heavy bouts of fighting coming from all sides. Try holding down Groceries and Stores to either side of it to cut down on the incoming crossfire. When attacking the C flag in Construction, head in through Shootout to cut off overhead cover for the defenders and let them have it with an air-to-ground streak. On A, use the Shrine for cover against the Rooftops, then set up in Fire or the Green Building to defend it. You’ve likely picked up on a theme here: Grab the flag, then fan out to cover positions around it so you’re not an easy target sitting out in the open. Mode Intel: Search & Destroy While Search & Destroy tends to slow things down, you can still expect a lot of fast-paced rounds here as teams go for the elimination win. With the defenders starting in the Backlot, the attacking team should be ready for Operators to appear on the Rooftops, hoping to use their height advantage to get early eliminations. Consider hoofing it through the Hotel to meet them there or taking the south path toward the B bomb site behind the blue truck in Intersection. With the A bomb site located on the second floor of Fire, it’s a good bet that the attackers will often favor the B site, which isn’t as deep in the enemy starting spawn. The defending team may therefore want to push toward B for a strong early defense. Even if the attackers expect it, it can’t hurt to send your best sharpshooter(s) to the Rooftops, so long as they can fend off early counterattacks. Mode Intel: Hardpoint Prepare to explore every corner of the map with a total of eight Hardpoints, starting in the Center and then moving north to the Green Building in the Backlot. From there, head south to the first floor of Shootout, then northeast to the bottom of Stores, and then back west to the Hotel lobby. Return to the Intersection for the sixth Hardpoint in Groceries; then fight for control of both starting spawns, beginning with Construction and ending on the first floor of Fire. That’s a lot of Hardpoints to get through, but the map’s small size makes travel fast. With the ability to see large sections of the map at a time via the Rooftops, it’s possible to shut down enemies en route before they even get to the objective, so long as you can defend your position. Top Tips {STEAM_CLAN_IMAGE}/42501705/2964b59a8c2f1c70088b5b683b6c830428f8e858.jpg 1. Stay on the move. The danger of the main road combined with the proliferation of traversable buildings may encourage you to find an interior you like and stick to it, but you’ll be more successful if you move aggressively and keep to the front lines of the fight. 2. Battle for the Rooftops. The Rooftops over the eastern buildings are a highlight of the map. There’s sure to be many skirmishes for control over the sights they provide. Learn all the routes leading up here so you can get there fast and know where to look for incoming attacks. 3. Keep your feet on the ground. Even if you are the ruler of the Rooftops, there’s a time and place for everything. If your team needs you elsewhere, get down and fight on the ground. 4. Overclock your Field Upgrade. Field Upgrades like the Trophy System and Portable Radar are invaluable on a small map like Punta Mar, upping your defense against the constant stream of incoming enemies. Consider the Overclock Ultimate Perk to earn them even faster in addition to storing an extra use for times of great need. 5. Double the fun. With traversable buildings lining the main road, you’ll often move from exterior midrange engagements to interior close-quarters fighting. Consider equipping the Overkill Base Perk so you can switch to the best weapon possible in both scenarios. 6. Flash the Garage. When heading to or from Construction along the south path, don’t hesitate to throw a grenade — Flashbang, Stun, or any kind — into the Garage on your way. It’s better to throw it and discover nobody’s there than attempt to defend yourself when it’s too late. 7. Trap the narrow passage. The narrow passage leading to the main road from Shrine is the perfect spot to lay down a Proximity Mine or Claymore. There’s little room to move, so an inattentive Operator will surely cross its path. 8. Van to vet. On the main road and you need to get up to the Rooftops fast? Climb onto the van in front of the veterinary clinic and hop onto the building’s roof to get up high in a jiff. 9. Sights up. A little preparation can go a long way. Raise those sights when turning a corner toward the main road or toward any major new location. On a map this small, there’s a good chance there’ll be an enemy on the other side. 10. No easy retreat. As idyllic as the surroundings may appear, Operators aren’t here to relax. This is an intense, close-range map with little downtime between engagements. That’s not to say you won’t have fun; in fact, it’s a never-ending blast. Head in ready for the fight. Stay frosty. © 2023 Activision Publishing, Inc. ACTIVISION, CALL OF DUTY, and MODERN WARFARE are trademarks of Activision Publishing, Inc. All other trademarks and trade names are the property of their respective owners. For more information, please visit www.callofduty.com and www.youtube.com/callofduty, and follow @Activision and @CallofDuty on Twitter, Instagram, and Facebook. ",
                "feedlabel": "Community Announcements",
                "date": 1690823011,
                "feedname": "steam_community_announcements",
                "feed_type": 1,
                "appid": 1938090
            }
        ],
        "count": 235
    }
}